[
    {
        "URL": "https://x.com/againstwarvoice/status/1860043047284932709",
        "Date": "22/11/2024",
        "Text": "Today: Protestors in Jerusalem block the road, demanding an end to the genocide in Gaza and chanting: \"Security will not be achieved on the corpses of children \"",
        "Weight": 9,
        "Id": 0
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1859991318283289007",
        "Date": "22/11/2024",
        "Text": "Today in Jerusalem: Demonstration against the genocide in Gaza. Protesters were calling for Israeli soldiers to refuse service and to end the assault. The protesters were harassed by people on the street and beaten by police. \n@FreeJerusalem1",
        "Weight": 17,
        "Id": 2
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1858867834903818674",
        "Date": "19/11/2024",
        "Text": "\"Ofer-Ziv is now among over 100 Israeli servicemen and women who have signed a petition addressed to PM  Netanyahu, refusing to return to service without an immediate ceasefire deal in Gaza and return of the Israeli hostages who remain there.\"",
        "Weight": 20,
        "Id": 4
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1858869035749843271",
        "Date": "19/11/2024",
        "Text": "Support Israeli conscientious objectors >>",
        "Weight": 8,
        "Id": 5
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1858857767798251764",
        "Date": "19/11/2024",
        "Text": "Today, settler attack during olive harvest in the West Bank. Settlers arrived with batons, beating and chasing away Palestinians who were harvesting. They beat one solidarity activist and stole his phone. Israeli soldiers who were in the area did not arrest any of the attackers",
        "Weight": 16,
        "Id": 6
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1857857800442908770",
        "Date": "16/11/2024",
        "Text": "Tonight in Jerusalem: Protestors calling \"in Gaza and Sderot children want to live\" and \"from the river to the sea freedom and equality\" at the anti-occupation block at the big demonstration for hostage deal.",
        "Weight": 9,
        "Id": 9
    },
    {
        "URL": "https://x.com/AbbyMartin/status/1857448327480274990",
        "Date": "15/11/2024",
        "Text": "For trying to show our film Gaza Fights For Freedom, anti-Zionist Israelis are being raided, harassed and threatened by police",
        "Weight": 20,
        "Id": 10
    },
    {
        "URL": "https://x.com/OrenZiv_/status/1856946669406835027",
        "Date": "14/11/2024",
        "Text": "Now: police raid the Bedouin village of Um Al Hiram in the Negev, ahead of the demolition of the entire village. In recent days the residents were forced to self demolish their one houses. A Jewish village is expected to be built on the village’s land",
        "Weight": 4,
        "Id": 14
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1855314131659682075",
        "Date": "09/11/2024",
        "Text": "Tonight in Jerusalem: anti-war protestors demending ceasefire, chanting \"Children are children, Jewish and Arab\"",
        "Weight": 4,
        "Id": 16
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1854131174836154778",
        "Date": "06/11/2024",
        "Text": "NOW: Israeli forces are demolishing a house in the West Bank",
        "Weight": 8,
        "Id": 18
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1853547238150082685",
        "Date": "04/11/2024",
        "Text": "Listen to Knesset member Ofer Kasif's powerful speech at a demonstration in Tel Aviv for immediate ceasefire and lasting peace.",
        "Weight": 1,
        "Id": 21
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1853436267616141619",
        "Date": "04/11/2024",
        "Text": "Demonstration against the gen0cide in Gaza in Tel-Aviv: Protestors are calling \"Soldier, attention, you can refuse! soldier, attention, refuse the gen0cide!\"",
        "Weight": 4,
        "Id": 22
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1852846965433786459",
        "Date": "02/11/2024",
        "Text": "Tonight in Tel Aviv, hundreds marched in a demonstration for immediate ceasefire, calling against the genocide in Gaza \n@RadicalBlocTLV",
        "Weight": 10,
        "Id": 24
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1851499746021523950",
        "Date": "30/10/2024",
        "Text": "This morning in Beit Lahia, northern Gaza Strip, about 90 people were killed in a military shelling of a building where they were hiding, 25 of them children under the age of 12.\nThese are horrors beyond comprehension. The genocide in Gaza must stop!",
        "Weight": 13,
        "Id": 25
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1850999704978358714",
        "Date": "28/10/2024",
        "Text": "Tonight in Jerusalem: anti-occupation block in the demonstration for hostage deal. Protestors are demending ceasefire and an end to the genocide in Gaza",
        "Weight": 14,
        "Id": 26
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1850946009096208828",
        "Date": "28/10/2024",
        "Text": "During a demonstration against the genocide in Gaza in Tel Aviv police brutally attacked protestors while snatching signs with words such as \"massacre\" and \"genocide\"",
        "Weight": 15,
        "Id": 27
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1850249056586531241",
        "Date": "26/10/2024",
        "Text": "Tonight in Jerusalem: activists protested the massacre in Gaza, calling \"Security can't be reached on the bodies of children\"",
        "Weight": 4,
        "Id": 29
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1850248240551313799",
        "Date": "26/10/2024",
        "Text": "Jerusalem: anti-war block in the protest for hostage deal, activists are calling for an end to the genocide in Gaza",
        "Weight": 9,
        "Id": 30
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1848446838753394986",
        "Date": "21/10/2024",
        "Text": "Standing tall against adversity, the villagers of Burqa continue their olive harvest despite Israeli forces' use of stun grenades and the arrival of Jewish settlers. #Resistance #Strength #OliveHarvest",
        "Weight": 12,
        "Id": 33
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1848359453428519046",
        "Date": "21/10/2024",
        "Text": "In interview with Aljazeera English, conscientious objector Michael Ofer Ziv talks about the latest refusal initiative aimed at releasing the hostages and ending the war. He also recounts the indiscriminate violence he witnessed in Gaza.",
        "Weight": 4,
        "Id": 34
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1848058040592871842",
        "Date": "20/10/2024",
        "Text": "Today in the Palestinian village of Burqa, near Ramallah, soldiers prevented the olive harvest by using stun grenades and making threats. As the soldiers attempted to evict the locals, masked settlers armed with batons approached.",
        "Weight": 4,
        "Id": 36
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1847711984839544867",
        "Date": "19/10/2024",
        "Text": "Now: Protestors in Jerusalem are demending an end to the massacre in Gaza. Calling \"How many more need to suffer? Human life above all!\" \n@FreeJerusalem1",
        "Weight": 4,
        "Id": 37
    },
    {
        "URL": "https://x.com/JehadAbusalim/status/1847393120452739146",
        "Date": "18/10/2024",
        "Text": "Israel is committing extermination in Jabalia—massacre after massacre. I have nothing more to add. I’ve been writing, talking, and screaming, but there are no words left, not in the way the cliché suggests, but literally. Entire families are being wiped out. Shame on all of us.",
        "Weight": 4,
        "Id": 38
    },
    {
        "URL": "https://x.com/ireallyhateyou/status/1847563679081869453",
        "Date": "19/10/2024",
        "Text": "\"You are a traitor and a despicable Nazi supporter of Hamas... We have taken upon ourselves the task of sifting out all people of your kind and systematically destroying their lives... To drive scum like you out...\"\n\nMessage that a local anti-Zionist friend received at 5AM today.",
        "Weight": 11,
        "Id": 39
    },
    {
        "URL": "https://x.com/MohammadHureini/status/1847220993216987380",
        "Date": "18/10/2024",
        "Text": " Just now masked Israeli settlers protected by the Israeli military attacked the residents of Susya village in my community MASSAFER Yatta , while residents were picking olives in their fields , injuring at least one solidarity activist ! \n\n#Stop_Settlers_terrorism",
        "Weight": 16,
        "Id": 41
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1846242036585800152",
        "Date": "15/10/2024",
        "Text": "Haifa: activists are protesting the ongoing genocide in Gaza and the war in Lebanon.",
        "Weight": 9,
        "Id": 48
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1846241473529844206",
        "Date": "15/10/2024",
        "Text": "During a demonstration against the genocide in Gaza in Jerusalem, a messianic zionist came to harass the activists",
        "Weight": 14,
        "Id": 49
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1845910830597972283",
        "Date": "14/10/2024",
        "Text": "Yotam Vilk, one of the reserve soldiers who initiated the latest refusal letter in an interview with Israeli media \"It [the Israeli government] takes advantage of my willingness to serve in the army to protect Israel's security, to commit war crimes\"",
        "Weight": 32,
        "Id": 52
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1845780889428504993",
        "Date": "14/10/2024",
        "Text": "Severe bombings in Gaza, the genocide continues, and we must resist.",
        "Weight": 9,
        "Id": 53
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1845231420454863307",
        "Date": "12/10/2024",
        "Text": "Demonstration against the genocide in Gaza in Jerusalem, protestors are chanting \"1,2,3,4 stop this gen0cidal war, 5,6,7,8 Israel us an apartheid state\"",
        "Weight": 13,
        "Id": 55
    },
    {
        "URL": "https://x.com/RadicalBlocTLV/status/1845112377991196932",
        "Date": "12/10/2024",
        "Text": "Activists filled the main highway of Tel Aviv with radical writings during the holiday of Yom Kippur, which is the national holiday of atonement and forgiveness.",
        "Weight": 1,
        "Id": 56
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1844984420874223667",
        "Date": "12/10/2024",
        "Text": "Israeli police steeling a drum from a protestor in a demonstration against the genocide in Gaza in Jerusalem",
        "Weight": 17,
        "Id": 57
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1844982126917087495",
        "Date": "12/10/2024",
        "Text": "\"In 12 months, Israel killed 3,100 children under the age of 5 in Gaza. 710 of them were babies under one year old\"",
        "Weight": 8,
        "Id": 58
    },
    {
        "URL": "https://x.com/ytirawi/status/1844825117718642772",
        "Date": "11/10/2024",
        "Text": "A huge massacre in Jabalia Refugee Camp |\n\nAt least 22 Palestinians killed in an Israeli airstrike that wiped out a residential block.\n\nAssaf, Dardona, Jneed and Azzam homes. All erased. In Assaf’s home over 15 killed alone. \n\nThe youngest victim is 7 month old",
        "Weight": 16,
        "Id": 59
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1844485529133584419",
        "Date": "10/10/2024",
        "Text": "Tonight in Jerusalem: Protestors are calling for an end to the mass4cre in jabalia and the gen0cide in Gaza >>>",
        "Weight": 4,
        "Id": 60
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1844372786778906951",
        "Date": "10/10/2024",
        "Text": "Wasington Post reports on the new refusal letter. Read the full article here >> https://washingtonpost.com/world/2024/10/10/israel-lebanon-hezbollah-war-news-gaza/#link-JRCHK4KUYNGNPJRNWN6UG4JE5E…",
        "Weight": 11,
        "Id": 61
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1844262949705351234",
        "Date": "10/10/2024",
        "Text": "We need to keep our attention on north Gaza!",
        "Weight": 4,
        "Id": 63
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1844253122526576743",
        "Date": "10/10/2024",
        "Text": "Appalled by what they see as a far-right spirit sweeping the army, & feeling anger at the abandonment of the hostages, 130 reservists and conscripts say they will no longer report for duty if PM Netanyahu fails to strike a deal with Hamas",
        "Weight": 4,
        "Id": 64
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1844011774271701280",
        "Date": "09/10/2024",
        "Text": "IMPORTANT: This is a massacre, stop arming Israel!",
        "Weight": 4,
        "Id": 66
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1843729715858981128",
        "Date": "08/10/2024",
        "Text": "Israeli forces brutally arrested a Palestinian woman on false charges and then circulated a humiliating photo of her.  Israel must be stopped",
        "Weight": 16,
        "Id": 67
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1843311332893814890",
        "Date": "07/10/2024",
        "Text": "Please Listen to Atalya./ She's our page manager leading the call for the USA and Europe to stop their arms support to Israel. Let's amplify her voice, and share her message!",
        "Weight": 4,
        "Id": 69
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1842994381802144200",
        "Date": "06/10/2024",
        "Text": "Activists in Haifa hung stickers, calling for freedom to Palestine. Even though it may seem like a small action in the overwhelming facist environment in Israel, this is an important statement to have in the public space.",
        "Weight": 8,
        "Id": 70
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1842658016560300101",
        "Date": "05/10/2024",
        "Text": "356 days of genocide in Gaza, protestors in Jerusalem are calling for ceasefire, demending a lasting agreement. The protestors are holding a sign reading \"stop the genocide\".",
        "Weight": 14,
        "Id": 74
    },
    {
        "URL": "https://x.com/972mag/status/1842472510253666434",
        "Date": "05/10/2024",
        "Text": "I’ve cheated death, mourned friends, and lost my livelihood. Just when I was on the cusp of leaving this torment, Israel shut our last crossing to the world.\n\n\n@ruwaidaamer8\n reflects on a year of terror in Gaza.",
        "Weight": 8,
        "Id": 75
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1842095001804689915",
        "Date": "04/10/2024",
        "Text": "\"This is what Israel's government is doing in Lebanon\n This is what the IDF is doing in Lebanon\n This is what most Israelis support\n I am ashamed\n How can you be so delusional and believe that we are the good guys?\"",
        "Weight": 15,
        "Id": 77
    },
    {
        "URL": "https://x.com/IhabHassane/status/1841546475903365166",
        "Date": "02/10/2024",
        "Text": "Today, armed Israeli terrorist settlers attacked my village, assaulting farmers who were harvesting olives. They threatened them with guns, declaring, “This land is ours.”",
        "Weight": 13,
        "Id": 80
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1841110816394727575",
        "Date": "01/10/2024",
        "Text": "\"Israel and journalists\n In the West Bank, in Gaza, in Lebanon, tonight also in Syria.\n Israel kills journalists\n S'fa Ahmed, was killed tonight in Damascus.\"",
        "Weight": 12,
        "Id": 83
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1841109972580532405",
        "Date": "01/10/2024",
        "Text": "The Israeli forces continue the ethnic cleansing of Palestinians in the West Bank, demolishing a family's home and destroying a road connecting villages to the nearest city. We call to the world, stop the Israeli occupation!\nhttps://instagram.com/reel/DAlSy1CNbVQ/?igsh=OGxwcW02Mzl4OHJw…",
        "Weight": 29,
        "Id": 84
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1840845400095309911",
        "Date": "30/09/2024",
        "Text": "Tonight in Jerusalem: protest against a war in Lebanon and the genocide in Gaza. Police violently dispersed the demo, stealing signs and using extreme force",
        "Weight": 9,
        "Id": 85
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1840845624939594177",
        "Date": "30/09/2024",
        "Text": "Video of Israeli police officers stealing a sign reading \"stop the war\" and violently shoving protesters",
        "Weight": 8,
        "Id": 86
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1840115701899506043",
        "Date": "28/09/2024",
        "Text": "Tonight in Jerusalem: anti-war block in the demonstration for hostage deal. We will not be silenced as Israel continues to massacre innocent people! No to the genocide in Gaza and no to a war with Lebanon!",
        "Weight": 13,
        "Id": 87
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1837589353247416403",
        "Date": "21/09/2024",
        "Text": "Now: Activists in Jerusalem calling for an end to the war in Gaza",
        "Weight": 4,
        "Id": 89
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1835025357235536366",
        "Date": "14/09/2024",
        "Text": "Now in Jerusalem: Protestors in Jerusalem yelling at police: \"Where were you in Sde Teiman?\" Refering to the abuse being committed by Israeli forces toward Palestinian detainees",
        "Weight": 12,
        "Id": 93
    },
    {
        "URL": "https://x.com/OrenZiv_/status/1834531027668107496",
        "Date": "13/09/2024",
        "Text": "Now: Israeli forces prevent from youth and children to take part in the Friday prayer in Beita  a week after the killing of activist Ayşenur Ezgi",
        "Weight": 8,
        "Id": 94
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1833395549929656718",
        "Date": "10/09/2024",
        "Text": "Ofer Shorr is a conscientious objector & a junior high school teacher in northern Israel. He is under threat of dismissal for publishing a video on FB explaining why he refused to serve the Occupation. Send him a letter of support > https://bit.ly/OferShorr",
        "Weight": 9,
        "Id": 96
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1833014034943062344",
        "Date": "09/09/2024",
        "Text": "Under cover of war, Israel is demolishing home after home in Silwan. The government has accelerated plans to depopulate the East Jerusalem neighborhood, displacing dozens of Palestinian residents this year.",
        "Weight": 8,
        "Id": 97
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1833010941744623751",
        "Date": "09/09/2024",
        "Text": "Since October 7, Israeli settlers have targeted the al-Auja stream in the West Bank, blocking locals from their source of water. A group of Israelis and Palestinians marching at the site are determined to 'sanctify life' over dispossession and war",
        "Weight": 27,
        "Id": 99
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1832803691285319683",
        "Date": "08/09/2024",
        "Text": "Tal Vardi is an Israeli army reservist who refused service in the war on Gaza. In this video he explains why. Voice your support for Israeli conscientious objectors > https://support.refuser.org",
        "Weight": 20,
        "Id": 102
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1832691697383342455",
        "Date": "08/09/2024",
        "Text": "On Friday, settlers raided the village of Qaryut & torched property. When the army arrived it began shooting at Palestinians who were trying to defend the village, killing a 13 year old girl & wounding one other. Villagers arrested - 5; settlers arrested - 0",
        "Weight": 8,
        "Id": 105
    },
    {
        "URL": "https://x.com/Etanetan23/status/1832034310481727564",
        "Date": "06/09/2024",
        "Text": "An American peace activist was shot and killed during a weekly protest in the West Bank village of Beta, near Nablus. \n\nThese demonstrations, often met with live fire, highlight how under Israeli military rule, there is no legal way to protest peacefully.",
        "Weight": 8,
        "Id": 107
    },
    {
        "URL": "https://x.com/Bendilaowai/status/1831773595212902658",
        "Date": "05/09/2024",
        "Text": "Another evening, another brutality of the Ben-Gvir police of the coexistance city of Haifa in the only democracy in the universe. \nThe protest, led by young Palestinians in solidarity w/ Gaza & Jenin, was already dispersed, so they were just attacking women for fun",
        "Weight": 12,
        "Id": 108
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1831760493415166326",
        "Date": "05/09/2024",
        "Text": "For the sixth day in a row, protestors in Jerusalem are demending a hostage deal now! The protestors are clearly also calling for ceasefire and an end to the continued  assault on Gaza.",
        "Weight": 4,
        "Id": 109
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1831565667813802483",
        "Date": "05/09/2024",
        "Text": "Testimonies from Israel's operation in Jenin: \"anti-tank rifle grenades that destroy civilian infrastructure; attack dogs unleashed against families; Palestinian detainees used as human shields; and live ammunition fired sporadically and recklessly.\"",
        "Weight": 8,
        "Id": 111
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1831220024830239220",
        "Date": "04/09/2024",
        "Text": "Last month, several Israeli army reservists crossed into the Gaza Strip and beat, cuffed and blindfolded Palestinian truck drivers working for international aid agencies. None have been questioned.",
        "Weight": 16,
        "Id": 112
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1831217013840056418",
        "Date": "04/09/2024",
        "Text": "For the third evening in a row protesters took to streets to demand a ceasefire and a hostage deal. Police reacted violently. This video documents a brutal arrest in Tel Aviv.",
        "Weight": 1,
        "Id": 113
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1830914995413995832",
        "Date": "03/09/2024",
        "Text": "Last night in Jerusalem, protestors wrote \"stop the genocide\" on the road in front of Binyamin Netanyahu's house",
        "Weight": 5,
        "Id": 114
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1830842703002632663",
        "Date": "03/09/2024",
        "Text": "BBC investigative report reveals breadth of Israeli government backed campaign of dispossession and displacement of West Bank Palestinians",
        "Weight": 16,
        "Id": 115
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1830839245113598460",
        "Date": "03/09/2024",
        "Text": "Israeli air force official admits war on Gaza could not be sustained without US supplied munitions",
        "Weight": 12,
        "Id": 116
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1830743402427601064",
        "Date": "02/09/2024",
        "Text": "Today in Jerusalem: demonstration against the genocide in Gaza. The police violently dispersed the protest, confiscated megaphones, drums, and signs and arrested one protestor",
        "Weight": 9,
        "Id": 118
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1830479424350740891",
        "Date": "02/09/2024",
        "Text": "Hundreds of thousands took to the streets of Tel Aviv to call for a ceasefire and hostage deal. Police reacted violently. Thread: 1/ Police use stun grenades https://x.com/Alimut_Israel//Alimut_Israel/status/1830339166351118410…",
        "Weight": 9,
        "Id": 121
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1830321660580270414",
        "Date": "01/09/2024",
        "Text": "Today in Jerusalem: anti-war block in the demonstration for hostage deal  following the death of six hostages. Demonstrators are chanting \"Children are children, Arab and Jewish\" and calling for ceasefire.",
        "Weight": 4,
        "Id": 124
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1830123665590976929",
        "Date": "01/09/2024",
        "Text": "Armed and uniformed settler terrorizes Palestinian shepherd's in the southern West Bank",
        "Weight": 4,
        "Id": 127
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1830122230174326890",
        "Date": "01/09/2024",
        "Text": "Mounted police violently dispersed pro hostage deal protestors in Tel Aviv Saturday night. In this video they can be seen trampling Natalie Zangauker, whose borther Matan is held in Gaza.",
        "Weight": 5,
        "Id": 128
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1829925569833611613",
        "Date": "31/08/2024",
        "Text": "Today, a joint Palestinian-Jewish demonstration in the occupaied territories. Near Al-Auja, in the Jordan-Valley Palestinian and Jewish protesters called for freedom and an end to the occupation and genocide.",
        "Weight": 26,
        "Id": 130
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1829030903974117398",
        "Date": "29/08/2024",
        "Text": "Israeli army it had advance warning of settler attack on Jit, in which one Palestinian was killed and several others wounded, and did not act to prevent it.",
        "Weight": 12,
        "Id": 132
    },
    {
        "URL": "https://x.com/MSNBC/status/1826415378198667598",
        "Date": "22/08/2024",
        "Text": "Parents of U.S. hostage in Gaza, Hersh Goldberg-Polin, at DNC. \"...the one thing that can most immediately release pressure and bring calm to the entire region: a deal that brings this diverse group of 109 hostages home and ends the suffering of the innocent civilians in Gaza.\"",
        "Weight": 8,
        "Id": 133
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1828738463941734800",
        "Date": "28/08/2024",
        "Text": "Theft of water has become a common tactic of settler militias in their drive to displace Palestinians.",
        "Weight": 8,
        "Id": 135
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1828666291483234582",
        "Date": "28/08/2024",
        "Text": "Two armed and uniformed settlers attempt to steal herd from Palestinian village of al Boabe in the southern West Bank. This was the first move in a major attack on the community on Sunday that left several residents injured.",
        "Weight": 4,
        "Id": 136
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1828306306098221236",
        "Date": "27/08/2024",
        "Text": "Police closed the Hadash party's Haifa branch over a planned screening of a film on Israeli military activity in Jenin they claim was banned in Israel (it wasn't)",
        "Weight": 12,
        "Id": 138
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1828301348380561572",
        "Date": "27/08/2024",
        "Text": "Last night, Wadi Rahal near Bethlehem: Settler militia raiding village shoots and kills one Palestinian and wounds three others.",
        "Weight": 4,
        "Id": 139
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1828063405686538322",
        "Date": "26/08/2024",
        "Text": "Across the West Bank, Palestinians face daily attacks aimed at their dispossession and displacement. On Sunday, the victims were from a small shepherding community in the southern West Bank.",
        "Weight": 8,
        "Id": 140
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1827585182955634898",
        "Date": "25/08/2024",
        "Text": "On Saturday settlers raided the village of Susiya in the southern West Bank, attacking the Palestinian villagers with clubs and rocks. In this region, Masafer Yatta, army and settlers work hand in hand to displace the residents.",
        "Weight": 4,
        "Id": 142
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1827591812657119535",
        "Date": "25/08/2024",
        "Text": "On Saturday Palestinians in at least three villages across the West Bank faced attacks by settler militias aimed at their displacement. Not one of the raiders was arrested.",
        "Weight": 8,
        "Id": 144
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1826697667528826903",
        "Date": "22/08/2024",
        "Text": "The residetns of Zanuta, a Palestinian village in the West Bank, were finally able to return to their land after esceping because of violence and threts from settlers.",
        "Weight": 4,
        "Id": 146
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1825868922874212411",
        "Date": "20/08/2024",
        "Text": "Nephew of Avraham Munder, a hostage killed in Gaza: \"Israel has chosen revenge over life. This is price the hostages and their families pay for the slogan 'Victory Together'. There will be no victory for my uncle.\"",
        "Weight": 8,
        "Id": 150
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1825835127387140466",
        "Date": "20/08/2024",
        "Text": "Today, the Israeli army announced that it has recovered the bodies of 6 Israelis who were kidnapped alive on October 7th. Israel's genocidal attack on Gaza is not only killing Palestinians, it is also killing the hostages. Join our call for a ceasefire >>",
        "Weight": 40,
        "Id": 151
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1825773036944949439",
        "Date": "20/08/2024",
        "Text": "A British diplomat says he has resigned from the Foreign Office because he believes that arms sales to Israel may be making the UK “complicit in war crimes.\"",
        "Weight": 16,
        "Id": 152
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1825772434072416273",
        "Date": "20/08/2024",
        "Text": "Denial of access to water in the searing summer heat is a common method in use by the settlers to dispossess and displace Palestinians.",
        "Weight": 8,
        "Id": 153
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1825411504490848566",
        "Date": "19/08/2024",
        "Text": "280 aid workers were killed worldwide in 2023, a record number. More than half of the deaths, 163, were in Gaza in the last three months of the year. 2024 is on course to be even worse.\n\nhttps://sg.news.yahoo.com/un-warns-unacceptable-level-violence-041810108.html…",
        "Weight": 4,
        "Id": 154
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1825406926609326101",
        "Date": "19/08/2024",
        "Text": "Across the West Bank, Palestinians face daily attacks from both army and settlers, working hand in hand to dispossess and displace them.",
        "Weight": 8,
        "Id": 155
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1824459694854848607",
        "Date": "16/08/2024",
        "Text": "As UK Foreign Secretary visits, war resistance activists chained themselves to the gate of the British Consulate in Jerusalem, demanding an end to arm sales to Israel",
        "Weight": 4,
        "Id": 157
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1824307321494774129",
        "Date": "16/08/2024",
        "Text": "Last night, Jit, northern West Bank: Dozens of armed settlers raided the village, burned houses and cars, shot and killed one Palestinian and seriously wounded another.",
        "Weight": 4,
        "Id": 158
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1824313775501062233",
        "Date": "16/08/2024",
        "Text": "These are pogroms perpetrated by damned Judeo-Nazis who are no different from their ideological ancestors somewhere in 1930s Germany.\nWith the encouragement of the racist government of atrocities, they murdered a 23-year-old Palestinian this evening, injured several more, burned",
        "Weight": 8,
        "Id": 160
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1823950882498592802",
        "Date": "15/08/2024",
        "Text": "40,000 dead: \"a cold examination of the numbers killed in the Gaza Strip reveals this is one of the bloodiest wars since the beginning of the century, especially if you examine the rate of mortality [2%] out of the total population.\"",
        "Weight": 4,
        "Id": 162
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1823947440212398421",
        "Date": "15/08/2024",
        "Text": "Haaretz Editorial: Israeli settler violence in the West Bank isn't the exception. It's the rule. The Israeli public must awaken from its moral coma regarding the barbarization of Jewish ultranationalism.",
        "Weight": 20,
        "Id": 163
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1823945543598436716",
        "Date": "15/08/2024",
        "Text": "Across the West Bank, Palestinians face daily attacks aimed at their dispossession and displacement.",
        "Weight": 8,
        "Id": 164
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1823601347557572872",
        "Date": "14/08/2024",
        "Text": "In a powerful essay in the Guardian Israeli genocide scholar Omer Bartov says that \"it is no longer possible to deny that Israel was engaged in systematic war crimes, crimes against humanity and genocidal actions\"",
        "Weight": 31,
        "Id": 165
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1823256385221456202",
        "Date": "13/08/2024",
        "Text": "Join the thousands from around the world who have voiced their support for Israeli conscientious objectors. Let them know we have their back!",
        "Weight": 8,
        "Id": 168
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1823222189992067210",
        "Date": "13/08/2024",
        "Text": "Across the West Bank Palestinians face daily attacks aimed at their dispossession and displacement.",
        "Weight": 8,
        "Id": 170
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1823220623402823728",
        "Date": "13/08/2024",
        "Text": "Hundreds of Israelis gather at prayer rally organized by settler groups near Gaza border, urging re-settlement of Strip. \"We have over 600 families ready to move here. We can't wait for the war to end\", a participant said.",
        "Weight": 15,
        "Id": 171
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1822993663116345650",
        "Date": "12/08/2024",
        "Text": "Michael Ofer Ziv and Yuval Green were called up after October 7th. After serving in Gaza and witnessing the military's destructive approach, they tell CNN why they, and dozens of others, are refusing to serve again.",
        "Weight": 9,
        "Id": 172
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1822974149817500073",
        "Date": "12/08/2024",
        "Text": "Serving as an IDF reservist in Gaza, Yuval Green says he witnessed destruction, looting and a desire for revenge by fellow soldiers, and will no longer serve. \"We don't care enough about Palestinian lives\", he tells CNN",
        "Weight": 8,
        "Id": 173
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1822969212110786879",
        "Date": "12/08/2024",
        "Text": "Michael Ofer Ziv and Yuval Green were called up after October 7th. After serving in Gaza and witnessing the military's destructive approach, they tell CNN why they, and dozens of others, are refusing to serve again.",
        "Weight": 9,
        "Id": 174
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1822860513782444468",
        "Date": "12/08/2024",
        "Text": "Food shortages, crumbling infrastructure, a failing medical system, flowing sewage, waste buildup, and summer heat have turned the humanitarian crisis in Gaza into a serious epidemiological threat",
        "Weight": 4,
        "Id": 175
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1822589738596938023",
        "Date": "11/08/2024",
        "Text": "On Friday a car with Palestinian women and children accidently entered a West Bank settler \"outpost\". They were attacked & their car set on fire. Similar incidents happen daily, but barely register. This one did because the victims were Israeli citizens",
        "Weight": 12,
        "Id": 176
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1822510374387663002",
        "Date": "11/08/2024",
        "Text": "Three Israeli army refusers: ‘We will not participate in genocide’\nConscientious objectors Yuval Moav, Itamar Greenberg, and Oryan Mueller explain why they are willing to go to jail in order to stand against the war.",
        "Weight": 13,
        "Id": 178
    },
    {
        "URL": "https://x.com/MHureini/status/1822341654654722062",
        "Date": "10/08/2024",
        "Text": "Listen to what settlers from The outpost of Hafat Ma'on had to say to us this evening, when they raided our land, supported by soldiers. Genocide seems to be a fun concept for them.",
        "Weight": 5,
        "Id": 181
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1822347486490489278",
        "Date": "10/08/2024",
        "Text": "Now (10.8.24) in Jerusalem: Anti-war block in the big demonstration for hostage deal. Protestors in the block are demending the end of the occupation and the genocide in Gaza.",
        "Weight": 14,
        "Id": 182
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1821541882410807428",
        "Date": "08/08/2024",
        "Text": "The Kisiya family has been relentlessly fighting for a week now to reclaim their land from Israeli settlers. A collaboration between the military and the settlers is aiming to seize Palestinian territory. Stand with us as we support their battle.",
        "Weight": 12,
        "Id": 183
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1821090511630778684",
        "Date": "07/08/2024",
        "Text": "Across the West Bank, Palestinians face daily attacks aimed at their dispossession and displacement.",
        "Weight": 8,
        "Id": 184
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1821113164659929478",
        "Date": "07/08/2024",
        "Text": "Israeli Channel 12 TV news publishes security camera footage of the gang rape of a Palestinian detainee at the Sde Teiman torture facility",
        "Weight": 12,
        "Id": 186
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1821043123281117281",
        "Date": "07/08/2024",
        "Text": "Tuesday, Tuba in the southern West Bank: Settlers armed with clubs attacked Palestinian shepherds and attempted to steal their herd. \nThe residents of this region, Masafer Yatta, face daily attacks from both the army and settlers who work hand in hand to displace them.",
        "Weight": 4,
        "Id": 190
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1820680977917555142",
        "Date": "06/08/2024",
        "Text": "A new report reveals dozens of testimonies from Palestinians detained since the Gaza war began. Most were released without prosecution, and their accounts detail routine abuse, starvation, humiliation, sleep deprivation, and denial of medical treatment",
        "Weight": 12,
        "Id": 191
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1820687796392038546",
        "Date": "06/08/2024",
        "Text": "Across the West Bank, Palestinians face daily attacks aimed at their dispossession and displacement. In the rare cases when the Israeli army shows up, it either enables the attacks or is totally ineffectual in stopping them.",
        "Weight": 16,
        "Id": 193
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1820375146189774926",
        "Date": "05/08/2024",
        "Text": "Prime Minister Benjamin Netanyahu's new official spokesperson has publically shared his support for the  \"transfer\" of Gazans and Jewish settlement of the Gaza Strip",
        "Weight": 12,
        "Id": 194
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1820360790118977844",
        "Date": "05/08/2024",
        "Text": "In the Masafer Yatta region of the southern West Bank Israeli army and settlers work hand in hand to displace the Plestinian residents.",
        "Weight": 8,
        "Id": 195
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1820317960629633202",
        "Date": "05/08/2024",
        "Text": "The Israeli army is using Amazon’s cloud service to store surveillance information on Gaza’s population, while procuring further AI tools from Google and Microsoft for military purposes, an investigation reveals.",
        "Weight": 12,
        "Id": 197
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1819966274970996885",
        "Date": "04/08/2024",
        "Text": "Thread: Over the weekend, across the West Bank, Palestinians faced attacks by settlers aimed the dispossession and displacement.",
        "Weight": 8,
        "Id": 199
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1819968192111837362",
        "Date": "04/08/2024",
        "Text": "Jordan Valley: Settlers deny Palestinian cowherd access to spring",
        "Weight": 4,
        "Id": 200
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1819969198489042947",
        "Date": "04/08/2024",
        "Text": "Tuba, southern West Bank: Settler drives Palestinian shepherd off village lands",
        "Weight": 4,
        "Id": 201
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1819800274732450277",
        "Date": "03/08/2024",
        "Text": "Anti-war block in the demonstration in Jerusalem calling for hostage deal. They are chanting \"from Rafah to Sderot, people want to live\" and demending ceasefire",
        "Weight": 2,
        "Id": 202
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1819125721878462871",
        "Date": "01/08/2024",
        "Text": "Tonight in Haifa: demonstration against the genocide in Gaza. Police snatched signs and Palestinian flags and arrested two activists",
        "Weight": 13,
        "Id": 204
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1818933650597015619",
        "Date": "01/08/2024",
        "Text": "These are the two hands of Israeli occupation and dispossession, working together for the same goal. This is also why it is so important to support those who refuse to serve.\nJoin us in supporting them through our petition:",
        "Weight": 13,
        "Id": 207
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1818777989490131223",
        "Date": "31/07/2024",
        "Text": "Today, Jewish settlers tried to get a Palestinian family evicted from their land in Beit Jala (occupied territories). The military decided to declare closed military zone on the area, but to let the Jewish settlers stay and to evict the family and .solidarity activists for 24",
        "Weight": 12,
        "Id": 209
    },
    {
        "URL": "https://x.com/freyisrael1/status/1818655131719577771",
        "Date": "31/07/2024",
        "Text": "Meir Ben Shatrit, an IDF soldier suspected of sadistic abuse of Palestinian detainees, admits that his interrogation by the military police was only a sham. \"You feel they want to thank you, there were days when they applauded us,\" he said.",
        "Weight": 4,
        "Id": 210
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1818630180883312931",
        "Date": "31/07/2024",
        "Text": "Skin diseases are running rampant in Gaza due to the  the appalling conditions in the overcrowded tent camps. Doctors are wrestling with more than 103,000 cases of lice and scabies and 65,000 cases of skin rashes, according to the WHO.",
        "Weight": 4,
        "Id": 212
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1818572888204575160",
        "Date": "31/07/2024",
        "Text": "The UN human rights office issued a report Wednesday saying Palestinian detainees taken by Israeli authorities since the October 7 attacks have faced waterboarding, sleep deprivation, electric shocks and other torture and mistreatment.",
        "Weight": 12,
        "Id": 213
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1818517830909788301",
        "Date": "31/07/2024",
        "Text": "Sde Teiman is an obscenity in such plain sight that it is forcing a reckoning among many Israelis and supporters of Israel: A doctor at the facility said after seeing the abused detainee that he \"couldn't believe an Israeli jailer could do such a thing.\"",
        "Weight": 23,
        "Id": 214
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1818278959643308040",
        "Date": "30/07/2024",
        "Text": "This is what happens when you toe the Israeli line on war crimes: \"today, I realized how much I was lied to...they [my Israeli sources] finally said the truth. That Israel is routinely torturing inmates. That sexual abuse is fairly common there [at Sde Teiman]\"",
        "Weight": 32,
        "Id": 215
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1818146492432970075",
        "Date": "30/07/2024",
        "Text": "IDF admits soldiers who blew up Rafah water plant did so under orders",
        "Weight": 2,
        "Id": 216
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1817902938070601920",
        "Date": "29/07/2024",
        "Text": "For further evidence that Israel was incapable of investigating itself, look at what happened today when the Military Police tried interrogate soldiers suspected of sodomizing a detainee at Sde Teiman. Right wing protesters, led by an MK, overan the facility.",
        "Weight": 4,
        "Id": 217
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1817894834524278868",
        "Date": "29/07/2024",
        "Text": "Israeli officials: The UK will likely announce it will suspend issuing export licenses for arms sales to Israel in the coming days",
        "Weight": 12,
        "Id": 218
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1817788941480665131",
        "Date": "29/07/2024",
        "Text": "Physicians for Human Rights-Israel called the decision it 'a cruel game by the Israeli government with children's lives'",
        "Weight": 12,
        "Id": 219
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1817786297928372311",
        "Date": "29/07/2024",
        "Text": "Across the West Bank and East Jerusalem, Palestinians face daily attacks aimed at their dispossession and displacement.",
        "Weight": 8,
        "Id": 220
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1817452271644430457",
        "Date": "28/07/2024",
        "Text": "Three Israeli reserve soldiers who fought in the war on Gaza say why they no longer want to be part of military",
        "Weight": 12,
        "Id": 221
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1817270046378664043",
        "Date": "27/07/2024",
        "Text": "Tonight (27.7) in Jerusalem, protestors demanded water for all in response to the lack of water supply to a Palestinian neighborhood in the city. They are also demending ceasefire and an end to the occupation  \n@FreeJerusalem1",
        "Weight": 9,
        "Id": 222
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1816573100261023928",
        "Date": "25/07/2024",
        "Text": "Tonight (25.7.24) in Tel Aviv: Demonstration for ceasefire. Two activists were arrested, one for wearing a watermelon shirt and the other for a watermelon sign. \n@RadicalBlocTLV",
        "Weight": 1,
        "Id": 223
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1816406852109812198",
        "Date": "25/07/2024",
        "Text": "Australia sanctions seven Israeli settlers involved in West Bank violence against Palestinians. The announcement said some of those sanctioned were involved in sexual assaults and abuse.",
        "Weight": 16,
        "Id": 224
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1816081397599047800",
        "Date": "24/07/2024",
        "Text": "Across the West Bank and East Jerusalem, Palestinians face daily attacks aimed at their dispossession and displacement. For the@CIJ_ICJ opinion to matter to them, it needs to be followed by action. Sanctions. Now.",
        "Weight": 8,
        "Id": 226
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1815625818187436219",
        "Date": "23/07/2024",
        "Text": "21,000 children are missing in Gaza. Let that number sink in. Twenty one thousand children buried under the rubble.",
        "Weight": 4,
        "Id": 229
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1815623294516691305",
        "Date": "23/07/2024",
        "Text": "Burin, northern West Bank, Monday: Settlers torch Palestinian fields and olive groves. \n\nIn the lawless West Bank the only rule is settler rule.",
        "Weight": 4,
        "Id": 230
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1815614737843204506",
        "Date": "23/07/2024",
        "Text": "Cancer patients go untreated; 26 out of 36 hospitals aren't functioning; most of the water isn't drinkable and sewage flows in the streets. Those are just some factors of a very bleak prognosis for the health of Gazans even after a cease-fire is reached",
        "Weight": 4,
        "Id": 232
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1815307621080940547",
        "Date": "22/07/2024",
        "Text": "Polio has been detected in Gaza sewage. Eight Israeli public health professors call for an immediate ceasefire to combat its spread",
        "Weight": 12,
        "Id": 233
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1815268116391141784",
        "Date": "22/07/2024",
        "Text": "Haaretz's Jerusalem correspondent reports that a waitress was arrested at work yesterday evening for wearing a shirt with the text \"Marching for Palestine\". He notes that the settlers who attacked Palestinians and activists with clubs earlier in the day are still at large.",
        "Weight": 12,
        "Id": 234
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1815252479593816193",
        "Date": "22/07/2024",
        "Text": "Across the West Bank and East Jerusalem, Palestinians face daily attacks aimed at their dispossession and displacement. For the \n@CIJ_ICJ\n opinion to matter to them, it needs to be followed by action. Sanctions. Now.",
        "Weight": 8,
        "Id": 235
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1814934466353152093",
        "Date": "21/07/2024",
        "Text": "Across the West Bank and East Jerusalem, Palestinians face daily attacks aimed at their dispossession and displacement. For the \n@CIJ_ICJ\n opinion to matter to them, it needs to be followed by action. Sanctions. Now.",
        "Weight": 8,
        "Id": 237
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1814309190187332018",
        "Date": "19/07/2024",
        "Text": "Across the West Bank and East Jerusalem, Palestinians face daily attacks aimed at their dispossession and displacement. For the \n@CIJ_ICJ\n opinion to matter to them, it needs to be followed by action. Sanctions. Now.",
        "Weight": 8,
        "Id": 240
    },
    {
        "URL": "https://x.com/Ha_Matar/status/1813868264872870077",
        "Date": "18/07/2024",
        "Text": "A new refuser, shocked by what he saw and heard in Gaza",
        "Weight": 4,
        "Id": 244
    },
    {
        "URL": "https://x.com/YonatanZeigen/status/1813842460604326345",
        "Date": "18/07/2024",
        "Text": "In these heartbreaking circumstances, I would rather know that my beloved mom Vivian's name is helping to feed children in Gaza than see it engraved on a missile that kills them.",
        "Weight": 4,
        "Id": 245
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1813808703570923995",
        "Date": "18/07/2024",
        "Text": "Investigation: Three groups that have prevented humanitarian aid from reaching Gaza — including one accused of looting or destroying supplies — have raised more than $200,000 in tax deductible donations in the U.S. and Israel",
        "Weight": 8,
        "Id": 247
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1813231316436963789",
        "Date": "16/07/2024",
        "Text": "Michael Ofer Ziv is a reserve officer in the Israeli army. In this video he recounts his experience in the war on Gaza and why it drove him to refuse to enlist again, even if it means going to jail. \nVoice your support for Israeli conscientious objectors > https://support.refuser.org",
        "Weight": 20,
        "Id": 248
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1813200062874296796",
        "Date": "16/07/2024",
        "Text": "Inside the Secretive Israeli army Committee That Decides Who Is a Conscientious Objector\nHuman rights advocates say even MLK and Mahatma Gandhi would not be recognized as conscientious objectors based on the army's definition of the term.",
        "Weight": 8,
        "Id": 250
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1812841824769266033",
        "Date": "15/07/2024",
        "Text": "Bulldozers of the Jerusalem Municipality destroyed three homes in the Palestinian village of Wallaje this morning. Because of discriminatory laws, Palestinians cannot build \"legally\" in Jerusalem.",
        "Weight": 12,
        "Id": 252
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1812376434280636789",
        "Date": "14/07/2024",
        "Text": "Using \"maximum firepower\", including \"bunker busters\", on a refugee encampment in a designated humanitarian zone, killing at least 100 and wounding hundreds more, is a war crime, no matter the target.",
        "Weight": 5,
        "Id": 254
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1812356191642649064",
        "Date": "14/07/2024",
        "Text": "Susiya, southern West Bank: Settlers invade village and stone house, injuring one. When the army arrived one arrest was made -- of the Palestinian owner of the house.",
        "Weight": 4,
        "Id": 255
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1812217873261064645",
        "Date": "13/07/2024",
        "Text": "Jerusalem: activists against the massacre in Gaza held an anti-war block in the demonstration for hostage deal. Demanding ceasefire now.",
        "Weight": 4,
        "Id": 256
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1811472972886036510",
        "Date": "11/07/2024",
        "Text": "A fascist extremist attacks solidarity activists holding an exhibition for the children of Gaza in Jerusalem. How does an Israeli \"journalist\" describe it? \"A right-wing activist prevents\"\nAs if this is not violence used to silence",
        "Weight": 12,
        "Id": 257
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1811076723573690668",
        "Date": "10/07/2024",
        "Text": "Students in the architecture department in the Bezalel Academy in Jerusalem hung posters protesting the destruction of homes and heritage in Gaza. Criticizing students and staff who serve in the military and support its actions \n@FreeJerusalem1",
        "Weight": 4,
        "Id": 264
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1810643281610424715",
        "Date": "09/07/2024",
        "Text": "Among the many structures demolished by the Israeli army yesterday in the villages of Massafer Yatta was a school serving 60 children aged 5-11.",
        "Weight": 8,
        "Id": 265
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1810553700915515798",
        "Date": "09/07/2024",
        "Text": "The testomonies in this article are chilling: Israeli soldiers describe the near-total absence of firing regulations in the Gaza war, with troops shooting as they please, setting homes ablaze, and leaving corpses on the streets.",
        "Weight": 12,
        "Id": 266
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1810568759221862599",
        "Date": "09/07/2024",
        "Text": "“Near the army compound between the northern and southern Gaza Strip, we saw about 10 bodies shot in the head, apparently by a sniper, [seemingly while] trying to return to the north. The bodies were decomposing; there were dogs and cats around them.”",
        "Weight": 4,
        "Id": 267
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1810568498168697169",
        "Date": "09/07/2024",
        "Text": "“We were in a small area. Every day, at least one or two [civilians] are killed [because] they walked in a no-go area. I don’t know who is a terrorist and who is not, but most of them did not carry weapons.”",
        "Weight": 5,
        "Id": 268
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1810557782619238477",
        "Date": "09/07/2024",
        "Text": "One day after settlers cut water pipes and electricity cables to Qawawis in the southern West Bank, the army demolished a family home in the village. In this region, Massafer Yatta, army and settlers are working hand in hand to displace the Palestinian residents.",
        "Weight": 4,
        "Id": 271
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1810194949834453021",
        "Date": "08/07/2024",
        "Text": "For the second time in three days, the mayor of Ariel, a large settlement in the central West Bank, sabotaged the entrance to the neighboring Palestinian town of Salfit. In the lawless West Bank, the only rule is settler rule.",
        "Weight": 4,
        "Id": 274
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1810185769325154349",
        "Date": "08/07/2024",
        "Text": "The Lancet: Real Gaza death toll could be as high as 186,000 (7.9% of population)",
        "Weight": 4,
        "Id": 275
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1809829782181306641",
        "Date": "07/07/2024",
        "Text": "Saturday, Turmus Aya, central West Bank: Settlers torch Palestinian home",
        "Weight": 4,
        "Id": 277
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1809826693294575817",
        "Date": "07/07/2024",
        "Text": "At 1:25 note the Israeli army vehicle escorting the raiders back to the settlement after the olive grove has been set on fire",
        "Weight": 8,
        "Id": 278
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1809822949962063891",
        "Date": "07/07/2024",
        "Text": "Massafer Bani Naim, southern West Bank: Armed settler drives Palestinian shepherds off their land",
        "Weight": 4,
        "Id": 279
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1809821569180475827",
        "Date": "07/07/2024",
        "Text": "Not one but three wounded, partly naked Palestinians were humiliated by Israeli army soldiers who forced them to lie on their broiling-hot vehicles and be paraded around Jenin last week.",
        "Weight": 16,
        "Id": 280
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1809682761273470993",
        "Date": "06/07/2024",
        "Text": "Demonstration for ceasefire in Jerusalem tonight, protestors blocked the road and called \"one two three four, stop this genocidal war! Five, six, seven, eight, Israel is an apartheid state!\"",
        "Weight": 4,
        "Id": 281
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1809124167150694738",
        "Date": "05/07/2024",
        "Text": "Haaretz editorial: \"Facts are being created on the ground [in Gaza] that perpetuate IDF's presence and infrastructure is being developed for future civilian settlement – exactly like in the West Bank after 1967.\"",
        "Weight": 4,
        "Id": 283
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1808781166301884700",
        "Date": "04/07/2024",
        "Text": "Haaretz investigation: The Israeli army has established a permanent presence in 26% of the Gaza Strip, and the settler movement is using the facilties as a springboard for resettling of the territory.",
        "Weight": 12,
        "Id": 289
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1808597439303282760",
        "Date": "03/07/2024",
        "Text": "The world needs to have eyes on the occupation territories in the West Bank.  The last week was rampant with cruel settler violence",
        "Weight": 5,
        "Id": 293
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1808404125853311239",
        "Date": "03/07/2024",
        "Text": "Last night, Luban a-Sharqiya, northern West Bank: Settlers stone Palestinian traffic. Several injured. No arrests.",
        "Weight": 4,
        "Id": 294
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1808402983094259737",
        "Date": "03/07/2024",
        "Text": "Yesterday, for the third time in the week since Israel demolished homes at Um al-Heir, in the southern West Bank, armed settlers escorted by the army raided the village. They set up a tent, held a prayer and cut water pipes. This is one coordinated campaign of displacement.",
        "Weight": 4,
        "Id": 295
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1807299178009088204",
        "Date": "30/06/2024",
        "Text": "\"Extremist right-wing parties in Europe, born out of European fascism and from the heart of antisemitism, have transformed into the Israeli government’s European 'natural partners'.”",
        "Weight": 11,
        "Id": 309
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1807130250566160618",
        "Date": "29/06/2024",
        "Text": "Now in Jerusalem: demonstration against the genocide in Gaza. Protestors called \"1,2,3,4 stop this genocidal war \"",
        "Weight": 9,
        "Id": 313
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1806428612314492963",
        "Date": "27/06/2024",
        "Text": "Protest against the genocide in Gaza tonight in Tel Aviv. Activists read the names of the Palestinian children who were murdered. They were assaulted by people on the street who forcefully grabbed their signs \n@RadicalBlocTLV",
        "Weight": 14,
        "Id": 315
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1806298130582802590",
        "Date": "27/06/2024",
        "Text": "In this interview with Channel 13 TV, Yuval Green describes the complicated journey leading to his refusal to serve in Gaza. Refusal, regardless of motivation, has the potential to help end the massacre.",
        "Weight": 4,
        "Id": 316
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1805985745930211608",
        "Date": "26/06/2024",
        "Text": "Security sources tell Haaretz that Israel Prision Service has dramatically decreased food given to Palestinian prisoners to the point of starvation.\nSource: https://haaretz.co.il/news/politics/2024-06-26/ty-article/.premium/00000190-50f5-d37f-a392-7affdb400000…",
        "Weight": 8,
        "Id": 321
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1805870954314149962",
        "Date": "26/06/2024",
        "Text": "In the West Bank, the daily Israeli campaign to displace Palestinians continues unabated",
        "Weight": 16,
        "Id": 322
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1805600584231203057",
        "Date": "25/06/2024",
        "Text": "Testimony of Cpt. Michael Ofer Ziv, reservist Gaza war refuser: \"From afar it's easy to say 'that's how it is in war, people are killed', but it's 30,000, mostly buried under rubble after aerial bombings. The feeling is that the firing is indiscriminate\"",
        "Weight": 4,
        "Id": 325
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1805846799971656061",
        "Date": "26/06/2024",
        "Text": "Support Israeli Conscientious Objectors -->",
        "Weight": 8,
        "Id": 326
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1805840584235499611",
        "Date": "26/06/2024",
        "Text": "Jews and Arabs Were Good Neighbors in This Israeli City. Then Settlers Showed Up With Guns: Arab community in the city of Beit She'an is mostly made up of families who collaborated with Israel. Violent right-wing extremists have decided they cannot stay",
        "Weight": 16,
        "Id": 327
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1805496614804492520",
        "Date": "25/06/2024",
        "Text": "Support Israeli Conscientious Objectors -->",
        "Weight": 8,
        "Id": 330
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1805252194960081194",
        "Date": "24/06/2024",
        "Text": "Israeli Finance Minister, \n@bezalelsm\n in Knesset today: \"We will annex the West Bank, today in practice and later by law\"",
        "Weight": 8,
        "Id": 332
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1805156552262709254",
        "Date": "24/06/2024",
        "Text": "Mattan Helman, our director, is hopeful: \"I believe that the growing Israeli war resistance movement has the potential to transform this horrific situation into a turning point: Ending Israel’s occupation of the Palestinians\"\nRead the newsletter here --> https://bit.ly/3XxpJ7v",
        "Weight": 25,
        "Id": 333
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1805126369774334275",
        "Date": "24/06/2024",
        "Text": "Israel's Top Court Orders State to Reveal Conditions of Gaza Detainees at Sde Teiman Prison: The state will be required to address issues like medical treatment, punishment methods and cuffing conditions for Palestinians",
        "Weight": 16,
        "Id": 334
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1804878821276934515",
        "Date": "23/06/2024",
        "Text": "Israeli Public Defender's Office: Police violence at protests is the \"result of non-enforcement against violent police officers, turning a blind eye and practicing leniency toward police officers who break the law\"",
        "Weight": 8,
        "Id": 335
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1804769432373178462",
        "Date": "23/06/2024",
        "Text": "Thread: Last night the largest anti-government protest since Ocotober 7 was held in Tel Aviv. Police reacted violently.\n1/ Mounted police trample protesters",
        "Weight": 1,
        "Id": 336
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1804787916624846921",
        "Date": "23/06/2024",
        "Text": "In recording from closed door conference with settler leaders \n@bezalelsm\n says \n@IsraeliPM\n is fully on board with plans -- now being implemented -- for de facto annexation of West Bank",
        "Weight": 8,
        "Id": 339
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1804741641187492062",
        "Date": "23/06/2024",
        "Text": "Video from Jenin shows wounded Palestinian strapped to IDF vehicle hood as human shield",
        "Weight": 4,
        "Id": 340
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1804616776136991024",
        "Date": "22/06/2024",
        "Text": "260 days since October 7th, Israeli activists are demonstrating in Jerusalem, demending an immediate ceasefire and a hostage deal, chanting:  \"Bibi, Bibi, you can't hide the crimes committed in Rafah\"",
        "Weight": 17,
        "Id": 341
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1804209006249951454",
        "Date": "21/06/2024",
        "Text": "Today in Jerusalem: Israeli activists protested the genocide in Gaza. Chanting: \"1,2,3,4 stop this genocidal war! 5,6,7,8 Israel is an apartheid state!\"",
        "Weight": 21,
        "Id": 342
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1803713441053524259",
        "Date": "20/06/2024",
        "Text": "In the southern West Bank, the state-sponsored campaign to displace the Palestinian residents of Masafer Yatta continues daily",
        "Weight": 4,
        "Id": 343
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1803656953765278077",
        "Date": "20/06/2024",
        "Text": "Hospital staffs held protests following the recent increase in police violence at Israel's anti-government demonstrations, including two incidents involving medical doctors, where one was injured and another arrested while attempting to treat protestors.",
        "Weight": 4,
        "Id": 344
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1803295898425798873",
        "Date": "19/06/2024",
        "Text": "Israel's state broadcaster airs footage of an armed settler mob beating an Israeli photojournalist during pogroms in the West Bank in April. No arrests were made. If this is what they do to an Israeli Jew, imagine the treatment local Palestinians receive",
        "Weight": 30,
        "Id": 345
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1803290320878076397",
        "Date": "19/06/2024",
        "Text": "In the West Bank settler militias continue their daily raids on Palestinian villages. Continued non-intervention by the Israeli army reinforces the classification of this campaign as state-sponsored terrorism",
        "Weight": 12,
        "Id": 346
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1803075200709230717",
        "Date": "18/06/2024",
        "Text": "Thread: Brave Israeli historian makes the case that what Israel is currently doing to the Palestinian population in Gaza is consistent with the definition of genocide",
        "Weight": 25,
        "Id": 348
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802988846000279791",
        "Date": "18/06/2024",
        "Text": "Today, Israel's parliament is debating suspending the Palestinian students who particpated in this anti-war protest on campus.",
        "Weight": 8,
        "Id": 350
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802940571708797424",
        "Date": "18/06/2024",
        "Text": "A Conscientious Objector's Vision of Life for Israelis and Palestinians From the River to the Sea: Sofia Orr has just spent 85 days in military jail after refusing to enlist in the IDF.",
        "Weight": 19,
        "Id": 352
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802809014901678267",
        "Date": "17/06/2024",
        "Text": "In a demonstration in Jerusalem, we call for immediate ceasefire, the genocide in Gaza has to end now!",
        "Weight": 9,
        "Id": 354
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802808803777290319",
        "Date": "17/06/2024",
        "Text": "Anti-war block in the demonstration against the government in Jerusalem. The block called for immediate ceasefire and an end to the genocide in Gaza. Calling: \"We will continue shouting we won't despair,  ceasefire\" \n@FreeJerusalem1",
        "Weight": 9,
        "Id": 355
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802794128326979603",
        "Date": "17/06/2024",
        "Text": "Now, in Jerusalem: anti-war block in the demonstration against the Israeli government. The block called for immediate ceasefire and an end to the genocide in Gaza.",
        "Weight": 17,
        "Id": 356
    },
    {
        "URL": "https://x.com/gnuseibeh/status/1802102002031218722",
        "Date": "15/06/2024",
        "Text": "Jewish Israeli Jerusalemites. Thank you",
        "Weight": 12,
        "Id": 357
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802561699834216521",
        "Date": "17/06/2024",
        "Text": "Saturday, northern Jordan Valley, settlers attack Palestinian shepherd encampment with rocks, stick and electric shockers. Two injured.",
        "Weight": 4,
        "Id": 358
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802560074423951510",
        "Date": "17/06/2024",
        "Text": "Former Deputy Knesset Speaker quotes Hitler in context of Gaza: \"As Hitler said, 'I can't live if one Jew is left,' we can't live here if one Islamo-Nazi remains in Gaza\"",
        "Weight": 14,
        "Id": 359
    },
    {
        "URL": "https://x.com/againstwarvoice",
        "Date": "15/06/2024",
        "Text": "Now, in Jerusalem: demonstration for a hostage deal and immediate ceasefire. Protestors called for the end of the massacre in Gaza, chanting: \"Security is not achieved with the corpses of children\"",
        "Weight": 4,
        "Id": 360
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802275944310133003",
        "Date": "16/06/2024",
        "Text": "Baton wielding Israeli policemen harass Eid al-Adha worshippers in the Old City of Jerusalem",
        "Weight": 8,
        "Id": 361
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802262990135140460",
        "Date": "16/06/2024",
        "Text": "Do not look away. These are the children the Israeli genocidal regime murdered",
        "Weight": 8,
        "Id": 362
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802262694570893431",
        "Date": "16/06/2024",
        "Text": "In Jerusalem, Palestinians are being assaulted by policemen on their way to the Eid el'Adha prayer",
        "Weight": 8,
        "Id": 363
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802206598858702952",
        "Date": "16/06/2024",
        "Text": "Southern Jordan Valley: Settlers escorted by soldiers expel Palestinians from spring",
        "Weight": 8,
        "Id": 364
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802204361818247645",
        "Date": "16/06/2024",
        "Text": "Friday afternoon, northern Jordan Valley: Settlers beat Palestinian shepherd and break his car windows https://x.com/JVActivists/st/JVActivists/status/1802003836069986615…",
        "Weight": 4,
        "Id": 365
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802195333495107664",
        "Date": "16/06/2024",
        "Text": "\"Israel Is Hiding Its Draconian Detention of Palestinians From the Public: Do people in Israel know that prisoners in Sde Teiman are held without court monitoring and without Red Cross representatives or lawyers being able to meet them?\"",
        "Weight": 16,
        "Id": 366
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1802069866289267107",
        "Date": "15/06/2024",
        "Text": "Now, in Jerusalem: demonstration for a hostage deal and immediate ceasefire. Protestors called for the end of the massacre in Gaza, chanting: \"Security is not achieved with the corpses of children\"",
        "Weight": 4,
        "Id": 369
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1801291687811056102",
        "Date": "13/06/2024",
        "Text": "Today: Israeli students strike and demonstrate demending an immediate hostage deal.",
        "Weight": 8,
        "Id": 371
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1801279070899945901",
        "Date": "13/06/2024",
        "Text": "Undermining the sustainability of the Gaza Genocide: Read about the support we are providing for some of the most important direct resistance actions taking place on the ground in Israel today --> https://bit.ly/3xa8KNM \n@FreeJerusalem1\n \n@RadicalBlocTLV",
        "Weight": 13,
        "Id": 372
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1801150511342621154",
        "Date": "13/06/2024",
        "Text": "\"The images of convoys...carrying hundreds of wounded people and corpses to the completely overwhelmed hospital in Deir al-Balah were among the most difficult of the war. Israel chose to conceal them, to erase their memory, to deny their existence\"",
        "Weight": 4,
        "Id": 373
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1801143395919745104",
        "Date": "13/06/2024",
        "Text": "Old City of Jerusalem: Palestinian merchant shot by off duty Israeli soldier who did not like a map of Palestine in the store display",
        "Weight": 16,
        "Id": 374
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1800406838275686468",
        "Date": "11/06/2024",
        "Text": "With the world's attention on Gaza, Israeli violence against West Bank Palestinians has sharply escalated since October 7",
        "Weight": 20,
        "Id": 379
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1800069785734308178",
        "Date": "10/06/2024",
        "Text": "\"What did we think as the army was killing thousands of children? That the world would remain silent? That the UN would show restraint?...When it comes to mass killing of children, all excuses fly out the window, even ones made by Israel.\"",
        "Weight": 4,
        "Id": 381
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1800067745922351197",
        "Date": "10/06/2024",
        "Text": "Terrified of settlers, a Palestinian shepherding family fled its village in the South Hebron Hills after the war started. They relocated with their sheep but found no relief in their new haven. Last week, one young man was hospitalized after being attacked",
        "Weight": 4,
        "Id": 382
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1800053207193755820",
        "Date": "10/06/2024",
        "Text": "With all eyes on Gaza, settler militias conduct daily raids on West Bank Palestinians, torching homes, fields and cars",
        "Weight": 12,
        "Id": 383
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1800044024864149613",
        "Date": "10/06/2024",
        "Text": "After nationwide demonstrations against the Israeli government and for a hostage deal were held Saturday night, dozens of protestors were arrested in a violent fashion, including a doctor administering medical treatment to an injured protestor.",
        "Weight": 8,
        "Id": 384
    },
    {
        "URL": "https://x.com/againstwarvoice",
        "Date": "07/06/2024",
        "Text": "Today, activists chained themselves to the entrance of the German embassy in Tel Aviv, demending Germany stops arming Israel's genocide in Gaza. Germany is the second largest arms supplier to Israel. Please share their message\n\n@FreeJerusalem1\n  \n@RadicalBlocTLV\n @Israelisforpeace_de",
        "Weight": 29,
        "Id": 386
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1799662470837281273",
        "Date": "09/06/2024",
        "Text": "Tel Aviv: Police arrest two anti-war protesters for hanging sign \"Thou shall not kill\"",
        "Weight": 1,
        "Id": 390
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1799111463107170699",
        "Date": "07/06/2024",
        "Text": "Today, activists chained themselves to the entrance of the German embassy in Tel Aviv, demending Germany stops arming Israel's genocide in Gaza. Germany is the second largest arms supplier to Israel. Please share their message\n\n@FreeJerusalem1\n  \n@RadicalBlocTLV\n @Israelisforpeace_de",
        "Weight": 29,
        "Id": 392
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1799003205709476303",
        "Date": "07/06/2024",
        "Text": "Now in Tel Aviv: activists blocked the entrance to the German embassy demending Germany stops arming genocide",
        "Weight": 6,
        "Id": 393
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1798745864745492916",
        "Date": "06/06/2024",
        "Text": "No pride in Genocide!\nAnti-occupation, anti-pinkwashing block in Tel-Aviv's pride march",
        "Weight": 10,
        "Id": 395
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1798744087153332280",
        "Date": "06/06/2024",
        "Text": "Anti-pinkwash block in the Tel Aviv pride parade: Pink-washing is Israel's use of LGBTQ rights to distract from its actions toward Palestinians. The activists in this block express their dissent, highlighting the exploitation of their identities to rationalize genocide",
        "Weight": 18,
        "Id": 396
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1798375838653755636",
        "Date": "05/06/2024",
        "Text": "\"We were beaten by settlers, detained by the police, & recieved endless curses & threats - but we won't back down. Our presence here, Jews & Palestinians of the Humanitarian Guard is important...because it examplifies the societal struggle we face: hate & death vs. life & hope\"",
        "Weight": 12,
        "Id": 397
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1798371670492893540",
        "Date": "05/06/2024",
        "Text": "Time and time again on this account we've published videos of peaceful anti-war protesters being violently dispersed and arrested by the Israeli police. But when a racist lynch mob rampages through the Old City attacking Palestinians, no arrests are made.",
        "Weight": 16,
        "Id": 398
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1798369548636410191",
        "Date": "05/06/2024",
        "Text": "Editorial: \"This is just what we need right now – a festival of ugly Jewish thuggery in which, year after year, hundreds of riled up young Jews, seek to create provocations by belting out racist songs and slogans in the heart of the Old City\"",
        "Weight": 8,
        "Id": 399
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1798348435051184249",
        "Date": "05/06/2024",
        "Text": "This is what it looks like now in the old city of Jerusalem, the facist youth \"celebrating\" the occupation of Jerusalem",
        "Weight": 5,
        "Id": 402
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1798346552467165328",
        "Date": "05/06/2024",
        "Text": "There is no sanctity in an occupied city.\n\nThe facist, nationalist ultra-right wing youth \"celebrating\" the occupation of Jerusalem are showing the truth of this sentence while they terrorize Palestinians in the old city",
        "Weight": 13,
        "Id": 403
    },
    {
        "URL": "https://x.com/againstwarvoice",
        "Date": "03/06/2024",
        "Text": "Now, at Bezalel University, students started an encampment protesting the war on Gaza, calling for ceasefire",
        "Weight": 4,
        "Id": 405
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1797976923144176017",
        "Date": "04/06/2024",
        "Text": "New countrywide campaign calls on the Israeli government to \"Accept the deal. End the war.\" in Hebrew and Arabic.",
        "Weight": 8,
        "Id": 406
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1797972817230876987",
        "Date": "04/06/2024",
        "Text": "In 40 degree heat, settlers cut pipes carrying water to the Palestinian residents of Ras el-Ain in the Jordan Valley",
        "Weight": 4,
        "Id": 407
    },
    {
        "URL": "https://x.com/NationalSJP/status/1797663089334350281",
        "Date": "03/06/2024",
        "Text": " ‘48 Palestine \n\nstudents at the Bezalel Academy of Arts and Design in Jerusalem have established a solidarity encampment to protest the war in Gaza \n\nfrom \n@againstwarvoice",
        "Weight": 8,
        "Id": 409
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1797524018897277159",
        "Date": "03/06/2024",
        "Text": "Now, at Bezalel University, students started an encampment protesting the war on Gaza, calling for ceasefire",
        "Weight": 4,
        "Id": 410
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1797141570291990872",
        "Date": "02/06/2024",
        "Text": "Armed settlers invade Palestinian lands in Masafer Yatta in southern West Bank. Two local Palestinian injured.",
        "Weight": 8,
        "Id": 413
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1797139278511706365",
        "Date": "02/06/2024",
        "Text": "Life for Palestinians in Hebron hasn't been the same since Oct 7. After 2 months of almost total lockdown, they're now confined to their homes from 7 PM to 7 AM. False arrests, violence & humiliation at the hands of soldiers & settlers are their daily lot.",
        "Weight": 8,
        "Id": 414
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1796279758986076251",
        "Date": "30/05/2024",
        "Text": "Today: Anti-occupation activists held an anti-pinkwashing block at the pride parade in Jerusalem, declaring \"There is no pride in occupation\" and calling to end the massacre in Gaza",
        "Weight": 14,
        "Id": 416
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1796244495635488921",
        "Date": "30/05/2024",
        "Text": "Today: Anti-occupation, anti-pinkwash block in the pride parade in Jerusalem. Protestors held signs reading \"There are lgbtq people in Gaza\", \"there is no pride in war\", \"starvation is a crime\" and more",
        "Weight": 9,
        "Id": 417
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1796081005817626707",
        "Date": "30/05/2024",
        "Text": "\"A policeman confiscates the Palestinian flag and tears it during the demonstration in Nazareth in protest of the continuation of the war in Gaza organized by the Hadash movement\"",
        "Weight": 8,
        "Id": 420
    },
    {
        "URL": "https://x.com/againstwarvoice",
        "Date": "28/05/2024",
        "Text": "Now, in the Hebrew University in Jerusalem: Palestinian and Jewish students protest the genocide in Gaza following the massacre in Rafah. Far right students are holding anti-protests holding flags and singing the zionist anthem",
        "Weight": 24,
        "Id": 421
    },
    {
        "URL": "https://x.com/NTarnopolsky/status/1795830724601503809",
        "Date": "29/05/2024",
        "Text": "\"Their blood is on the hands of the government!\" Mothers of IDF combat soldiers are protesting in front of IDF HQ in Tel Aviv calling for an end to the war.\n(Danor Aharon)",
        "Weight": 1,
        "Id": 422
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1796072257233580201",
        "Date": "30/05/2024",
        "Text": "Police arrest, zip tie and blindfold a Palestinian citizen of Israel after she published a post expressing pain at the death of children in Rafah",
        "Weight": 10,
        "Id": 423
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1796071347371520132",
        "Date": "30/05/2024",
        "Text": "An armed and uniformed settler drives Palestinians off their land near Susiya in the southern West Bank.",
        "Weight": 8,
        "Id": 424
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795761842167427441",
        "Date": "29/05/2024",
        "Text": "\"Record number of refusers in Gaza War: Left-wing activists assisting refusers report constant rise in numbers since the war broke out\"\nSource: https://zman.co.il/490835/",
        "Weight": 4,
        "Id": 425
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795748925120688367",
        "Date": "29/05/2024",
        "Text": "New law being pushed by Israel Students Union: A lecturer who speaks out \"against Israel\" will be summarily fired without severance pay. Government funding will be cut to universities that don't comply.",
        "Weight": 8,
        "Id": 426
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795445684994281538",
        "Date": "28/05/2024",
        "Text": "\"I know that it's not enough, but it's really important: The Humanitarian Guard has ensured that all aid trucks to Gaza over the last ten days got through. Settlers weren't able to stop even one truck.\"",
        "Weight": 4,
        "Id": 428
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795439692563034390",
        "Date": "28/05/2024",
        "Text": "With all eyes on Rafah, state-sponsored settler militias continue their daily campaign of displacement in the West Bank",
        "Weight": 2,
        "Id": 429
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795406210516062236",
        "Date": "28/05/2024",
        "Text": "Now, in the Hebrew University in Jerusalem: Palestinian and Jewish students protest the genocide in Gaza following the massacre in Rafah. Far right students are holding anti-protests holding flags and singing the zionist anthem",
        "Weight": 24,
        "Id": 430
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795406210474397840",
        "Date": "28/05/2024",
        "Text": "Now, in the Hebrew University in Jerusalem: Palestinian and Jewish students protest the genocide in Gaza following the massacre in Rafah. Far right students are holding anti-protests holding flags and singing the zionist anthem",
        "Weight": 24,
        "Id": 431
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795392260873568691",
        "Date": "28/05/2024",
        "Text": "Now, in the Hebrew University in Jerusalem: Palestinian and Jewish students protest the genocide in Gaza following the massacre in Rafah. Far right students are holding anti-protests holding flags and singing the zionist anthem",
        "Weight": 24,
        "Id": 432
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795361225536393697",
        "Date": "28/05/2024",
        "Text": "Listen to Yonatan Zeigen, a powerful Israeli voice against war, whose mother was murdered on October 7",
        "Weight": 8,
        "Id": 433
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795360164297753086",
        "Date": "28/05/2024",
        "Text": "Yesterday, settler militias torched Palestinian fields across the West Bank",
        "Weight": 4,
        "Id": 434
    },
    {
        "URL": "https://x.com/sherryamin13/status/1795320968157729048",
        "Date": "28/05/2024",
        "Text": "Jerusalem: Stop the genocide!",
        "Weight": 5,
        "Id": 435
    },
    {
        "URL": "https://x.com/KelrosAnd/status/1795326825780146284",
        "Date": "28/05/2024",
        "Text": "Politicans, media and Zionist lobby groups would have you believe that they speak for us. They do not! There are many of us, including Israeli's who will not tolerate the gross and barbaric ethnic cleansing going on daily in Gaza. Israeli's protesting are also subject to violence",
        "Weight": 25,
        "Id": 436
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795323818388722075",
        "Date": "28/05/2024",
        "Text": "Police violence and at least 8 arrested in a demonstration in Haifa against the massacre in Rafah",
        "Weight": 2,
        "Id": 437
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795186285503471951",
        "Date": "27/05/2024",
        "Text": "This evening in Tel Aviv and Jerusalem demonstration were held in protest of the inhumane attack in Rafah. Protestors called to end the genocide in Gaza immediately",
        "Weight": 12,
        "Id": 438
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795155353560129582",
        "Date": "27/05/2024",
        "Text": "Now in Tel Aviv: protest against the genocide in Gaza",
        "Weight": 10,
        "Id": 439
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795154994326352383",
        "Date": "27/05/2024",
        "Text": "Now, in Jerusalem: demonstration against the massacre in Gaza",
        "Weight": 4,
        "Id": 440
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1795108518682341497",
        "Date": "27/05/2024",
        "Text": "On April 30th there was an event bringing together representatives from the main refusal groups in Israel-Palestine. Listen to their important thoughts on the meaning of conscientious objection in a militaristic society and join us in supporting refusers: https://support.refuser.org",
        "Weight": 8,
        "Id": 441
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1794977214036861271",
        "Date": "27/05/2024",
        "Text": "\"The violence and vandalism, committed with near-total impunity, raises questions about the willingness of Israel’s security forces to restrain extremist settlers and protect Palestinians.\"",
        "Weight": 12,
        "Id": 446
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1794617672405242363",
        "Date": "26/05/2024",
        "Text": "Over 1,400 academic staff and administrators from institutions of higher education in Israel have signed a petition urging the Israeli government to promptly end the war in Gaza and to secure the immediate release of the hostages.",
        "Weight": 16,
        "Id": 448
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1794602157716730271",
        "Date": "26/05/2024",
        "Text": "\"Distance requirements from an Israeli settlement in the West Bank and a network of barriers have prevented Palestinian farmers from tilling their plots to the west of Bethlehem for over seven months\"",
        "Weight": 12,
        "Id": 449
    },
    {
        "URL": "https://x.com/againstwarvoice",
        "Date": "24/05/2024",
        "Text": "This morning (Friday), war resistance acivists chained themselves to gate of the US Consulate in Jerusalem, demanding an end to US arms shipments to Israel. Police violently arrested the protesters.\nJoin our call to Biden to halt the destruction of Gaza >> https://gaza.refuser.org",
        "Weight": 12,
        "Id": 450
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1794430793764229519",
        "Date": "25/05/2024",
        "Text": "Protesters in Jerusalem chained themselves to the entrance of the United States consulate in Jerusalem demanding that the USA stop sending weapons to Israel. They chanted \"Stop arming genocide\". Seven activities were arrested.",
        "Weight": 9,
        "Id": 451
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1794422532822417800",
        "Date": "25/05/2024",
        "Text": "Protesters in Jerusalem chained themselves to the entrance of the United States consulate in Jerusalem demanding that the US stop sending weapons to Israel. They chanted \"Stop arming genocide\". Seven activities were arrested. A cop slaped one activists and called here a wh0re",
        "Weight": 9,
        "Id": 453
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1794020792415461504",
        "Date": "24/05/2024",
        "Text": "This morning (Friday), war resistance acivists chained themselves to gate of the US Consulate in Jerusalem, demanding an end to US arms shipments to Israel. Police violently arrested the protesters.\nJoin our call to Biden to halt the destruction of Gaza >> https://gaza.refuser.org",
        "Weight": 12,
        "Id": 454
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1793529764399239366",
        "Date": "23/05/2024",
        "Text": "Recent satellite images reveal extensive damage to the Rafah governorate in southern Gaza caused by the army ground incursion into the area.",
        "Weight": 6,
        "Id": 455
    },
    {
        "URL": "https://x.com/btselem/status/1793384580046565608",
        "Date": "22/05/2024",
        "Text": "Video footage demonstrates how Israeli settlers on “farms” take over Palestinian pastureland as part of state policy to drive out pastoral communities\nRead more:\nhttps://btselem.org/video/20240522_video_footage_demonstrates_how_israeli_settlers_on_farms_take_over_palestinian_pastureland#full…",
        "Weight": 24,
        "Id": 457
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1793518832172359834",
        "Date": "23/05/2024",
        "Text": "Editorial: \"Right-wing activists obstructing trucks carrying aid to Gaza are operating like militias for all intents and purposes. The permissive attitude with which their activities are being received is evidence of the deep and spreading rot in Israel\"",
        "Weight": 8,
        "Id": 458
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1793170452359020704",
        "Date": "22/05/2024",
        "Text": "\"From satellite imagery and eyewitness testimonies, it appears that the army is destroying homes, bulldozing land, and erecting structures that will enable it to operate within Gaza for years to come.\"",
        "Weight": 4,
        "Id": 462
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1793168265256026501",
        "Date": "22/05/2024",
        "Text": "\"The office ICC Chief Prosecutor Khan said Tuesday he had recommended issuing arrest warrants for PM  Netanyahu and DM Gallant because he had not seen compelling evidence that Israeli courts were probing alleged violations of international law in Gaza.\"",
        "Weight": 12,
        "Id": 463
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1793166895170175338",
        "Date": "22/05/2024",
        "Text": "\"Medical workers in Israel have told the BBC that Palestinian detainees from Gaza are routinely kept shackled to hospital beds, blindfolded, sometimes naked, and forced to wear nappies – a practice one medic said amounted to 'torture'.\"",
        "Weight": 12,
        "Id": 464
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1793165856031002668",
        "Date": "22/05/2024",
        "Text": "\"Members of Israel’s security forces are tipping off far-right activists and settlers to the location of aid trucks delivering vital supplies to Gaza, enabling the groups to block and vandalise the convoys, according to multiple sources.\"",
        "Weight": 8,
        "Id": 465
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1793164439652315581",
        "Date": "22/05/2024",
        "Text": "\"Be'er Sheva's deputy mayor served as a reservist in the West Bank during the Gaza war and uploaded social media posts of blindfolded Palestinians with derisive captions\"",
        "Weight": 12,
        "Id": 466
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1792839372175450573",
        "Date": "21/05/2024",
        "Text": "\"On our way to Tarkumiya crossing. We'll block the blockers, and help all aid trucks reach Gaza! Because we are the life camp\"",
        "Weight": 4,
        "Id": 467
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1792819376347078711",
        "Date": "21/05/2024",
        "Text": "\"France has been warning for many months of the need for strict compliance with international humanitarian law, and in particular of the unacceptable level of civilian casualties in the Gaza Strip and inadequate humanitarian access.\"",
        "Weight": 4,
        "Id": 468
    },
    {
        "URL": "https://x.com/IntlCrimCourt/status/1792508585185796197",
        "Date": "20/05/2024",
        "Text": "Statement of #ICC Prosecutor \n@KarimKhanQC\n:  Applications for arrest warrants in the situation in the State of #Palestine ",
        "Weight": 4,
        "Id": 472
    },
    {
        "URL": "https://x.com/againstwarvoice",
        "Date": "19/05/2024",
        "Text": "Now: settlers trying to block humanitarian aid trucks headed to Gaza. After we repeatedly called police they finally arrived to disperse them",
        "Weight": 4,
        "Id": 474
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1792457505613992319",
        "Date": "20/05/2024",
        "Text": "At a demonstration held last Haifa, two protesters were arrested for waving a Palestinian flag. Please spread this video, it is important people know it is not even allowed to wave a flag representing Palestinian freedom in Israel!",
        "Weight": 12,
        "Id": 475
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1792460215981576291",
        "Date": "20/05/2024",
        "Text": "Last Friday in Jerusalem, a man was arrested for wearing a shirt with a Palestinian flag. This is extreme! Think about it, people here are afraid to have Palestinian symbols because it means they would be arrested!",
        "Weight": 8,
        "Id": 476
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1792445169649815888",
        "Date": "20/05/2024",
        "Text": "Now: far right facists trying to block aid trucks going to Gaza",
        "Weight": 4,
        "Id": 479
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1792442194491564094",
        "Date": "20/05/2024",
        "Text": "Yesterday, after attacking food trucks headed for Gaza, settlers raided the West Bank village of Yatma and torched cars.",
        "Weight": 4,
        "Id": 480
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1792434166488858964",
        "Date": "20/05/2024",
        "Text": "Joining far-right peers Marine Le Pen, Georgia Meloni, Viktor Orban, Javier Milei and Vox's Santiago Abascal, Israel's Diaspora Minister Chikli declares the Gaza war 'is an existential battle for the future of Western civilization against radical Islam'",
        "Weight": 8,
        "Id": 481
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1792299684486160409",
        "Date": "19/05/2024",
        "Text": "Now: settlers trying to block humanitarian aid trucks headed to Gaza. After we repeatedly called police they finally arrived to disperse them",
        "Weight": 4,
        "Id": 482
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1792057097837756696",
        "Date": "19/05/2024",
        "Text": "On Friday night, a Palestinian truck was forced to stop near the settlement of Kochav Hashahar, and torched, leaving the driver moderately wounded, and three IDF soldiers who came to assist him lightly injured. No arrests were made",
        "Weight": 4,
        "Id": 486
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1792055601947717834",
        "Date": "19/05/2024",
        "Text": "\"A grassroots movement focused on an Arab-Jewish partnership plans to mobilize Israelis in an attempt to quell the recent spate of attacks on trucks carrying humanitarian aid into Gaza perpetrated by right-wing settlers.\"",
        "Weight": 19,
        "Id": 487
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1791910367590846645",
        "Date": "18/05/2024",
        "Text": "Now, in Jerusalem: demonstration against the war on Gaza, protestors held a sign reading \"starvation is a war crime\"",
        "Weight": 9,
        "Id": 488
    },
    {
        "URL": "https://x.com/IsrLawProfDemo/status/1791433015496786221",
        "Date": "17/05/2024",
        "Text": "1/The Forum expresses grave concern over reports of abuse of Palestinians in military and civilian detention facilities & the alarming number of detainees who have died under unclear circumstances. According to news & NGO reports, since October 2023, Palestinian detainees in...",
        "Weight": 12,
        "Id": 491
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1791760154104324129",
        "Date": "18/05/2024",
        "Text": "\"Foreign Minister Jose Manuel Albares confirmed reports that the Marianne Danica, which was carrying a cargo of arms to Israel, and had requested permission to call at the port at Cartagena on May 21; the request was denied\"",
        "Weight": 4,
        "Id": 492
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1791066911041532307",
        "Date": "16/05/2024",
        "Text": "NYT on settler impunity: \"Many of the people we interviewed offered an account not only of Jewish violence against Palestinians dating back decades but also of an Israeli state that has systematically and increasingly ignored that violence.\"",
        "Weight": 20,
        "Id": 494
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1791047545289949368",
        "Date": "16/05/2024",
        "Text": "Far-right activists stopped multiple trucks in the West Bank, unloaded cargo, deflated their tires and set them on fire. The Israel Police arrived at the scene but arrested no suspects",
        "Weight": 4,
        "Id": 495
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1791046975179071857",
        "Date": "16/05/2024",
        "Text": "The wife of Dr. Adnan Al-Bursh, a senior physician from the Gaza Strip who died last month while detained at Israel's Ofer Prison, submitted on Wednesday a request a demand to appoint a judge to head an investigation of her husband's death.",
        "Weight": 8,
        "Id": 496
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790978612557922332",
        "Date": "16/05/2024",
        "Text": "As police look on, settlers celebrate destruction of truckload of Palestinian food in the West Bank. https://x.com/ElishaYered/st/ElishaYered/status/1790815866738671858…",
        "Weight": 4,
        "Id": 498
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790973212844577173",
        "Date": "16/05/2024",
        "Text": "Gaza \"Humanitarian Zone\": \"New arrivals are met with sprawling, cramped encampments with no running water, a handful of inadequate field hospitals and the accelerating spread of disease, all under a baking Mediterranean sun\"",
        "Weight": 4,
        "Id": 499
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790969273575195117",
        "Date": "16/05/2024",
        "Text": "Palestinian truck driver attacked by settlers in West Bank. Later the food he was transporting (which was not intended for Gaza) was vandalized.",
        "Weight": 8,
        "Id": 500
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790759615119982964",
        "Date": "15/05/2024",
        "Text": "Today at Tel Aviv University, students held a ceremony to recognize the ongoing Nakba. They expressed their protest against the genocide in Gaza and the occupation. In response to the police prohibiting the display of Palestinian flags, students displayed images of watermelons",
        "Weight": 19,
        "Id": 502
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790687137479671913",
        "Date": "15/05/2024",
        "Text": "Thousands participated in a demonstration commemorating 75 years of Nakba on the lands of the two displaced villages of Hosha and Elksayer in the north of Israel-Palestine",
        "Weight": 8,
        "Id": 504
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790682757758177360",
        "Date": "15/05/2024",
        "Text": "Now at Tel Aviv University: Students are holding a ceremony protesting the ongoing Nakba and the destruction in Gaza",
        "Weight": 5,
        "Id": 506
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790679383981621331",
        "Date": "15/05/2024",
        "Text": "\"Now at Tel Aviv University: We will continue to fight until we succeed in stopping the war of extermination in Gaza and heal the wounds of the ongoing Nakba. And it will happen - for the benefit of both nations.\"",
        "Weight": 5,
        "Id": 508
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790629865965629736",
        "Date": "15/05/2024",
        "Text": "Listen to Sapir Sluzker-Amran, a powerful Israeli voice against war",
        "Weight": 8,
        "Id": 509
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790624319720038804",
        "Date": "15/05/2024",
        "Text": "\"Around 15 trucks had been damaged by Israeli settlers, who beat some drivers and caused about $2 million worth of damage, without intervention by the Israeli army or police\"",
        "Weight": 16,
        "Id": 510
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790622893488959659",
        "Date": "15/05/2024",
        "Text": "\"Thousands of Israelis joined a far-right march led by Jewish activists advocating for resettling Gaza and forcing Palestinians to leave the enclave...The march was supported by lawmakers speaking at the event, including two cabinet members.\"",
        "Weight": 27,
        "Id": 511
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1790458774014345460",
        "Date": "14/05/2024",
        "Text": "Activists in Israel-Palestine graffitied: \"refuse to serve in Rafah - enlist for peace\"",
        "Weight": 10,
        "Id": 512
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1789607720749801546",
        "Date": "12/05/2024",
        "Text": "\"On Friday at the entrance to the Old City of Jerusalem women sat silently in a circle with signs of solidarity and protest on the humanitarian situation in Gaza and for an end to the war, return of the hostages and a diplomatic agreement.\"",
        "Weight": 4,
        "Id": 521
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1789605785397297380",
        "Date": "12/05/2024",
        "Text": "\"Dr. Adnan Al-Bursh was arrested at a hospital in the Gaza Strip last December, with his death at an Israeli prison quietly announced four months later. Palestinian detainees who saw him say it was clear he had gone through hell.\"",
        "Weight": 16,
        "Id": 522
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1789545667171332476",
        "Date": "12/05/2024",
        "Text": "\"When everyone who was able to flee from Gaza was doing so, Dr. David Hasan made the reverse journey. His story is a must-read for every Israeli.\"",
        "Weight": 12,
        "Id": 524
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1789543413466997212",
        "Date": "12/05/2024",
        "Text": "\"The Israeli government wants us to be voiceless. It continues to forbid foreign journalists from entering and reporting inside the Strip. And it has attempted to silence Palestinian journalists directly.\"",
        "Weight": 12,
        "Id": 525
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1789540435746009173",
        "Date": "12/05/2024",
        "Text": "Rafah: \"Some 1.2 million Gazans are huddled in a city that has already seen devastating bombings and shellings. They are sure Biden's warnings will not stop a massive ground attack like there was in Gaza City and Khan Yunis\"",
        "Weight": 10,
        "Id": 527
    },
    {
        "URL": "https://x.com/MauricioLapchik/status/1789346234899001361",
        "Date": "11/05/2024",
        "Text": "  TLV right now: The anti-war/occupation bloc is demanding what needs to be demanded: 'Stop the war!'\n\nWe demand the release of the hostages and an end to this destructive war, seeking a political solution.\n\nNow, more than ever - This war must stop!",
        "Weight": 5,
        "Id": 528
    },
    {
        "URL": "https://x.com/againstwarvoice",
        "Date": "09/05/2024",
        "Text": "Now in Tel Aviv:\nProtest against the invasion of Rafah. Demonstrators are calling for immediate ceasefire",
        "Weight": 3,
        "Id": 532
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788955551277240606",
        "Date": "10/05/2024",
        "Text": "Today (10.5) in Jerusalem: demonstration against the massacre in Gaza and the occupation. Calling to end the invasion of Rafah.",
        "Weight": 11,
        "Id": 534
    },
    {
        "URL": "https://x.com/againstwarvoice",
        "Date": "09/05/2024",
        "Text": "An Israeli right-wing channel is persecuting those who support refusers. Listen to Mattan, from Refuser Solidarity Network, share his experience.And support through the link: https://bit.ly/3UBYkzH",
        "Weight": 8,
        "Id": 538
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788658685037645972",
        "Date": "09/05/2024",
        "Text": "Join us in the call to Biden to stop sending weapons to Israel: https://gaza.refuser.org",
        "Weight": 8,
        "Id": 540
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788658241972404735",
        "Date": "09/05/2024",
        "Text": "All eyes on Rafah \nTonight in Tel Aviv",
        "Weight": 3,
        "Id": 541
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788634802561728860",
        "Date": "09/05/2024",
        "Text": "Now in Tel Aviv:\nProtest against the invasion of Rafah. Demonstrators are calling for immediate ceasefire",
        "Weight": 3,
        "Id": 542
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788628688294007098",
        "Date": "09/05/2024",
        "Text": "Now: protest against the invasion of Rafah in Tel Aviv",
        "Weight": 3,
        "Id": 543
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788628766681452722",
        "Date": "09/05/2024",
        "Text": "The street is full with protestors who are against Israel's genocidal policy in Gaza",
        "Weight": 8,
        "Id": 545
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788586465208811819",
        "Date": "09/05/2024",
        "Text": "An Israeli right-wing channel is persecuting those who support refusers. Listen to Mattan, from Refuser Solidarity Network, share his experience.And support through the link: https://bit.ly/3UBYkzH",
        "Weight": 8,
        "Id": 546
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788580631619739941",
        "Date": "09/05/2024",
        "Text": "Israeli Peace activist doxxed by right-wing Telegram groups after criticizing government plans for Indpendence Day ceremony.",
        "Weight": 8,
        "Id": 547
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788517935872377093",
        "Date": "09/05/2024",
        "Text": "The head of the United Nations World Food Program says northern Gaza has entered “full-blown famine” after nearly seven months of war",
        "Weight": 4,
        "Id": 549
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788515747645321261",
        "Date": "09/05/2024",
        "Text": "The U.N. World Health Organization says it has only three days of fuel for its medical operations in southern Gaza, and shortages have already forced one of three hospitals in the city of Rafah to shut down\nhttps://usnews.com/news/world/articles/2024-05-09/the-latest-rafahs-hospitals-will-run-out-of-fuel-in-3-days-who-says#:~:text=May%209%2C%202024%2C%20at%203%3A50%20a.m.&text=The%20World%20Health%20Organization%20says,of%20Rafah%20to%20shut%20down….",
        "Weight": 10,
        "Id": 550
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788513964571185418",
        "Date": "09/05/2024",
        "Text": "\"[in Rafah] The Israeli army has launched the latest exodus of Gaza residents, who are forced to choose between the ruins of Khan Yunis and a coastal strip without water and sewage infrastructure\"",
        "Weight": 14,
        "Id": 551
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788482032118518240",
        "Date": "09/05/2024",
        "Text": "We support stopping the transfer of weapons to Israel!\n\nJoin our call:https://gaza.refuser.org/?fbclid=PAZXh0bgNhZW0CMTEAAaalDcg6W8LpZngJ4Mhj1Lms-gw5yezVzNAAdPoWxwMcK35gmhAAT2sdUOc_aem_AQhLrdLNY4DX7DWYl1TvU7afsYkeQmukBMQ_-esknn9vmjJL8j500gIxVem66YZY8SDdNmE46WGI-CFQlTMNLxjV…",
        "Weight": 8,
        "Id": 552
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788460161050214896",
        "Date": "09/05/2024",
        "Text": "\"Biden said that heavy bombs, the kind of which his government is already delaying a large shipment, caused the widespread killing of civilians in the Gaza Strip\"",
        "Weight": 4,
        "Id": 553
    },
    {
        "URL": "https://x.com/mhdksafa/status/1788189534783520788",
        "Date": "08/05/2024",
        "Text": "Rafah is being decimated, there is nowhere else left to go. Israeli tanks are now firing on 1.7 million civilians trapped in tents in Rafah. A massacre is happening in Rafah right now and the world is silent.",
        "Weight": 14,
        "Id": 555
    },
    {
        "URL": "https://x.com/OrenZiv_/status/1788053932335390859",
        "Date": "08/05/2024",
        "Text": "Now in the unrecognized Bedouin of Wadi Halil in the Negev: large force of Israeli police arrived to demolish dozens of houses",
        "Weight": 8,
        "Id": 557
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788158034583200019",
        "Date": "08/05/2024",
        "Text": "\"At any given moment, hundreds of thousands of Palestinian villagers are completely exposed to unbridled aggression, often perpetrated by Jews in religious garb, armed with rifles or handguns, clubs or rocks or whatever is needed for arson.\"",
        "Weight": 8,
        "Id": 558
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1788147909466173950",
        "Date": "08/05/2024",
        "Text": "\"October 7 brought settler violence to a head in the West Bank: 18 Palestinian herding communities have since been uprooted from their homes, with the residents now living in makeshift dwellings on the outskirts of other villages.\"",
        "Weight": 4,
        "Id": 559
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1787930496174805038",
        "Date": "07/05/2024",
        "Text": "Now in Tel Aviv: Demonstration against the invasion of Rafah and the continued massacre in Gaza",
        "Weight": 7,
        "Id": 560
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1787907822220640609",
        "Date": "07/05/2024",
        "Text": "Now in Tel Aviv: Demonstration against the genocide in Gaza and the invasion of Rafah",
        "Weight": 12,
        "Id": 561
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1787885613351338385",
        "Date": "07/05/2024",
        "Text": "Now in Tel Aviv: Demonstartion against the invasion of Rafah, protestors are calling: \"We want peace and welfare, not a war of revenge\"",
        "Weight": 3,
        "Id": 562
    },
    {
        "URL": "https://x.com/againstwarvoice",
        "Date": "06/05/2024",
        "Text": "Now: in the protest against the invasion of Rafah in Jerusalem, protestors are chanting \"stop this genocidal war\"",
        "Weight": 2,
        "Id": 563
    },
    {
        "URL": "https://x.com/Etanetan23/status/1787607184123330743",
        "Date": "06/05/2024",
        "Text": "After it was announced that Hamas accepted the ceasefire and the government is stalling hundreds went to block Ayalon highway in Tel Aviv. \n\nPolice brutes are violently cracking down.",
        "Weight": 5,
        "Id": 566
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1787582150620893643",
        "Date": "06/05/2024",
        "Text": "Now: in the protest against the invasion of Rafah in Jerusalem, protestors are chanting \"stop this genocidal war\"",
        "Weight": 2,
        "Id": 567
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1787569261952528566",
        "Date": "06/05/2024",
        "Text": "Demonstration against the invasion to Rafah in Jerusalem, calling for immediate and permanent ceasefire",
        "Weight": 2,
        "Id": 568
    },
    {
        "URL": "https://x.com/Etanetan23/status/1787471233740628293",
        "Date": "06/05/2024",
        "Text": "Activists respond to the military dropping leaflets in Rafah by dropping their own in central Tel Aviv: “Gov’t chose Rafah over abductees. Israeli govt guilty of death, not rescue.”",
        "Weight": 13,
        "Id": 572
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1787139735514718403",
        "Date": "05/05/2024",
        "Text": "The extreme right wing Arutz 14 TV seems to see our support of Israeli refusers as a threat. This time it's a report on the newsletter we sent in the morning (!). Read (the newsletter) here --> https://bit.ly/4boyx3b",
        "Weight": 8,
        "Id": 575
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1787135274020999662",
        "Date": "05/05/2024",
        "Text": "Ishay Menuchin of \n@YeshGvul1982\n on the highschoolers who refused to enlist during the Gaza war: “They're heroes in my eyes. They're not only not taking part. They're trying to set an example for others. They're trying to tell others that there is another way.\"",
        "Weight": 4,
        "Id": 576
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1787006852833710519",
        "Date": "05/05/2024",
        "Text": "\"Killing and destruction, starvation and displacement on this scale could not have occurred without the commission of war crimes. Individuals are responsible for them, and they must be brought to justice.\"",
        "Weight": 12,
        "Id": 577
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1787001362544287889",
        "Date": "05/05/2024",
        "Text": "\"Palestinians reported that two detainees from Gaza, including a prominent Palestinian doctor from Al Shifa Hospital, died under Israeli custody...The doctor was identified as Dr. Adnan Ahmad Al-Bursh...a figure frequently featured in international media.\"",
        "Weight": 24,
        "Id": 579
    },
    {
        "URL": "https://x.com/SenSanders/status/1786796638188560813",
        "Date": "04/05/2024",
        "Text": "It’s not complicated. The director of the World Food Program, Cindy McCain, says that parts of Gaza are experiencing a “full-blown famine” that is rapidly spreading. That is why students are protesting. That is why I voted against giving Netanyahu’s war machine any more U.S. aid.",
        "Weight": 4,
        "Id": 581
    },
    {
        "URL": "https://x.com/MauricioLapchik/status/1786808712138469772",
        "Date": "04/05/2024",
        "Text": "TLV NOW: The anti-war/occupation bloc is chanting, \"A political agreement is the only solution.\"\n\nBecause war is not the solution. And it never was. And it never will be.\n\n",
        "Weight": 5,
        "Id": 582
    },
    {
        "URL": "https://x.com/Etanetan23/status/1786811592283193633",
        "Date": "04/05/2024",
        "Text": "Tel Aviv protest tonight:\n\n-End the war\n- Hostage release \n-No to Rafah invasion. \n- The government must fall.",
        "Weight": 3,
        "Id": 583
    },
    {
        "URL": "https://x.com/OrenZiv_/status/1786820488125137138",
        "Date": "04/05/2024",
        "Text": "Now in Tel Aviv: Tens of thousands protest for a hostage deal and against invasion to Rafah",
        "Weight": 3,
        "Id": 584
    },
    {
        "URL": "https://x.com/David_Cameron/status/1786400899323052420",
        "Date": "03/05/2024",
        "Text": "Extremist settlers are undermining security and stability and threatening prospects for peace. \n\nToday we are announcing further sanctions on those responsible for the unprecedented rise in settler violence.  \n\nThe Israeli authorities must clamp down on this issue.",
        "Weight": 8,
        "Id": 585
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1786498259835355602",
        "Date": "03/05/2024",
        "Text": "\"In Gaza and Sderot, children want to live\" Today in Jerusalem, in the weekly demonstration against the massacre in Gaza",
        "Weight": 8,
        "Id": 587
    },
    {
        "URL": "https://x.com/TamarGlezerman/status/1786115946102280583",
        "Date": "02/05/2024",
        "Text": "I am an Israeli living in NYC. I lost family on October 7th and have Gazan friends. I am not afraid of the student protestors, even if I deeply disagree with some of their stances. What I’m afraid of is a world that sees thousands of children being blown up and says nothing.",
        "Weight": 17,
        "Id": 588
    },
    {
        "URL": "https://x.com/mhdksafa/status/1786139883595014501",
        "Date": "02/05/2024",
        "Text": "If you’re outraged by peaceful protests against genocide but not the genocide itself. Then you’re the problem.",
        "Weight": 10,
        "Id": 590
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1786258416303780019",
        "Date": "03/05/2024",
        "Text": "An attack that will not be reported in the media, Jewish settlers  - Throwing stones at Palestinian vehicles that were traveling on Route 60, in the area of ​​the village of Burqa  Ramallah Governorate - Al Bira (west bank).",
        "Weight": 8,
        "Id": 592
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1786092578863210551",
        "Date": "02/05/2024",
        "Text": "Nissi Peli of New Profile explains the legal barriers to calling for refusal to serve in the Gaza war, but offers an alternative for the Israeli refusal movement: \"We can give people information. Even if they've been brainwashed their whole life, they can still think.\"",
        "Weight": 12,
        "Id": 593
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1785926296180039821",
        "Date": "02/05/2024",
        "Text": "Israeli officials concerned Israel will be included for first time in UN report listing entities harming children in conflict zones alongside groups like Islamic State and Al-Qaeda",
        "Weight": 12,
        "Id": 595
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1785917188055949533",
        "Date": "02/05/2024",
        "Text": "This morning: Families of hostages block major highway in Tel Aviv with signs \"It's either Rafah or the Hostages\"",
        "Weight": 3,
        "Id": 596
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1785902132559770038",
        "Date": "02/05/2024",
        "Text": "\"In recent months, Haaretz has learned of several cases of armed Israelis – sometimes in Israel Defense Forces uniforms and usually wearing Jewish religious garb – stealing Palestinian sheep and goats.\"",
        "Weight": 23,
        "Id": 597
    },
    {
        "URL": "https://x.com/972mag/status/1785665824805519518",
        "Date": "01/05/2024",
        "Text": "In January, Israeli soldiers attacked a convoy of Palestinian technicians repairing a telecoms machine in Gaza, killing two. Contrary to the army’s account, an investigation shows the workers coordinated every step of the journey along an approved route.",
        "Weight": 16,
        "Id": 600
    },
    {
        "URL": "https://x.com/saritm0/status/1785613119735095724",
        "Date": "01/05/2024",
        "Text": "The Religious Zionist faction wants this war to go on forever because they want to reoccupy and re-settle Gaza. It's as simple as that. \nNetanyahu empowered them, and he bares ultimate responsibility for this blood lust.\nThe int. community must step in to end this insanity.",
        "Weight": 9,
        "Id": 601
    },
    {
        "URL": "https://x.com/mhdksafa/status/1785433472233816525",
        "Date": "30/04/2024",
        "Text": "Rafah is being decimated, there is nowhere else left to go. Israel is now bombing more than 1.7 million civilians trapped in Rafah, Gaza's last place of refuge. A massacre is happening in Rafah right now and the world is silent.",
        "Weight": 14,
        "Id": 602
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1785589688574628261",
        "Date": "01/05/2024",
        "Text": "An extreme right-wing channel published a report on our funding of the Israeli refusal movement. We're proud! Refusal to serve is the best way to help end the war. Donate and help us continue supporting the refusers --> https://bit.ly/3Rwul9c",
        "Weight": 8,
        "Id": 604
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1785312755026702480",
        "Date": "30/04/2024",
        "Text": "\"30 reserve paratroopers refuse order to prepare for assault on Rafah because of burnout.\" Regardless of motivation, refusal to serve helps stop the war.  \nJoin our call to Biden to end the war NOW --> https://gaza.refuser.org",
        "Weight": 6,
        "Id": 606
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1785309690198376835",
        "Date": "30/04/2024",
        "Text": "\"Parents of 400 Israeli combat soldiers to ministers:  Rafah will be a deathtrap, we won't let our children endanger their lives there.\" Regardless of motivation, refusal to serve helps stop the war. \nJoin our call to Biden to end the war NOW --> https://gaza.refuser.org",
        "Weight": 14,
        "Id": 607
    },
    {
        "URL": "https://x.com/OrenZiv_/status/1785037088066277792",
        "Date": "29/04/2024",
        "Text": "Protesters calling for a hostage deal sprayed “Bibi is a murderer״ on the Likud headquarters in Tel Aviv",
        "Weight": 1,
        "Id": 608
    },
    {
        "URL": "https://x.com/NTarnopolsky/status/1784311362040045939",
        "Date": "27/04/2024",
        "Text": "This girl was arrested after shouting \"Ben Gvir is a criminal!\" by the police now run by the criminal (convicted 13 times of hates crimes & terror.)",
        "Weight": 2,
        "Id": 613
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1783511542782193823",
        "Date": "25/04/2024",
        "Text": "\"There will be no security and peace while millions of people born here are denied basic civil and human rights.\" Listen to D explain why he refused service in the Israeli army.\nSupport us by signing our call to Biden to end the war NOW --> https://gaza.refuser.org",
        "Weight": 12,
        "Id": 618
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1783420760205226062",
        "Date": "25/04/2024",
        "Text": "Jerusalem: Many protesters responded to the calls to come and demonstrate for a hostage deal, following the release of the video of one of the hostages. They lit fires and are trying to break through the barrier to reach the Prime Minister's house on Gaza Street.",
        "Weight": 4,
        "Id": 623
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1783203862955847784",
        "Date": "24/04/2024",
        "Text": "\"Hirsch Goldberg-Polin is alive.\n\n There is a deal.  Israel refuses to withdraw from the Strip.  Israel refuses to cease fire.  Israel refuses to return the abductees.\n\n Go out and demonstrate against the war, there is no other solution.\" https://x.com/AirFreelance/s/AirFreelance/status/1783139436617761118…",
        "Weight": 12,
        "Id": 624
    },
    {
        "URL": "https://x.com/Yesh_Din/status/1781803903786287312",
        "Date": "20/04/2024",
        "Text": "[1] Yesterday, armed settlers attacked the village of A-Sawiya in the West Bank. Soldiers were present at the scene, but didn’t prevent or stop it. Three Palestinians were severely injured. Additionally, a Red Crescent ambulance that arrived to the scene >>",
        "Weight": 8,
        "Id": 627
    },
    {
        "URL": "https://x.com/FreeJerusalem1/status/1781648877445099928",
        "Date": "20/04/2024",
        "Text": "Dozens of Israeli activists protested today outside the Israeli torture camp 'Sde Teiman'.\nAt least 40 Palestinian prisoners were tortured to death in such camps, in places hidden from civilisation.\n\n@freejerusalem1\n @voicesagainstwar & others came to say:\nWe will not be silent!",
        "Weight": 20,
        "Id": 628
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1781416777634763104",
        "Date": "19/04/2024",
        "Text": "At least 40 Palestinians have been tortured to death in Israel since the beginning of the war. \"People are shouting, people are barking, people are crying, chained 24 hours a day and blindfolded, and the guards beat them non-stop\" (Monder Amira, El Aida, (1/12)",
        "Weight": 12,
        "Id": 630
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1781416807879819294",
        "Date": "19/04/2024",
        "Text": "Information about Gazan children is also being withheld and their exact number is unknown. Israel even refuses to reveal the number of existing prison facilities being used. It is forbidden to take part, directly or indirectly, in murder and torture. (11/12)",
        "Weight": 8,
        "Id": 631
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1781416810786500668",
        "Date": "19/04/2024",
        "Text": "It is the duty of all of us to protest and break the wall of silence. All involved must immediately stop, refuse and expose the crimes. (12/12)",
        "Weight": 2,
        "Id": 632
    },
    {
        "URL": "https://x.com/againstwarvoice/status/1781302893422739679",
        "Date": "19/04/2024",
        "Text": "Today (19.4) : signs reading stop the massacre and starvation is genocide  in a demonstration in Jerusalem",
        "Weight": 5,
        "Id": 633
    }
]