[
{
    "URL": "https://x.com/FranceskAlbs/status/1871840744832631134",
    "Date": "25/12/2024",
    "Text": "No matter how few they are, we must not invisibilise the Israelis who stand against Occupation, Apartheid, Genocide. May more of them join the anti-Apartheid struggle. Not living a lie and not being racist will be liberating.",
    "Weight": 21,
    "Id": 0
},
{
    "URL": "https://x.com/SMohyeddin/status/1871319811763863684",
    "Date": "23/12/2024",
    "Text": "I had never heard of “shoot and cry” until I interviewed \n@dianabuttu\n months ago. Israel’s portrayal of itself as a victim while systemically subjugating and murdering tens of thousands of Palestinians is quite wild. \n\nFULL EPISODE  https://youtu.be/98RYPSbhmYI?feature=shared…",
    "Weight": 12,
    "Id": 1
},
{
    "URL": "https://x.com/ASE/status/1862539526658220360",
    "Date": "29/11/2024",
    "Text": "Why did \n@kaitborsay\n of \n@TimesRadio\n insist on correcting \n@FranceskAlbs\n when she referred to the settler movement in Israel & their desire to reoccupy southern Lebanon? \n\n Why insist on calling it “northern Israel”?",
    "Weight": 8,
    "Id": 2
},
{
    "URL": "https://x.com/FranceskAlbs/status/1870268930151067929",
    "Date": "21/12/2024",
    "Text": "To all preparing for Christmas: as genocide grips Palestine (Jesus' birthplace, after all) consider turning your gifts into donations for those in need. \nThe environment will thank you too.",
    "Weight": 9,
    "Id": 3
},
{
    "URL": "https://x.com/IhabHassane/status/1869496849255813544",
    "Date": "18/12/2024",
    "Text": "HORRIBLE: This Israeli army drone-fired bullet was removed yesterday from the body of a 7-year-old injured child in Gaza. The bullet had penetrated his left chest and lodged in his back, causing a spinal cord injury that left him permanently paralyzed.",
    "Weight": 12,
    "Id": 4
},
{
    "URL": "https://x.com/FranceskAlbs/status/1869760653130596684",
    "Date": "19/12/2024",
    "Text": "Synopsis of a year spent denouncing a genocide that all 192 States together could not halt. What an utter disgrace.",
    "Weight": 5,
    "Id": 5
},
{
    "URL": "https://x.com/FranceskAlbs/status/1869429064660070880",
    "Date": "18/12/2024",
    "Text": "The scars of the genocide are visible from the sky. Gaza has been ungrounded and life, as it was, destroyed.",
    "Weight": 9,
    "Id": 6
},
{
    "URL": "https://x.com/UNGeneva/status/1867225765571412403",
    "Date": "12/12/2024",
    "Text": "In a joint press conference, independent human rights experts \n@FranceskAlbs\n, \n@SRjudgeslawyers\n, \n@profbensaul\n & \n@gkatr\n call for the international community to sanction Israel’s conduct of hostilities in the Occupied Palestinian Territory as well as in Syria, Lebanon, Iran.  1/5",
    "Weight": 10,
    "Id": 7
},
{
    "URL": "https://x.com/FranceskAlbs/status/1866882636699840597",
    "Date": "11/12/2024",
    "Text": "During today's press conference, clarification was sought on the figures on arms trade with Israel: \nfrom 2019 to 2023, US accounted for 69% and Germany 30% of Israeli conventional arms imports, totalling 99% (according to \n@SIPRIorg\n).",
    "Weight": 12,
    "Id": 8
},
{
    "URL": "https://x.com/Imran_posts/status/1862471930676195831",
    "Date": "29/11/2024",
    "Text": "NEW: The Oxford Union has voted that \"Israel is an apartheid state responsible for genocide\" by an overwhelming majority of 278 to 59",
    "Weight": 9,
    "Id": 9
},
{
    "URL": "https://x.com/yipengGe/status/1861867529607483770",
    "Date": "27/11/2024",
    "Text": "Dr. Dorotea Gucciardo who has been running medical delegations via \n@Glia_Intl\n under the \n@WHO\n Emergency Medical Team system since January this year, speaks about the unjust limitations Israel puts on aid workers and the catastrophic conditions in Gaza amounting to genocide.",
    "Weight": 13,
    "Id": 10
},
{
    "URL": "https://x.com/AbbyMartin/status/1857915326790512796",
    "Date": "16/11/2024",
    "Text": ".\n@FranceskAlbs\n perfectly deconstructs the bad faith question “does Israel have the right to exist?”",
    "Weight": 4,
    "Id": 11
},
{
    "URL": "https://x.com/NimerSultany/status/1856476354721517577",
    "Date": "12/11/2024",
    "Text": "Two giants of our time and two formidable voices against Israeli genocide and western complicity, earlier today at the London School of Hygiene & Tropical Medicine \n@LSHTM\n: \n@GhassanAbuSitt1\n and \n@FranceskAlbs",
    "Weight": 13,
    "Id": 12
},
{
    "URL": "https://x.com/l3v1at4an/status/1853882826686390456",
    "Date": "05/11/2024",
    "Text": "A Jewish man at \n@mcgillu\n asks \n@FranceskAlbs\n if her role would be better suited to someone not perceived as Anti-Jewish, and her answer is a flat “No.”",
    "Weight": 8,
    "Id": 13
},
{
    "URL": "https://x.com/AmnestyNI/status/1860987065770320137",
    "Date": "25/11/2024",
    "Text": "NEW: Francesca Albanese \n@FranceskAlbs\n, UN Special Rapporteur on human rights in the Occupied Palestinian Territory, will deliver this year’s Amnesty International NI annual lecture.\n\nThe event, chaired by \n@PatrickCorrigan\n, will be available to view online https://amnesty.org.uk/press-releases/northern-ireland-un-palestine-expert-deliver-annual-amnesty-lecture-genocide…",
    "Weight": 13,
    "Id": 14
},
{
    "URL": "https://x.com/4noura/status/1860376826985501095",
    "Date": "23/11/2024",
    "Text": "Israelis have turned the suffering of Palestinians into a spectator sport yet folks have the audacity to call Palestinians barbaric. This is what the lack of accountability looks like and it makes the whole world less safe. \n\n#Gaza #BDS #Nakba #Genocide",
    "Weight": 36,
    "Id": 15
},
{
    "URL": "https://x.com/weizman_eyal/status/1860333903921238457",
    "Date": "23/11/2024",
    "Text": "The term genocide demand that we interrogate the history of Zionist settler colonialism, its emphasis on intent requires an understanding of how intent is formed over time.",
    "Weight": 10,
    "Id": 16
},
{
    "URL": "https://x.com/FranceskAlbs/status/1860442037180407911",
    "Date": "23/11/2024",
    "Text": "Israel needs a cure, and urgently.  May justice help heal the wounds this State continues to open with arrogance and impunity.",
    "Weight": 4,
    "Id": 17
},
{
    "URL": "https://x.com/PDeepdive/status/1859325664077189318",
    "Date": "20/11/2024",
    "Text": "Erasing Palestinian Life in Gaza: Israel’s Genocide EXPOSED \n@FranceskAlbs\n, \n@weizman_eyal\n & \n@AlnaouqA\n\n\nWATCH:",
    "Weight": 17,
    "Id": 18
},
{
    "URL": "https://x.com/Malcolm_Pal9/status/1857479685283963045",
    "Date": "15/11/2024",
    "Text": "\"Israel's attacks on Gaza have wiped out 902 entire families erasing them from the civil registry\".\n\nAdmirable! Well done for continuing to speak truth to power.",
    "Weight": 8,
    "Id": 19
},
{
    "URL": "https://x.com/SMohyeddin/status/1857728741738172571",
    "Date": "16/11/2024",
    "Text": "Someone made this from my interview with \n@FranceskAlbs\n - which illustrates  everything she refers to in this clip. \n\nAbsolutely horrendous what Israel has been allowed to do to the children of Gaza. \n\nVia \n@paradigmfckr\n \n\nFULL INTERVIEW  https://youtu.be/5-IM3O9laLc?feature=shared…",
    "Weight": 8,
    "Id": 20
},
{
    "URL": "https://x.com/AssalRad/status/1857906199783780386",
    "Date": "16/11/2024",
    "Text": ": Israel is not deliberately preventing aid\n\n Media: Israeli soldiers prevented people from getting aid then set fire to it",
    "Weight": 12,
    "Id": 21
},
{
    "URL": "https://x.com/FranceskAlbs/status/1858159801563263447",
    "Date": "17/11/2024",
    "Text": "There should be no fear where there is courage, integrity and committment to justice and human rights without discrimination. The reputation of the ICC has always been at stake because of Palestine; now more than ever.",
    "Weight": 4,
    "Id": 22
},
{
    "URL": "https://x.com/ajplus/status/1857192669543268699",
    "Date": "14/11/2024",
    "Text": "Israeli forces allowed aid into northern Gaza for the first time in over a month – and then set fire to the shelters where the aid was delivered.",
    "Weight": 12,
    "Id": 23
},
{
    "URL": "https://x.com/CraigMokhiber/status/1857269119067767230",
    "Date": "15/11/2024",
    "Text": "Eyes on The Hague. Israeli & US  efforts to obstruct justice must not be allowed to succeed.",
    "Weight": 8,
    "Id": 24
},
{
    "URL": "https://x.com/1james_elder/status/1857431251042660483",
    "Date": "15/11/2024",
    "Text": "#Lebanon: hundreds of children killed. \n#Gaza: tens of thousands of children killed & wounded.\nResponse from those with power to prevent the carnage: Zero",
    "Weight": 4,
    "Id": 25
},
{
    "URL": "https://x.com/FranceskAlbs/status/1857002073428029933",
    "Date": "14/11/2024",
    "Text": "Palestinians are unsafe under Israeli rule, wherever they are.\nThe UN and its members should start discussing the implications of the \"responsibility to protect\", as done in other cases of egregious human rights violations.",
    "Weight": 16,
    "Id": 26
},
{
    "URL": "https://x.com/RnaudBertrand/status/1856619844290113742",
    "Date": "13/11/2024",
    "Text": "Extraordinary speech by \n@yuval_abraham\n on the weaponization of antisemitism in Germany, including against Jewish left activists like him, and the sheer shamefulness of it.\n\nA must-watch. As he says Germany (and much of the West) is \"failing once again\".",
    "Weight": 7,
    "Id": 27
},
{
    "URL": "https://x.com/Alonso_GD/status/1856360309805424693",
    "Date": "12/11/2024",
    "Text": "In celebration of \n@FranceskAlbs\n recent standing ovations at both LSE and SOAS, let me highlight the main contributions her Reports have made to the way we understand the genocide of the Palestnian people in Gaza ",
    "Weight": 9,
    "Id": 28
},
{
    "URL": "https://x.com/JustJewsUK/status/1856280404363292983",
    "Date": "12/11/2024",
    "Text": "The Israel lobby claims UN Special Rapporteur \n@FranceskAlbs\n is an antisemite. Someone who knows about antisemitism, the Holocaust survivor Stephen Kapos, begs to differ. Here he is with Francesca after her recent speech at SOAS university, London\n\n#IsraelLobby\n#GazaGenocide",
    "Weight": 23,
    "Id": 29
},
{
    "URL": "https://x.com/FranceskAlbs/status/1856470818970079576",
    "Date": "12/11/2024",
    "Text": "Let it become a tale. \nNever forget the victims of a genocide.",
    "Weight": 5,
    "Id": 30
},
{
    "URL": "https://x.com/FranceskAlbs/status/1855565601751609591",
    "Date": "10/11/2024",
    "Text": "Pro-Israelism is a cult in the West.\nDangerous, hypocritical, and shameful at the time an entire people is being exterminated with a mix of 21st century military technologies and evergreen genocidal sadism.",
    "Weight": 16,
    "Id": 31
},
{
    "URL": "https://x.com/FranceskAlbs/status/1855392972558463142",
    "Date": "09/11/2024",
    "Text": "Once again. Western media should be investigated for the role they are playing in obscuring Israel's atrocities. In other contexts, intl tribunals have found media figures responsible for complicity, incitement, and other intl crimes.",
    "Weight": 6,
    "Id": 32
},
{
    "URL": "https://x.com/AssalRad/status/1855330318502473821",
    "Date": "09/11/2024",
    "Text": "While you’re distracted by Amsterdam, there’s still a genocide happening in Gaza. This is what Israeli “soccer fans” were joyfully cheering on.",
    "Weight": 17,
    "Id": 33
},
{
    "URL": "https://x.com/_jwhittall/status/1854616339828052322",
    "Date": "07/11/2024",
    "Text": "1/11 Everyone in Gaza feels as if they have been put on death row. If not killed by bombs or bullets, they are slowly suffocating from a lack of the basic means of survival. The only difference is the speed at which you die. The world has failed #Gaza. A…",
    "Weight": 8,
    "Id": 34
},
{
    "URL": "https://x.com/FranceskAlbs/status/1854525518496104811",
    "Date": "07/11/2024",
    "Text": "While the genocide of the Palestinians in Gaza continues unabated, conscientious citizens everywhere interrogate all aspects of the system that has allowed Israel's unlawful occupation to fester.",
    "Weight": 26,
    "Id": 35
},
{
    "URL": "https://x.com/FranceskAlbs/status/1854022543893484012",
    "Date": "06/11/2024",
    "Text": "I am so profoundly touched by this expression of support from Jewish organisations worldwide.\nThe minions out there will be livid. Let's stay strong, altogether.",
    "Weight": 4,
    "Id": 36
},
{
    "URL": "https://x.com/ASE/status/1853158222279921975",
    "Date": "03/11/2024",
    "Text": "We didn’t learn from the genocide in Bosnia. Israel is using the same  systematic atrocities: forced displacement, torture, and brutal detention camps. And Europe is still defending Israel’s right to commit genocide against Palestinians.",
    "Weight": 26,
    "Id": 37
},
{
    "URL": "https://x.com/MuntherIsaac/status/1853365374466544020",
    "Date": "04/11/2024",
    "Text": "Settlers attack the Palestinian city of Al Bireh, burning many cars and terrorizing an entire community",
    "Weight": 4,
    "Id": 38
},
{
    "URL": "https://x.com/FranceskAlbs/status/1852707449519616414",
    "Date": "02/11/2024",
    "Text": "La distruzione del popolo palestinese in corso è intenzionale, deliberata, pianificata da tempo e per questo dolorosamente crudele. Un genocidio  in mondovisione.",
    "Weight": 4,
    "Id": 39
},
{
    "URL": "https://x.com/democracynow/status/1851974149939347729",
    "Date": "31/10/2024",
    "Text": "Israel's war on Gaza is a genocide, says U.N. rights expert \n@franceskalbs\n, who has just released a new report titled \"Genocide as Colonial Erasure.\" There has not only been a failure to prevent genocide, but it has been \"enabled through the various organs of the state,\" she says.",
    "Weight": 23,
    "Id": 40
},
{
    "URL": "https://x.com/ASE/status/1851741663539966159",
    "Date": "30/10/2024",
    "Text": "“I AM NOT THE STORY, the story is that Palestinians risk being erased … The only way to comply with international law is imposing sanctions against Israel. May this be the last genocide in human history.” \n\n— \n@FranceskAlbs\n at the UN in NYC",
    "Weight": 17,
    "Id": 41
},
{
    "URL": "https://x.com/jvplive/status/1851376695032394082",
    "Date": "29/10/2024",
    "Text": "“This ongoing genocide is doubtlessly the consequence of the exceptional status and protracted impunity that has been afforded to Israel.”\n\nThis is the truth that personal attacks against \n@franceskalbs\n are designed to suppress.",
    "Weight": 9,
    "Id": 42
},
{
    "URL": "https://x.com/FranceskAlbs/status/1850492708315373707",
    "Date": "27/10/2024",
    "Text": "20,000 missing children in Gaza- some maimed beyond recognition.\nOn top of the 17,000 killed in 12 months. \n\nWe call it genocide because it is genocide.",
    "Weight": 14,
    "Id": 43
},
{
    "URL": "https://x.com/FranceskAlbs/status/1850406973801459894",
    "Date": "27/10/2024",
    "Text": "Travelling to the United States to present my new report \"Genocide as Colonial Erasure\" to the UN. I will also  discuss it in various public venues. \nA small contribution to try to stop the atrocities in Palestine.",
    "Weight": 9,
    "Id": 44
},
{
    "URL": "https://x.com/FranceskAlbs/status/1850300970707595438",
    "Date": "26/10/2024",
    "Text": "The entire population of Gaza is at risk of dying in a genocide that has been announced and executed under  our watch.",
    "Weight": 9,
    "Id": 45
},
{
    "URL": "https://x.com/adequatehousing/status/1849123546989027420",
    "Date": "23/10/2024",
    "Text": "Winter is coming and more than a million displaced people in Gaza need urgent shelter. The world must respond now!\nhttps://nytimes.com/2024/10/23/world/middleeast/gaza-displaced-winter-tents.html?smid=nytcore-ios-share&referringSource=articleShare… via \n@NYTimes",
    "Weight": 8,
    "Id": 46
},
{
    "URL": "https://x.com/CCEILSOAS/status/1849239944386027839",
    "Date": "24/10/2024",
    "Text": "We are thrilled to co-sponsor w \n@soasCHRL\n and \n@soasLAW\n this wonderful event bringing \n@UN\n Special Rapporteur on the OPT \n@FranceskAlbs\n to \n@SOAS\n to speak on \"Imperialism, Colonialism and Human Rights: The Litmus Test of Palestine\". Please register in advance.",
    "Weight": 4,
    "Id": 47
},
{
    "URL": "https://x.com/NimerSultany/status/1849448800177275182",
    "Date": "24/10/2024",
    "Text": "A step in the right direction following the ICJ Advisory opinion: \n \n\"The Government is advising Norwegian companies not to engage in trade or business cooperation that serve to perpetuate Israel’s illegal presence in the Occupied Palestinian Territory,\"",
    "Weight": 8,
    "Id": 48
},
{
    "URL": "https://x.com/FranceskAlbs/status/1849357884359860602",
    "Date": "24/10/2024",
    "Text": "Whenever journalists are allowed to check, Israel’s claim that militants’ bases are beneath hospitals is revealed for what it is: the excuse to bomb civilians. \nThis is the lesson learnt from Gaza since 2008.",
    "Weight": 8,
    "Id": 49
},
{
    "URL": "https://x.com/FranceskAlbs/status/1849232008880263651",
    "Date": "23/10/2024",
    "Text": "URGENT! These 6 Palestinians are among the last journalists surviving Israel's onslaught in Gaza (with 130+ of their colleagues killed in the last year). Declaring them \"terrorists\" sounds like a death sentence.\nThey must be protected at all cost.",
    "Weight": 26,
    "Id": 50
},
{
    "URL": "https://x.com/abierkhatib/status/1847942426457002367",
    "Date": "20/10/2024",
    "Text": "“'The doctor told me count to three - and he cut my leg” a line I will never forget. \n\nAmong many horrific things, Israelis will always be remembered for creating the biggest cohort of paediatric amputees in human history.",
    "Weight": 11,
    "Id": 51
},
{
    "URL": "https://x.com/owenjonesjourno/status/1847738031001755932",
    "Date": "19/10/2024",
    "Text": "If this talented young woman was seen as “us”, then Israel murdering her would be a cause celebre, widely denounced as a heinous crime.\n\nBut she is instead “them”, not quite human, and therefore her killing easily ignored, as if it never even happened.",
    "Weight": 4,
    "Id": 52
},
{
    "URL": "https://x.com/luigidaniele10/status/1846985481537360324",
    "Date": "17/10/2024",
    "Text": "Now the ICC will be 'biased' or 'antisemitic' when it issues arrest warrants, because only the Israeli suspects are still alive.\n\nTrials, with their heritage of memory and truth, were enough of a response for the likes of Göring,  Ohlendorf, Eichmann! But not for Deif & Sinwar",
    "Weight": 11,
    "Id": 53
},
{
    "URL": "https://x.com/abierkhatib/status/1846962404158329324",
    "Date": "17/10/2024",
    "Text": "“ Israel isn’t at war with Sinwar, or Hamas. Israel is at war with the Palestinian people” \n\nThis interview w Daniel Levy should \n be aired on every TV channel in both the US & Europe.",
    "Weight": 16,
    "Id": 54
},
{
    "URL": "https://x.com/FranceskAlbs/status/1846876210426417474",
    "Date": "17/10/2024",
    "Text": "I crimini che abbiamo inflitto ai nostri concittadini ebrei ed ebree durante il nazifascismo è un'onta indelebile. Combattere l'amnesia storica e l'analfabetismo funzionale che affliggono la ns società è una forma di giustizia. Non possiamo permetterci di continuare a fallire.",
    "Weight": 2,
    "Id": 55
},
{
    "URL": "https://x.com/mohammedIhysse/status/1846494787559432206",
    "Date": "16/10/2024",
    "Text": "I prepared and defended my master's thesis amidst the sounds of bombing and terror during the Gaza war, to send a message to the world that we in Gaza deserve life and are waiting for the sun of freedom. We are waiting for the world to see us .",
    "Weight": 8,
    "Id": 56
},
{
    "URL": "https://x.com/SaulStaniforth/status/1846068656842609151",
    "Date": "15/10/2024",
    "Text": "Israel has killed a classroom full of children every single day for a whole year.\n\nSam Rose from UNRWA.",
    "Weight": 4,
    "Id": 57
},
{
    "URL": "https://x.com/FranceskAlbs/status/1845945419945365936",
    "Date": "14/10/2024",
    "Text": "Is \n@SkyNews\n accusing Israel of using child soldiers?",
    "Weight": 4,
    "Id": 58
},
{
    "URL": "https://x.com/FranceskAlbs/status/1845929836142862352",
    "Date": "14/10/2024",
    "Text": "Every attempt at silencing the ugly, despicable, revolting truth of a genocide enforced with any possible means, will only make the lie bigger. https://x.com/PeruginiNic/st/PeruginiNic/status/1845911230600429729…",
    "Weight": 5,
    "Id": 59
},
{
    "URL": "https://x.com/FranceskAlbs/status/1845886868019122609",
    "Date": "14/10/2024",
    "Text": "Each civic action is humanity in action. May the Gaza one be the last genocide in human history. May We the People have the strength to stop it.",
    "Weight": 9,
    "Id": 60
},
{
    "URL": "https://x.com/YaelBerda/status/1845644685454328129",
    "Date": "14/10/2024",
    "Text": "Please do everything you can to stop this. We Israelis whom oppose Netanyahu’s regime cannot stop this from within. There is no formal opposition. \nHelp.\nPlease share.",
    "Weight": 11,
    "Id": 61
},
{
    "URL": "https://x.com/FranceskAlbs/status/1845526246010073575",
    "Date": "13/10/2024",
    "Text": "For decades Israel has violated intl law, incl UN res. & ICJ orders. This year it has bombed dozens of UN premises, killed hundreds of UN staff, accused UN officials of \"terrorism\" & \"antisemitism\" among others. Now it is attacking peacekeepers.\nWhen will Israel be #UNseated?",
    "Weight": 11,
    "Id": 62
},
{
    "URL": "https://x.com/johncusack/status/1844767733738570103",
    "Date": "11/10/2024",
    "Text": "'No Propaganda on Earth Can Hide the Wound That Is Palestine: Arundhati Roy's PEN Pinter Prize Acceptance Speech",
    "Weight": 4,
    "Id": 63
},
{
    "URL": "https://x.com/PDeepdive/status/1844424887429103688",
    "Date": "10/10/2024",
    "Text": "NEW | Israeli Forces Proudly Exhibit their War Crimes to the World.\n\n\"Since the film came out... people are frantically deleting their social media accounts.\"\n\n\"But it's too late - we saved it all!\" \n@PulaRJS",
    "Weight": 20,
    "Id": 64
},
{
    "URL": "https://x.com/FranceskAlbs/status/1844416211234517009",
    "Date": "10/10/2024",
    "Text": "There are no lines that Israel is not ready to cross. As it intensifies its extermination campaign against Palestinians in Gaza, it has also begun targeting UN peacekeepers, even those from nations that supply it with arms. Will the West eventually reconsider its support?",
    "Weight": 16,
    "Id": 65
},
{
    "URL": "https://x.com/UN_HRC/status/1844397019907191130",
    "Date": "10/10/2024",
    "Text": ".\n@UN\n Commission of Inquiry says in a new report that #Israel has perpetrated a concerted policy to destroy #Gaza’s healthcare system; war crimes & crimes against humanity committed in treatment of Palestinian detainees & Israeli & foreign hostages.\n\nReadhttps://bit.ly/4dJoExQ",
    "Weight": 34,
    "Id": 66
},
{
    "URL": "https://x.com/FranceskAlbs/status/1844387177943400954",
    "Date": "10/10/2024",
    "Text": "Chissà se ora che Israele ha aperto il fuoco sulle basi Italiane in Libano, l'Italia si deciderà a sospendere la vendita di armi a Israele.",
    "Weight": 8,
    "Id": 67
},
{
    "URL": "https://x.com/FranceskAlbs/status/1844269221460705753",
    "Date": "10/10/2024",
    "Text": "Genocide as a means to an end.",
    "Weight": 5,
    "Id": 68
},
{
    "URL": "https://x.com/FranceskAlbs/status/1844006856517386458",
    "Date": "09/10/2024",
    "Text": "\"Journalists must be protected in war, especially Palestinians\". Why?\nBecause Palestinian journalists are the only ones who could report from within Gaza (no one else was allowed in); and because they have been deliberately targeted, often by drones.",
    "Weight": 16,
    "Id": 69
},
{
    "URL": "https://x.com/sevslv/status/1843542391065858490",
    "Date": "08/10/2024",
    "Text": "A complaint has been filed in  regarding 's interference with the ICC:\n\n\"Israel’s espionage against the ICC may have included breaches of Dutch criminal law as well as offences against the administration of justice under article 70 of the Rome Statute\"",
    "Weight": 4,
    "Id": 70
},
{
    "URL": "https://x.com/ilmanifesto/status/1843540782298374520",
    "Date": "08/10/2024",
    "Text": "In Israele il giorno del dolore e della rabbia per le 1.200 vittime del 7 ottobre divide una volta di più le famiglie degli ostaggi, che vogliono l’accordo con Hamas, da Netanyahu e dalla sua «guerra di resurrezione» che non tollera limiti. Un anno dopo, il mondo resta a guardare",
    "Weight": 8,
    "Id": 71
},
{
    "URL": "https://x.com/FranceskAlbs/status/1843605704227336564",
    "Date": "08/10/2024",
    "Text": "How many lives we could have saved. How many lives we can still save. \n\nPlease watch this video and remember: \"Palestinians are not victims of war, they are victims of an ideology\" (cit. \n@pappe54\n).",
    "Weight": 8,
    "Id": 72
},
{
    "URL": "https://x.com/bartov_omer/status/1842564611805200825",
    "Date": "05/10/2024",
    "Text": "Watch this entire devastating report \n\nOur \n@AJIunit\n investigation exposes war crimes in Gaza through the medium of photos and videos posted online by Israeli soldiers themselves during the year-long conflict.  Watch the full film here. #GazaCrimes",
    "Weight": 30,
    "Id": 73
},
{
    "URL": "https://x.com/FranceskAlbs/status/1842830463611588864",
    "Date": "06/10/2024",
    "Text": "Thank you \n@EpshtainItay\n and \n@NRC_Norway\n for hosting this important discussion on the protection of civilians, bridging the gap between legal frameworks and challenges (and crimes) on the ground.\nLook forward to being with you, Chris Sidoti and \n@weizman_eyal\n.\n#UNGA79",
    "Weight": 2,
    "Id": 74
},
{
    "URL": "https://x.com/ZahiraJaser/status/1842656435441959417",
    "Date": "05/10/2024",
    "Text": "Thank you \n@FranceskAlbs\n for saying this so beautifully and powerfully. And thank you \n@ASE\n for reading this alloys at the #voicesofpalestine congregations tonight in London. You were in the room with us through Ahmed’s words. 1/",
    "Weight": 4,
    "Id": 75
},
{
    "URL": "https://x.com/jasonhickel/status/1841378974527627279",
    "Date": "02/10/2024",
    "Text": "It's wild that an operation against military targets which killed zero people (one dying from falling shrapnel) has triggered more outrage from Western media than Israeli operations targeting residential areas and ambulances and massacring hundreds of civilians.",
    "Weight": 8,
    "Id": 76
},
{
    "URL": "https://x.com/lorenzokamel/status/1841028353232347138",
    "Date": "01/10/2024",
    "Text": "—Hezbollah non viene da Marte.\n—La Storia non inizia 1 anno fa.\n—Tra il 2007 e il '22 sono state documentate\n22,355 violazioni dello spazio aereoda parte delle forze: https://airpressure.info \n—La tesi della \"difesa della civiltà occidentale\" è alimentata dall'odio/ignoranza.",
    "Weight": 3,
    "Id": 77
},
{
    "URL": "https://x.com/FranceskAlbs/status/1839258880334786769",
    "Date": "26/09/2024",
    "Text": "Happening today: relevant to fully understand the logic and tactics Israel has used to destroy Gaza, and that it now seems ready to export to other areas of Palestine and the whole region.",
    "Weight": 12,
    "Id": 78
},
{
    "URL": "https://x.com/mehdirhasan/status/1838679476525502977",
    "Date": "24/09/2024",
    "Text": "The New York Post reporter who has spent years trying to smear me and other Muslims turned up at my Gaza debate & tried to do a ‘gotcha’ on me, about Zeteo & Qatar. \n\nBut it didn’t work out so well for him.\n\nWatch to the end  & then subscribe to Zeteo:\nhttp://Zeteo.com/subscribe",
    "Weight": 4,
    "Id": 79
},
{
    "URL": "https://x.com/FranceskAlbs/status/1838661695243243746",
    "Date": "24/09/2024",
    "Text": "I keep on saying that Israel is writing a new page of genocide. \nThis video, of settlers taking boats to watch the bombing of Gaza, is disgusting beyond what decent human body and mind can tolerate.",
    "Weight": 13,
    "Id": 80
},
{
    "URL": "https://x.com/PDeepdive/status/1834088194184269964",
    "Date": "12/09/2024",
    "Text": "The World Court DEMANDS All States URGENTLY Boycott, Divest and Sanction Israel NOW. \n@d_machover",
    "Weight": 4,
    "Id": 81
},
{
    "URL": "https://x.com/Alonso_GD/status/1837624173415289112",
    "Date": "21/09/2024",
    "Text": "Many think the term “resistance” carries normative value capable of whitewashing war crimes. This is not how int’l law applies it. Armed struggle through prohibited means/methods constitutes war crimes, like the ones Hamas committed on Oct 7. Use of the term does not justify them",
    "Weight": 28,
    "Id": 82
},
{
    "URL": "https://x.com/FranceskAlbs/status/1837563079254503508",
    "Date": "21/09/2024",
    "Text": "International order on a knife’s edge. After the #ICJ's landmark decision regarding the obligation to end Israel's unlawful occupation, here are 14 recommendations for member states to promptly comply with it:",
    "Weight": 9,
    "Id": 83
},
{
    "URL": "https://x.com/FranceskAlbs/status/1837462945673936976",
    "Date": "21/09/2024",
    "Text": "Had #sanctions against #Israel's unlawful presence in the occupied Palestinian territory been imposed decades ago, today would be less grim, for Palestinians, Israelis, and Int'l Law. \nThe time for accountability cannot be postponed any further.",
    "Weight": 27,
    "Id": 84
},
{
    "URL": "https://x.com/PDeepdive/status/1837171039098302659",
    "Date": "20/09/2024",
    "Text": "EXPOSED: How the Western Media Can Be Prosecuted For It's Role In the Gaza Genocide | \n@CraigMokhiber\n, \n@AlnaouqA\n\n\n“There are historic precedents”",
    "Weight": 9,
    "Id": 85
},
{
    "URL": "https://x.com/NimerSultany/status/1835393591809577194",
    "Date": "15/09/2024",
    "Text": "\"Could it be that Palestinian legal scholars do not exist?\", asks Prof Nehal Bhuta in this \n@ejiltalk\n\npodcast on Palestine, international law, politics, and liberation with \n@dianabuttu\n \n@ArdiImseis\n and myself.",
    "Weight": 8,
    "Id": 86
},
{
    "URL": "https://x.com/FranceskAlbs/status/1835367051973529701",
    "Date": "15/09/2024",
    "Text": "ALERT: Tomorrow Monday 16, at 1.30pm CET, UN Independent Experts will host a press conference to discuss the escalating genocidal violence against the Palestinians under Israel's military control.",
    "Weight": 12,
    "Id": 87
},
{
    "URL": "https://x.com/FranceskAlbs/status/1835233009714282868",
    "Date": "15/09/2024",
    "Text": "I’m terribly sorry I couldn’t be there, as I encountered an unforeseen visa issue at the last minute.\n\nI wish Jewish Currents, speakers and attendees all the best. I will follow your discussions from afar.",
    "Weight": 4,
    "Id": 88
},
{
    "URL": "https://x.com/FranceskAlbs/status/1835120280655606230",
    "Date": "15/09/2024",
    "Text": "Illegal Israeli settlers have poisoned livestock of a poor Palestinian family in the occupied West Bank. It is nothing but barbarism!",
    "Weight": 12,
    "Id": 89
},
{
    "URL": "https://x.com/contactujfp/status/1833254613048561818",
    "Date": "09/09/2024",
    "Text": "Vidéo : Appel juif international contre le génocide à Gaza\nCela fait 11 mois que l’État d’Israël a déclenché sa guerre génocidaire. Cet appel, lancé fin août, est déjà signé par des centaines de Juives et Juifs du monde entier, rejoignez-nous !\nhttps://framaforms.org/appel-juif-international-contre-le-genocide-a-gaza-1724141001…",
    "Weight": 13,
    "Id": 90
},
{
    "URL": "https://x.com/FranceskAlbs/status/1833476771561243074",
    "Date": "10/09/2024",
    "Text": "Despite the heinous nature & recurring instances of genocide, from Rwanda to former Yugoslavia and, plausibly, Myanmar, the current legal framework remains inadequate in preventing genocide - mainly because of political interests, cynicism, and racial biases.",
    "Weight": 10,
    "Id": 91
},
{
    "URL": "https://x.com/RyanRozbiani/status/1832916829263778039",
    "Date": "08/09/2024",
    "Text": "Palestinian Lawyer \n@dianabuttu\n:\n\nLiving in the Israeli city of Haifa, Buttu has observed Israeli protests\n\n“I’ve yet to see a single sign talking about Palestinians, not one.”",
    "Weight": 28,
    "Id": 92
},
{
    "URL": "https://x.com/FranceskAlbs/status/1833282098804736092",
    "Date": "09/09/2024",
    "Text": "Palestinians need #protection.\n\nThe UN must deploy a #ProtectivePresence agreed upon by the Palestinians pending the dismantlement of Israel's unlawful presence in occupied Palestinian territory (requested by the #ICJ).",
    "Weight": 24,
    "Id": 93
},
{
    "URL": "https://x.com/FranceskAlbs/status/1833255484490486238",
    "Date": "09/09/2024",
    "Text": "Apartheid Israel is accelerating the ethnic cleansing of Palestine, and committing acts of genocide on the way. How long will it take to UN Member states to impose sanctions on this serial violator of int'l law?",
    "Weight": 13,
    "Id": 94
},
{
    "URL": "https://x.com/AbbyMartin/status/1830990229316018409",
    "Date": "03/09/2024",
    "Text": "Israel bombed the entrance of Al-Fakhoura School, a designated “safe zone” for children to get the polio vaccine. My friend’s baby nephew, who was scheduled for vaccination today, is now internally bleeding from shrapnel in his spine/lungs. “It’s the same lie & mockery by Israel”",
    "Weight": 8,
    "Id": 95
},
{
    "URL": "https://x.com/alhaq_org/status/1832435815487811822",
    "Date": "07/09/2024",
    "Text": "1/4 Yesterday American activist, Aysenur Ezgi Eygi & Palestinian child, Bana Laboum were shot/killed by the Israeli Occupying Forces with live ammunition in the West Bank, hours apart. Aysenur was shot in the head in Beita, Bana in the chest while looking out her window in Qaryut",
    "Weight": 12,
    "Id": 96
},
{
    "URL": "https://x.com/SaulStaniforth/status/1831221863357313423",
    "Date": "04/09/2024",
    "Text": "\"Each govt should do due diligence & reassess all economic, military, strategic, diplomatic and political forms of partnerships [they have] with Israel as long as it maintains an unlawful occupation\"\n\n\n@FranceskAlbs\n, UN Special Rapporteur for the occupied Palestinian territory,",
    "Weight": 13,
    "Id": 97
},
{
    "URL": "https://x.com/SaulStaniforth/status/1831225381627527370",
    "Date": "04/09/2024",
    "Text": ".\n@FranceskAlbs\n explains it doesn't matter if Lammy thinks Israel has/hasn't violated intl law. What matters is the ICJ has ruled there is a risk of genocide, & that places obligations on member states according to the genocide convention, that include suspending military support",
    "Weight": 14,
    "Id": 98
},
{
    "URL": "https://x.com/Resist_05/status/1830799717300871552",
    "Date": "03/09/2024",
    "Text": "Israel is in civil war…",
    "Weight": 4,
    "Id": 99
},
{
    "URL": "https://x.com/FranceskAlbs/status/1830876748629606541",
    "Date": "03/09/2024",
    "Text": "I implore the Israelis who care for justice and the intl community in the oPt to immeditaly visit northern West Bank and protest this senseless violence. Let's not abandon the Palestinians in this tragic hour.",
    "Weight": 19,
    "Id": 100
},
{
    "URL": "https://x.com/AmnestyUK/status/1830163395502334132",
    "Date": "01/09/2024",
    "Text": "179 Palestinian health workers are being held in secret detention by Israeli forces.\n\nWe are witnessing the systematic destruction of the Palestinian health care system.\n\nWe stand with them. Will the UK government and medical institutions?\n\n#FreeGazaMedics #StopArmingIsrael",
    "Weight": 24,
    "Id": 101
},
{
    "URL": "https://x.com/jeremyscahill/status/1829563978512777681",
    "Date": "30/08/2024",
    "Text": "UN Rapporteur on Palestine tells me: “I see a serious pattern parallel with what is happening in the Gaza Strip—patterns of torture, of destruction, of extrajudicial killings, of uprooting that are very similar to Gaza.”\n\nhttps://dropsitenews.com/p/israeli-invasion-west-bank-parallels-gaza… Full story at \n@DropSiteNews",
    "Weight": 24,
    "Id": 102
},
{
    "URL": "https://x.com/FranceskAlbs/status/1829724492827971991",
    "Date": "31/08/2024",
    "Text": "Looking forward to this important event. So much needed.\nThank you \n@JewishCurrents\n.",
    "Weight": 4,
    "Id": 103
},
{
    "URL": "https://x.com/4noura/status/1829507652248076590",
    "Date": "30/08/2024",
    "Text": "Israeli state and society frames all Palestinians guilty for refusing to surrender to a life of permanent subjugation. State has held lawmaker & researcher #KhaledaJarrar for 8 mo & has in solitary confinement in a tiny cell w/o windows since 8/12 bc it can. \n\n#Palestine #Captive",
    "Weight": 20,
    "Id": 104
},
{
    "URL": "https://x.com/adequatehousing/status/1828641597967220783",
    "Date": "28/08/2024",
    "Text": "Israel is Demolition Nation par excellence. Evidence of vast demolition of housing in Rafah, a pattern that extends far back, again shows commission of vast international crimes including domicide. ICC cannot fail to add these to its charges.",
    "Weight": 8,
    "Id": 105
},
{
    "URL": "https://x.com/luigidaniele10/status/1829088900859449661",
    "Date": "29/08/2024",
    "Text": "In IL, the use of human shields is a war crime, as such attracting a trial and eventually a penal sanction. \n\nFraming entire populations as human shields, and claiming that *all* the civilians exterminated by the attackers are a fault of the attacked... Is a genocidal argument.",
    "Weight": 5,
    "Id": 106
},
{
    "URL": "https://x.com/abierkhatib/status/1826863183941849458",
    "Date": "23/08/2024",
    "Text": "Actor Mandy Patinkin & CEO of Americans for Peace Now call for a Palestinian-American to be allowed to speak at the DNC. Patinkin ends the video by saying, \n\n\"To not hear that voice is too loud a scream[...]it's wrong.\"",
    "Weight": 4,
    "Id": 107
},
{
    "URL": "https://x.com/FranceskAlbs/status/1826034724177142086",
    "Date": "20/08/2024",
    "Text": "Bravo \n@ninalakhani\n for exposing the countries that continue to run businesses with Israel in the time of genocide. Absolutely a must read.\n#sanctions",
    "Weight": 9,
    "Id": 108
},
{
    "URL": "https://x.com/mattduss/status/1825998950211690630",
    "Date": "20/08/2024",
    "Text": "We’re in an absurd situation where both Hamas and Israeli officials agree that Netanyahu is blocking Biden’s ceasefire proposal, Netanyahu publicly rejects key elements of it, but Biden and Blinken continue to insist that Netanyahu supports it and Hamas is blocking it. What.",
    "Weight": 16,
    "Id": 109
},
{
    "URL": "https://x.com/FranceskAlbs/status/1825480487621505222",
    "Date": "19/08/2024",
    "Text": "40,000 ascertained casualties, yet the focus remains on Israel 's security, whatever that implies. \nThe disrespect for Palestinian life is disconcerting.\n#CeasefireNOW",
    "Weight": 8,
    "Id": 110
},
{
    "URL": "https://x.com/tparsi/status/1824915514616844780",
    "Date": "17/08/2024",
    "Text": "Never ceases to amaze me the degree to which US media willfully ignores int law while simultaneously presenting the US as defending law & order\n\nWashPost completely ignores the ICj determination of Israel's occupation of Palestine as illegal and instead sanitizes it as \"control\"",
    "Weight": 13,
    "Id": 111
},
{
    "URL": "https://x.com/FranceskAlbs/status/1824573551678198144",
    "Date": "16/08/2024",
    "Text": "I hope that more diplomats will follow the brave lead of Mark Smith and speak up against the enablers of Israel's atrocities.\n #DiplomatsAgainstGenocide",
    "Weight": 9,
    "Id": 112
},
{
    "URL": "https://x.com/FranceskAlbs/status/1824122770583863637",
    "Date": "15/08/2024",
    "Text": "Important reading to understand why the violence Palestinians experience as a people is without borders. \n#AntiPalestinianRacism #apr",
    "Weight": 12,
    "Id": 113
},
{
    "URL": "https://x.com/FranceskAlbs/status/1822620386770469135",
    "Date": "11/08/2024",
    "Text": "US funding of Israeli #Genocide is ballooning as the Israeli army uses ever more lethal bombs. The ones used yesterday in the #AlTabinSchool massacre sliced bodies to the point of making them unrecognizable. They are now identified by weight: 70kg bag = 1 adult. Revolting.",
    "Weight": 21,
    "Id": 114
},
{
    "URL": "https://x.com/FranceskAlbs/status/1822335529108582547",
    "Date": "10/08/2024",
    "Text": "A journalist asked me how I \"feel\" about Gaza today. How am I supposed to feel in the face of a Western-sponsored army relentlessly butchering people trapped in what resembles a circle of Dante's Hell?\n\nI feel sick.",
    "Weight": 4,
    "Id": 115
},
{
    "URL": "https://x.com/FranceskAlbs/status/1822030397871681825",
    "Date": "09/08/2024",
    "Text": "While most Western people enjoy summer and the Olympic Games/\n@jeuxolympiques\n, the #genocide in Palestine continues unabated. No sign for now of UNSC or other influential member states intervening to stop it. Pure madness. \n#WakeUp\nEnd the #GenocideinGaza \n#CeasefireNOW",
    "Weight": 18,
    "Id": 116
},
{
    "URL": "https://x.com/Ecatetriformis/status/1820955389149507667",
    "Date": "06/08/2024",
    "Text": "\"Ero un capitano dell'aeronautica israeliana e mi sono reso conto che quello che stavamo facendo era terrorismo. I nostri aerei hanno compiuto uccisioni di massa di civili. Israele è l'apartheid e i miei comandanti militari sono criminali di guerra\".\n\nYonatan Shapira",
    "Weight": 12,
    "Id": 117
},
{
    "URL": "https://x.com/FranceskAlbs/status/1821313905341428090",
    "Date": "07/08/2024",
    "Text": "The US/Israel intermingling in the current \"crisis\" is mindblowing. I am very interested in the criminal implications of it. And so should be the \n@IntlCrimCourt\n.\n\n@KarimKhanQC",
    "Weight": 4,
    "Id": 118
},
{
    "URL": "https://x.com/FranceskAlbs/status/1821230555536458001",
    "Date": "07/08/2024",
    "Text": "Italian mainstream media \n@Corriere\n will have to pay 15,000€ for the defamation of Palestinian human rights defender \n@SJabaren\n of \n@alhaq_org\n.",
    "Weight": 4,
    "Id": 119
},
{
    "URL": "https://x.com/nevegordon/status/1821195343952015372",
    "Date": "07/08/2024",
    "Text": "Meanwhile as the genocide continues Israeli news program with a panel of commentators debating whether rape of Palestinian prisoners is good or bad.",
    "Weight": 17,
    "Id": 120
},
{
    "URL": "https://x.com/NimerSultany/status/1820899465437573132",
    "Date": "06/08/2024",
    "Text": "Too bad western media did not pay attention to reports on Israel's policies of detention & torture before October (before Ben-Gvir): \n\nThis B'Tselem report needs to be complemented with the comprehensive June 2023 report by \n@FranceskAlbs\n on Israel's carceral system in the OPT:",
    "Weight": 8,
    "Id": 121
},
{
    "URL": "https://x.com/FranceskAlbs/status/1820747281139642856",
    "Date": "06/08/2024",
    "Text": "As the world watches thousands of athletes competing in the #Olympics, let’s remember the many Palestinian athletes who could not be there as Israel killed them in its genocidal campaign in #Gaza.",
    "Weight": 12,
    "Id": 122
},
{
    "URL": "https://x.com/ZiaLulli1/status/1819804159807303776",
    "Date": "03/08/2024",
    "Text": "Far raccontare l’#Iran dal corrispondente/inviato in #Israele, tendenza invalsa da troppo tempo in troppi giornali italiani, ha il medesimo rigore metodologico che avrebbe avuto, ai tempi della guerra fredda, raccontare gli USA da Mosca o la Russia da Washington. \nL’ho detta.",
    "Weight": 6,
    "Id": 123
},
{
    "URL": "https://x.com/SaulStaniforth/status/1819381938542477731",
    "Date": "02/08/2024",
    "Text": ".\n@dianabuttu\n: \"... the world tells us that nothing can justify October 7th and yet everything that Israel has done since October 7th can be justified by October 7th\"",
    "Weight": 19,
    "Id": 124
},
{
    "URL": "https://x.com/4noura/status/1819078089210843236",
    "Date": "01/08/2024",
    "Text": "Day 300. Its maddening and shameful we have not been able to end one of the grossest, most blatant colonial #genocides feat disease, poisoning of the earth, sexual assualt, torture, & advanced weapons. This will end & we cannot afford to lose the next battle over narrative (1/2)",
    "Weight": 5,
    "Id": 125
},
{
    "URL": "https://x.com/HediViterbo/status/1802674682681762274",
    "Date": "17/06/2024",
    "Text": "Israel's export of weapons has now reached an all-time high.\n\nThese weapons were tested on #Palestinians.\n\nSo, what do we know about Israeli arms export?\n\nA thread \n\n1/10\n\n#Palestine #Gaza #WestBank",
    "Weight": 28,
    "Id": 126
},
{
    "URL": "https://x.com/yarahawari/status/1817471961192108096",
    "Date": "28/07/2024",
    "Text": "Just a reminder for those who suddenly care about killed Arab children.\n\nThe Syrian Golan is occupied Syrian land and its people are an occupied people. \n\nThe freedom of the Palestinian people is intertwined with the freedom of the people of the Golan.",
    "Weight": 4,
    "Id": 127
},
{
    "URL": "https://x.com/francofontana43/status/1817078076318023767",
    "Date": "27/07/2024",
    "Text": "“L’Italia deve intervenire contro il genocidio a Gaza”\n(Altrimenti ne è complice)\nParla Abeer Odeh, ambasciatrice di Palestina in Italia\nUmberto De Giovannangeli, l’Unità",
    "Weight": 4,
    "Id": 128
},
{
    "URL": "https://x.com/visualizingpal/status/1816836845855993913",
    "Date": "26/07/2024",
    "Text": "1/ Fadi was held incommunicado for 30 days at Sde Teiman, Israel's torture camp. This is his testimony.\n\n#EnforcedDisappearance #StopTheGenocide #endtorture",
    "Weight": 9,
    "Id": 129
},
{
    "URL": "https://x.com/DoubleDownNews/status/1816898822561468742",
    "Date": "26/07/2024",
    "Text": "Holocaust Survivor Demolishes Israel",
    "Weight": 7,
    "Id": 130
},
{
    "URL": "https://x.com/FranceskAlbs/status/1816411819981828314",
    "Date": "25/07/2024",
    "Text": "The political élite of a country birthed from the genocide of an Indigenous people, celebrates the genocidaire of another Indigenous people. \n\n(That's what letting heinous crimes go unacknowleged & unpunished ultimately leads to).",
    "Weight": 7,
    "Id": 131
},
{
    "URL": "https://x.com/FranceskAlbs/status/1816406224285344107",
    "Date": "25/07/2024",
    "Text": "Solidarity (from the latin \"solidum\" : undivided, whole, togetherness) is what gives full meaning to Humanity. And it can only be true in action.\n\nStanding together against the genocide of the Palestinian people, fiercely and soulfully, is the moral imperative of Humanity.",
    "Weight": 9,
    "Id": 132
},
{
    "URL": "https://x.com/FranceskAlbs/status/1815513865226186969",
    "Date": "22/07/2024",
    "Text": "\"No toddler gets shot twice in the head by mistake\" (Dr Mark Perlmutter).\n\nIt is not accidental. It is genocide.",
    "Weight": 5,
    "Id": 133
},
{
    "URL": "https://x.com/FranceskAlbs/status/1815439282632290793",
    "Date": "22/07/2024",
    "Text": "Proven. Protracted #impunity generates insanity, not just unlawfulness. \n\nIsrael's disrespect and abuses  against the #UN should have been addressed long ago. This year, it has gone too far.\n#UNSeatIsrael.",
    "Weight": 8,
    "Id": 134
},
{
    "URL": "https://x.com/shanedarcy_/status/1815297936588152946",
    "Date": "22/07/2024",
    "Text": "Any interview of government officials concerning Israel/Palestine needs to start by asking how their State will meet the obligations arising from \"the unlawful presence of the State of Israel in the Occupied Palestinian Territory\" as set out in the  ICJ's Advisory Opinion:",
    "Weight": 16,
    "Id": 135
},
{
    "URL": "https://x.com/KenRoth/status/1814340568702435527",
    "Date": "19/07/2024",
    "Text": "The International Court of Justice confirms that Israel's settlements violate Art. 49 of the 4th Geneva Convention (prohibiting an occupiers population moving into occupied territory). They are war crimes. The International Criminal Court should also act.",
    "Weight": 16,
    "Id": 136
},
{
    "URL": "https://x.com/mehdirhasan/status/1814371624021323844",
    "Date": "19/07/2024",
    "Text": "They have emptied the word antisemitism of all meaning. Far right Israelis have cynically done more to damage the (important) struggle against antisemitism than anyone else. If the ICJ rulings are antisemitic, then what is not antisemitic? Everything antisemitic! https://x.com/Hannahmc_carth/Hannahmc_carthy/status/1814301976760312006…",
    "Weight": 26,
    "Id": 137
},
{
    "URL": "https://x.com/FranceskAlbs/status/1814494855826927655",
    "Date": "20/07/2024",
    "Text": "Genocide cannot go unanswered. Civil society continues to seek justice. In the US, and everywhere.",
    "Weight": 5,
    "Id": 138
},
{
    "URL": "https://x.com/FranceskAlbs/status/1814340392076099719",
    "Date": "19/07/2024",
    "Text": "Happening now. Reflections on the ICJ's AO on Palestine 2024.",
    "Weight": 4,
    "Id": 139
},
{
    "URL": "https://x.com/FranceskAlbs/status/1814291982618968430",
    "Date": "19/07/2024",
    "Text": "ICJ live on the illegality of Israel's occupation:\nhttps://webtv.un.org/en",
    "Weight": 9,
    "Id": 140
},
{
    "URL": "https://x.com/FranceskAlbs/status/1814247526910005654",
    "Date": "19/07/2024",
    "Text": "Israel is annihilating Palestinians with all means at its disposal and beyond.\nAnd the world looks, idle.\nMonstrous.",
    "Weight": 12,
    "Id": 141
},
{
    "URL": "https://x.com/FranceskAlbs/status/1814044975258038308",
    "Date": "18/07/2024",
    "Text": "Let me help France spell out \"all challenges\" (remise en cause) to a lasting peace between Palestinians and Israelis: ending the genocide in Gaza, the forced displacement of Palestinians and Israel's Apartheid regime.",
    "Weight": 40,
    "Id": 142
},
{
    "URL": "https://x.com/FranceskAlbs/status/1813863134236709193",
    "Date": "18/07/2024",
    "Text": "Time to #UNseatIsrael from the UN.",
    "Weight": 4,
    "Id": 143
},
{
    "URL": "https://x.com/FranceskAlbs/status/1813832994915840064",
    "Date": "18/07/2024",
    "Text": "Daniel Levy and Tony Karon on the  need for FIFA to suspend Israel.",
    "Weight": 4,
    "Id": 144
},
{
    "URL": "https://x.com/FRANCE24/status/1813245812719181884",
    "Date": "16/07/2024",
    "Text": "Tête à tête - War in Gaza 'one of most critical cases of genocide', UN rapporteur tells FRANCE 24\n https://go.france24.com/J6Q",
    "Weight": 9,
    "Id": 145
},
{
    "URL": "https://x.com/SaulStaniforth/status/1812741496367452268",
    "Date": "15/07/2024",
    "Text": "\"What we find is that a population that is being starved, genocided through modern means of warfare, with total impunity\"\n\n\n@FranceskAlbs\n on Israels justification for committing Saturdays massacre.",
    "Weight": 9,
    "Id": 146
},
{
    "URL": "https://x.com/MuntherIsaac/status/1812040360681439271",
    "Date": "13/07/2024",
    "Text": "How is this acceptable? Torture. Administrative detention. No charges. This is the brutality of life under the Israeli military rule",
    "Weight": 8,
    "Id": 147
},
{
    "URL": "https://x.com/PeruginiNic/status/1812383738078060782",
    "Date": "14/07/2024",
    "Text": "“There’s no place for violence in American political culture,” said the state which is shipping these heavy ammunitions to a settler colonial state that uses them to eliminate genocide survivors in their tents. (Video:Mawasi “humanitarian area” yesterday)",
    "Weight": 5,
    "Id": 148
},
{
    "URL": "https://x.com/FranceskAlbs/status/1812200727873261823",
    "Date": "13/07/2024",
    "Text": "And by the way: Israel's genocidal war in Gaza is so intense that another massacre of 20 civilians today, in a refugee camp (in Gaza City) received almost no media coverage given the much larger simultaneous massacre in al-Mawasi (now with a death toll of 90).\n#alshati\n#Mawasi",
    "Weight": 12,
    "Id": 149
},
{
    "URL": "https://x.com/amanpour/status/1812168861787058284",
    "Date": "13/07/2024",
    "Text": "An exclusive investigation from \n@CNN\n’s \n@katie_polglase\n reveals that former commanders of a controversial Israeli military unit - accused of heinous human rights violations against Palestinians - are now serving in senior positions in the IDF.",
    "Weight": 16,
    "Id": 150
},
{
    "URL": "https://x.com/UssamaMakdisi/status/1812151951594819978",
    "Date": "13/07/2024",
    "Text": "Remember that there was no Hamas when Israel first occupied the Gaza Strip in 1956 (don’t forget this war of aggression either) and then again in 1967.  No Hamas.  No Deif.  No Sinwar.  Just remember that because history matters.",
    "Weight": 16,
    "Id": 151
},
{
    "URL": "https://x.com/FranceskAlbs/status/1811768617341522227",
    "Date": "12/07/2024",
    "Text": "Looking forward to the \n@CIJ_ICJ\n's Opinion on the (il)legality of Israel's 57-year old occupation, to be delivered in a week.",
    "Weight": 9,
    "Id": 152
},
{
    "URL": "https://x.com/FranceskAlbs/status/1810994932808560950",
    "Date": "10/07/2024",
    "Text": "Yes. There is #famine across all of Gaza. This is the consequence of Israel's intentional #starvation, used as part of its genocidal campaign against the Palestinians.",
    "Weight": 16,
    "Id": 153
},
{
    "URL": "https://x.com/FranceskAlbs/status/1810296475584188496",
    "Date": "08/07/2024",
    "Text": "What does Israel do not want int'l journalists to see? How much uglier than so-far-told it is the genocide it has committed in Gaza.",
    "Weight": 13,
    "Id": 154
},
{
    "URL": "https://x.com/FranceskAlbs/status/1810261627125530922",
    "Date": "08/07/2024",
    "Text": "Thank you to the #PalestinianBarAssociation and \n@Law4Palestine\n for inviting me to this event and to such a wonderful panel.",
    "Weight": 8,
    "Id": 155
},
{
    "URL": "https://x.com/sarahleah1/status/1809927422168518912",
    "Date": "07/07/2024",
    "Text": "Starving people, bombarding civilians, torturing Palestinians in prisons-  stopping these Israeli crimes should never be subject to negotiation, any more than a murderer should negotiate how many more people he will kill before he stops.",
    "Weight": 18,
    "Id": 156
},
{
    "URL": "https://x.com/Mondoweiss/status/1809256056356298806",
    "Date": "05/07/2024",
    "Text": "Holocaust survivors say using the Holocaust to justify genocide in Gaza and repress student protest on college campuses is an insult to the Holocaust's memory.",
    "Weight": 18,
    "Id": 157
},
{
    "URL": "https://x.com/FranceskAlbs/status/1809897369837703396",
    "Date": "07/07/2024",
    "Text": "The fact that western media no longer talk about Israel's #GenocideinGaza and the oppression of Palestinians anywhere under Israeli rule, does not mean that genocide and oppression have stopped. It means they are being NORMALISED.\n#Humanity wake up!",
    "Weight": 34,
    "Id": 158
},
{
    "URL": "https://x.com/FranceskAlbs/status/1778911040748613794",
    "Date": "12/04/2024",
    "Text": "I urge the UN to authorize the deployment of a protective presence in the occupied Palestinian territory, with the explicit mandate to prevent & repe attacks against civilians. The Israeli army has abundantly proven unwilling or unable to ensure that task.",
    "Weight": 12,
    "Id": 159
},
{
    "URL": "https://x.com/FranceskAlbs/status/1809184006556049778",
    "Date": "05/07/2024",
    "Text": "Apologia di reato a testate (e reti) occidentali mainstream unificate. Per anni. \nQuesto, unitamente a relazioni politiche con Israele complici o ignave, ha favorito l'habitat in cui si è evoluta la violenza di quest'ultimo contro i Palestinesi, oggi divenuta genocida.",
    "Weight": 8,
    "Id": 160
},
{
    "URL": "https://x.com/AlMezanCenter/status/1808454643015413873",
    "Date": "03/07/2024",
    "Text": "This is what remains of the building housing Al Mezan's office in Jabaliya refugee camp. Despite the existential threats to us as Palestinians and as a human rights organization, we will not stop documenting and exposing Israel's genocide against the Palestinian people of #Gaza.",
    "Weight": 25,
    "Id": 161
},
{
    "URL": "https://x.com/FranceskAlbs/status/1808426536996888706",
    "Date": "03/07/2024",
    "Text": "\"Only a deep-seated dehumanization of Palestinians in Gaza would allow any Government to see  gravely injured children as a security threat and leaving them to die.\"\n\nGerman people, fellow Europeans, fellow humans -please, wake up.",
    "Weight": 12,
    "Id": 162
},
{
    "URL": "https://x.com/FranceskAlbs/status/1808224012105142493",
    "Date": "02/07/2024",
    "Text": "This perfectly sums up my life as a UN Independent Expert. \nIn my case, Palestinians—and those who stand in solidarity with them—know very well how hard it is to speak the truth in a world where those with power and privilege have chosen to live a lie.",
    "Weight": 8,
    "Id": 163
},
{
    "URL": "https://x.com/FranceskAlbs/status/1807355878963560813",
    "Date": "30/06/2024",
    "Text": "Even considering the significant political pressure on the #ICC, I really don't understand why the ICC Prosecutor has not yet requested an arrest warrant against this man, who is a key mastermind of Israel's genocidal policies against the Palestinians.",
    "Weight": 12,
    "Id": 164
},
{
    "URL": "https://x.com/FranceskAlbs/status/1806969113069154410",
    "Date": "29/06/2024",
    "Text": "Evento importante questa domenica a Roma. \n#ForGaza https://t.co/jHl9lPZRfA",
    "Weight": 4,
    "Id": 165
},
{
    "URL": "https://x.com/adequatehousing/status/1805662875970846870",
    "Date": "25/06/2024",
    "Text": "I welcome the ICC arrest warrants for Russian officials over alleged Ukraine warcrimes against civilian infrastructure like power plants. Now issue arrest warrants against Israeli officials for the same crimes!",
    "Weight": 12,
    "Id": 166
},
{
    "URL": "https://x.com/pchrgaza/status/1804160159532401126",
    "Date": "21/06/2024",
    "Text": "A heartbreaking testimony of a displaced Palestinian mother whose son was executed  by the Israeli forces in front of her eyes after being promised safety.\n\n#ceasefireNOW \n\n      #gaza ",
    "Weight": 16,
    "Id": 167
},
{
    "URL": "https://x.com/AssalRad/status/1804550730516517169",
    "Date": "22/06/2024",
    "Text": "Western media uses so many words to avoid saying obvious ones, like occupation, annex, apartheid, genocide.\n\nAlso, the West Bank has been under military occupation with expanding settlements for decades. Stealing Palestinian land is Israeli state policy, not a fringe movement.",
    "Weight": 27,
    "Id": 168
},
{
    "URL": "https://x.com/FranceskAlbs/status/1804978977209196847",
    "Date": "23/06/2024",
    "Text": "In #Germany, people are being punished for calling for an end to Israel's genocide in Gaza, which - bcs of its own unhealthly unprocessed historical burden - Germany stubbornly refuses to engage with.",
    "Weight": 13,
    "Id": 169
},
{
    "URL": "https://x.com/FranceskAlbs/status/1804642249973575958",
    "Date": "22/06/2024",
    "Text": "I wonder how those who have kept supporting Israel's genocide will feel the day the world will enter Gaza, and see with its own eyes the ghetto turned into extermination fields and mass graves. They may not feel anything as Palestinans are already not human to them.",
    "Weight": 13,
    "Id": 170
},
{
    "URL": "https://x.com/FranceskAlbs/status/1804243662299111909",
    "Date": "21/06/2024",
    "Text": "With the escalating atrocities unfolding in the occupied Palestinian territory, I am left questioning what happened to \n@ICRC\n / \n@ICRC_ilot\n and the UN Office on the Prevention of Genocide. Their mandate, voice and action is more needed than ever.",
    "Weight": 9,
    "Id": 171
},
{
    "URL": "https://x.com/HagaiElAd/status/1803425792359113085",
    "Date": "19/06/2024",
    "Text": "On one critical issue Netanyahu \"the protector\" didn't fail: he protected Israelis for years, with great skill, from the reality of the Palestinians. | https://haaretz.com/opinion/2024-06-19/ty-article-opinion/.premium/netanyahu-did-protect-israelis-from-the-reality-of-the-palestinians/00000190-2cbf-d701-a3d2-7cbf799f0000…",
    "Weight": 38,
    "Id": 172
},
{
    "URL": "https://x.com/FranceskAlbs/status/1803855698113057223",
    "Date": "20/06/2024",
    "Text": "Israel's \"humanitarian camouflage\" (i.e humanitarian gergon used to justify a military campaign that has turned intl humanitarian law on its head) is what allows Israel to continue its genocide in Gaza.",
    "Weight": 17,
    "Id": 173
},
{
    "URL": "https://x.com/4noura/status/1803504105710662069",
    "Date": "19/06/2024",
    "Text": "Chris Sidoti, member of the UN Commission of Inquiry, explains he doesn't have expertise in morality but does in international law, & according to his assessment, \"Israel is one of the most criminal [armies] in the world.\" Worthwhile watch.\n\nhttps://aljazeera.com/program/newsfeed/2024/6/19/the-israeli-army-is-one-of-the-most-criminal-in-the-world-says-un-expert…\n\n#Gaza #Nakba",
    "Weight": 16,
    "Id": 174
},
{
    "URL": "https://x.com/luigidaniele10/status/1801958421958213916",
    "Date": "15/06/2024",
    "Text": "The opposed (not double) standards of the G7 on Ukraine (annexation supreme offence) and Palestine (annexation not even mentionable) there is the sum of all the untenability of Western politics, dragging even the most basic, intransgressible universal prohibitions in its decline.",
    "Weight": 4,
    "Id": 175
},
{
    "URL": "https://x.com/FranceskAlbs/status/1801506575271502300",
    "Date": "14/06/2024",
    "Text": "Settler-colonialism is an insatiable beast. It can be defeated: through law enforcement. In the case of Israel, it keeps being fed: by impunity.",
    "Weight": 4,
    "Id": 176
},
{
    "URL": "https://x.com/BatoolJ8/status/1800980628852047888",
    "Date": "12/06/2024",
    "Text": "\"Gaza Is Not Occupied\" ~ Francesca Albanese DESTROYED NPC Talking Point https://youtube.com/shorts/9SEaS0alokU?si=caXGy9bz9P0uHc5A… via \n@YouTube",
    "Weight": 4,
    "Id": 177
},
{
    "URL": "https://x.com/Alonso_GD/status/1799809862005838319",
    "Date": "09/06/2024",
    "Text": "This is exactly how all indigenous people around the world were genocided https://x.com/WadeMiller_USM/WadeMiller_USMC/status/1799544459534778871…",
    "Weight": 5,
    "Id": 178
},
{
    "URL": "https://x.com/FranceskAlbs/status/1799120680711053453",
    "Date": "07/06/2024",
    "Text": "Israel has killed the highest number of UN personnel during the last assault in Gaza. The UN should launch an investigation on each of these deaths and ensure that family members receive reparation for their loss.",
    "Weight": 8,
    "Id": 179
},
{
    "URL": "https://x.com/philippa_bear/status/1798449294833492286",
    "Date": "05/06/2024",
    "Text": "This is Khan Younis today.  It still looks and feels as though an earthquake hit and then a tornado destroyed it. The destruction is overwhelming- commensurate to the needs of the civilians here trying to survive. #Gaza #CeasefireNOW",
    "Weight": 4,
    "Id": 180
},
{
    "URL": "https://x.com/FranceskAlbs/status/1798974348637688039",
    "Date": "07/06/2024",
    "Text": "So many options for the Palestinians and their righ to self-determination in the framework of the God-designed real-estate plan for Palestine.",
    "Weight": 12,
    "Id": 181
},
{
    "URL": "https://x.com/FranceskAlbs/status/1798738849071583458",
    "Date": "06/06/2024",
    "Text": "I salute #Spain's decision to join the case of #genocide against Israel at the \n@CIJ_ICJ\n. \nI remind all other countries still on the fence that it is not too late to move to the right side of history.",
    "Weight": 9,
    "Id": 182
},
{
    "URL": "https://x.com/nevegordon/status/1797240811936977374",
    "Date": "02/06/2024",
    "Text": "Israel student union has launched a campaign against academic staff who express sympathy with Palestinians. In this case against Dr Anat Matar from TAU who mourned her friend Walid Daqqa.",
    "Weight": 12,
    "Id": 183
},
{
    "URL": "https://x.com/nevegordon/status/1795427455966261590",
    "Date": "28/05/2024",
    "Text": "Naveh Dromi, a former student of mine, and currently an Israeli influencer celebrating Israel's burning of Palestinian children in Rafah.",
    "Weight": 18,
    "Id": 184
},
{
    "URL": "https://x.com/michelegiorgio2/status/1795406785425096972",
    "Date": "28/05/2024",
    "Text": "PODCAST GAZA. Andrea De Domenico, capo dell’Ufficio di Coordinamento degli affari umanitari dell’ONU (OCHA) nei Territori palestinesi Occupati, ci ha parlato da Gaza dell’attacco israeliano al campo rifugiati di Rafah.",
    "Weight": 22,
    "Id": 185
},
{
    "URL": "https://x.com/4noura/status/1795485628848628064",
    "Date": "28/05/2024",
    "Text": "Babies felt their skin melt off before asphyxiating, yet US media asks about how Zionists feel. This isnt about \n@NewsHour\n but about the pervasive racial logic that devalues Palestinian life. \n\n#Gaza #Genocide #Nakba #Zionism #Rafah #Palestinian #Liberation",
    "Weight": 29,
    "Id": 186
},
{
    "URL": "https://x.com/OmarBaddar/status/1794919572426084559",
    "Date": "27/05/2024",
    "Text": "His family survived the Holocaust.\nHe founded Human Rights Watch.\nHe directed the ACLU.\n\nNow he’s saying Israel is engaged in genocide against Palestinians in Gaza.\n\nExcellent CNN interview:",
    "Weight": 24,
    "Id": 187
},
{
    "URL": "https://x.com/FranceskAlbs/status/1794815498443796868",
    "Date": "26/05/2024",
    "Text": "I had just started writing on the dubious lawfulness of the US-built Gaza Pier....\n#Karma",
    "Weight": 4,
    "Id": 188
},
{
    "URL": "https://x.com/FranceskAlbs/status/1794750910297706773",
    "Date": "26/05/2024",
    "Text": "Genocide is a process, with a tragically collective dimension. In order to happen, genocide must be supported by the majority of a society, indoctrinated to dehumanise the Other against which genocide is committed.",
    "Weight": 15,
    "Id": 189
},
{
    "URL": "https://x.com/weizman_eyal/status/1794381164654039270",
    "Date": "25/05/2024",
    "Text": "Our report annexed to the South African submission to the \n@CIJ_ICJ\n on 20 May. The court ordered immediate cessation of military activity in Rafah and other provisions.",
    "Weight": 2,
    "Id": 190
},
{
    "URL": "https://x.com/FranceskAlbs/status/1794475336412860710",
    "Date": "25/05/2024",
    "Text": "Insult on injury.\nThe #US will have to go through full introspection, internal and external scrutiny over the disaster it has contributed to create in Gaza.",
    "Weight": 4,
    "Id": 191
},
{
    "URL": "https://x.com/ilmanifesto/status/1793945032942059696",
    "Date": "24/05/2024",
    "Text": "L’abuso in diretta su TikTok: «E ora denunciateci all’Aja»\n\nL'autonarrazione social dei soldati israeliani: furti nelle case, bandiere e moschee profanate, derisione dei palestinesi. E crimini di guerra\n\n\n@captblicero",
    "Weight": 12,
    "Id": 192
},
{
    "URL": "https://x.com/EmpireFiles/status/1793701503460688342",
    "Date": "23/05/2024",
    "Text": "NEW  // “Suspended Between Hope & the Abyss”\n\nWatch \n@AbbyMartin\n’s interview with UN Special Rapporteur on Palestine \n@FranceskAlbs\n on her report on Gaza genocide, the ICC arrest warrants, US threats to invade The Hague & more ::",
    "Weight": 13,
    "Id": 193
},
{
    "URL": "https://x.com/NimerSultany/status/1788859832302215651",
    "Date": "10/05/2024",
    "Text": "CNN finally sheds light on Israel's shocking and barbaric torture chambers: thousands of people, detained for months:\n\nStrapped down, blindfolded, held in diapers: Israeli whistleblowers detail abuse of Palestinians in shadowy detention center",
    "Weight": 20,
    "Id": 194
},
{
    "URL": "https://x.com/luigidaniele10/status/1793189775282667636",
    "Date": "22/05/2024",
    "Text": "Thanks \n@ajplus\n for this space.\n\nThere is no way imo to diminish the epochal earthquake this arrest warrants request marks.\n\nIsrael's impunity has been the cornerstone & most blatant manifestation of an entire system of Western suprematisms ruling the world.\n\nNo more (finally)!",
    "Weight": 4,
    "Id": 195
},
{
    "URL": "https://x.com/luigidaniele10/status/1792572889486487616",
    "Date": "20/05/2024",
    "Text": "Thanks \n@AJEnglish\n for these Qs.\n\nEnd of an era: the era of Israel above the law (with Raz Segal we called it 'twilight of Israel exceptionalism'), end of the age of Israel's impunity, & first ICC int'l crimes charges for Western & allies leaders (as \n@MsJamshidi\n notes) \n\n1/",
    "Weight": 14,
    "Id": 196
},
{
    "URL": "https://x.com/timand2037/status/1792287671374540891",
    "Date": "19/05/2024",
    "Text": "UN expert \n@FranceskAlbs\n - western media have manipulated language to build an unprecedented, sanitised cocoon around the #Israeli regime, to obstruct accountability.",
    "Weight": 8,
    "Id": 197
},
{
    "URL": "https://x.com/AbujomaaGaza/status/1791468350884733094",
    "Date": "17/05/2024",
    "Text": "I used to see him carrying water fir his family.. He was KILLED on Thursday..\n\nJust a week ago, his two little brothers were KILLED in #Israeli_drone_attack while carrying water bottles and jars!",
    "Weight": 8,
    "Id": 198
},
{
    "URL": "https://x.com/sfardm/status/1791408346836205776",
    "Date": "17/05/2024",
    "Text": "Deputi AG of Israel, Gil-ad Noam.  Give me your hand and take me with you!  Take me to this amazing justice system you told the judges in The Hague you are a part of.  A legal systen in which they take seriously, evaluate and learn lessons from UN reports;  where there >>",
    "Weight": 4,
    "Id": 199
},
{
    "URL": "https://x.com/sarahleah1/status/1790811497712549987",
    "Date": "15/05/2024",
    "Text": "“The Israelis will have to come to terms with what they have done to the Palestinians,” \n@FranceskAlbs\n tells \n@Omid_M\n. “I don't think that they realize it yet.” She spoke to \n@DAWN_Journal\n about genocide in Gaza and the lack of humanity for Palestinians:",
    "Weight": 36,
    "Id": 200
},
{
    "URL": "https://x.com/FranceskAlbs/status/1791000519919452341",
    "Date": "16/05/2024",
    "Text": "A new report, from a network of distinguished #US universities, adds to the mounting pile of analyses & evidence that Israel has committed the crime of #genocide in Gaza, implicating others as accomplices.",
    "Weight": 13,
    "Id": 201
},
{
    "URL": "https://x.com/ZahiraJaser/status/1790640959459373372",
    "Date": "15/05/2024",
    "Text": "Today is the day in which we commemorate the Nakba (ذكرى النكبة), the ethnic cleansing of Palestinians from their indigenous land. The Nakba is both an historical event AND it is ongoing today, in Gaza, the West Bank and East Jerusalem. Here is a good book to read:",
    "Weight": 12,
    "Id": 202
},
{
    "URL": "https://x.com/FranceskAlbs/status/1790849948503715971",
    "Date": "15/05/2024",
    "Text": "The \n@US\n administration's straight-faced denial that Israel uses US weapons in violation of Int'l Law is bewildering. Unless they think that razing cities to the  ground & indiscriminately killing civilians is in line with Int'l Law.",
    "Weight": 4,
    "Id": 203
},
{
    "URL": "https://x.com/FranceskAlbs/status/1790036125614035093",
    "Date": "13/05/2024",
    "Text": "Israel has not only killed, maimed and traumatized Palestinians in Gaza. It has created (a set of) conditions calculated to bring about the destruction of Gaza.",
    "Weight": 20,
    "Id": 204
},
{
    "URL": "https://x.com/FranceskAlbs/status/1789927864315314282",
    "Date": "13/05/2024",
    "Text": "It is mportant that world-leading academic institutions like #Edinburgh heed principled calls from faculty and students to respect Int'l Law, especially in times of genocide. \n#BalfourUniversity",
    "Weight": 5,
    "Id": 205
},
{
    "URL": "https://x.com/Avivir/status/1789541534746005946",
    "Date": "12/05/2024",
    "Text": "Francesca Albanese: “En los países occidentales hay una reticencia para hablar de genocidio en el contexto de Gaza”\n\nLa relatora de la ONU para Palestina presentó un informe sobre la intención genocida de Israel en Gaza, que será juzgado en los tribunales",
    "Weight": 12,
    "Id": 206
},
{
    "URL": "https://x.com/FranceskAlbs/status/1789567505259757765",
    "Date": "12/05/2024",
    "Text": "\"On #MotherDay I ask all mothers to imagine that this was you\".\n#StopGenocideInGaza - #Rafah",
    "Weight": 11,
    "Id": 207
},
{
    "URL": "https://x.com/FranceskAlbs/status/1788693381444464936",
    "Date": "09/05/2024",
    "Text": "Congratulations \n@wizardbisan\n, on your powerful voice, and to all the truth-tellers in Gaza who deserve to celebrate this award with you - despite the immense pain who has befallen Gaza.",
    "Weight": 8,
    "Id": 208
},
{
    "URL": "https://x.com/martinshawx/status/1788266043137466638",
    "Date": "08/05/2024",
    "Text": "That’s correct. As \n@dirkmoses\n argues, the problem is that perpetrators see their targets as a future threat and aim for ‘permanent security’. For Israel, that’s all Palestinians, even children. And crippling their society works, as well as mass murder.",
    "Weight": 12,
    "Id": 209
},
{
    "URL": "https://x.com/YehudaShaul/status/1787400142385004748",
    "Date": "06/05/2024",
    "Text": "A small group of Holocaust survivors and some second-generation demonstrated outside Yad Vashem this morning. \n\n\"If we loose our compassion for the Other, we have lost our Humanity\" - let this be a lesson we learn from the Holocaust and its survivors.",
    "Weight": 6,
    "Id": 210
},
{
    "URL": "https://x.com/FranceskAlbs/status/1787548116553531505",
    "Date": "06/05/2024",
    "Text": "The \"humanitarian camouflage\" that I denounced in my last report #AnatomyofGenocide - i.e. Israel's using IHL jargon to justify its otherwise unlawful military conduct - continues unabated.",
    "Weight": 9,
    "Id": 211
},
{
    "URL": "https://x.com/FranceskAlbs/status/1787385312424968505",
    "Date": "06/05/2024",
    "Text": "What I have seen \"rejected\" by Israel & stored in warehouses in northern Sinai is not just critical supplies for survival in Gaza; it is the solidarity of so many people in the world, from Brazil, France, Kuwait and Singapore, to mention a few. \nMore in my next report.",
    "Weight": 8,
    "Id": 212
},
{
    "URL": "https://x.com/TonyKaron/status/1787171262202019932",
    "Date": "05/05/2024",
    "Text": "Israel's ban of Al Jazeera is 2nd time I've been part of a media organization banned by an apartheid regime. (1st was SA ‘88) I'm so proud of that! It's a sign of panic by those regimes at the their crimes being exposed, a whiff of the rot at the heart of their systems...",
    "Weight": 6,
    "Id": 213
},
{
    "URL": "https://x.com/mehdirhasan/status/1786773944269234628",
    "Date": "04/05/2024",
    "Text": "The No. 1 pro-Israel online talking point - ‘Hamas agrees to release the hostages & the war ends tomorrow!’ - destroyed by a single quote from an Israeli official:\n\n\"Israel will under no circumstances agree to end the war in a deal to release the hostages\"",
    "Weight": 25,
    "Id": 214
},
{
    "URL": "https://x.com/FranceskAlbs/status/1786411852882157681",
    "Date": "03/05/2024",
    "Text": "Honored to be invited by the \n@LemkinInstitute\n to discuss my last report to the \n@UN_HRC\n. Could not think of a better title to talk about the monstruosity that is taking place in Gaza, under our watch, and which risks to spread to the rest of the occupied Palestinian territory.",
    "Weight": 8,
    "Id": 215
},
{
    "URL": "https://x.com/PeruginiNic/status/1786308376168665581",
    "Date": "03/05/2024",
    "Text": "Flour massacres and the destruction of Gaza medical facilities serving dispossessed Palestinians by the Israeli military have a long [Nakba] history. This is the\n\n@ICRC\n reporting the Israeli bombardment of refugees waiting for flour (30 killed) and a policlinic (1 killed) in 1949",
    "Weight": 28,
    "Id": 216
},
{
    "URL": "https://x.com/DrMQureshi/status/1786328824688312359",
    "Date": "03/05/2024",
    "Text": "We asked \n@FranceskAlbs\n some tough questions in this interview. Her response: \"The legitimacy of the ICC needs Palestine almost more than Palestine needs the ICC\". \n#TheWatermelonReports\nFull interview here: https://youtube.com/watch?v=s7ldoX07zM4&t=1419s…",
    "Weight": 8,
    "Id": 217
},
{
    "URL": "https://x.com/FranceskAlbs/status/1786053051020624047",
    "Date": "02/05/2024",
    "Text": "Most of the survivors of the Gaza #genocideI I have met in the past months possess a carachteristic that defies description. Hala vividly personifies that ineffable trait, which the word \"chronic trauma\" vaguely captures.",
    "Weight": 9,
    "Id": 218
},
{
    "URL": "https://x.com/hahauenstein/status/1784378793999605780",
    "Date": "28/04/2024",
    "Text": "Disturbing police violence at the Gaza camp, reminiscent of 'Ordnungspolizei' tactics, targeting a group incl. Palestinians, migrants, and Jews. A violence that reflects, if anything, a sense of helplessness and utter disorientation. Things are changing and they are so damn lost",
    "Weight": 16,
    "Id": 219
},
{
    "URL": "https://x.com/Alonso_GD/status/1784538347181875683",
    "Date": "28/04/2024",
    "Text": "Hmmm I wonder why. What possible thing could the Irish have gone through that would make them have solidarity for Palestine? Hmmm this is a tricky one! \n(#sarcasm)",
    "Weight": 4,
    "Id": 220
},
{
    "URL": "https://x.com/fanpage/status/1784107711510315211",
    "Date": "27/04/2024",
    "Text": "“Assalto a Rafah sarà un altro massacro, Israele non vuole testimoni”\n\nLa relatrice dell’ONU per i diritti umani in Palestina, Francesca Albanese, ha raccolto testimonianze di pazienti evacuati da Gaza e di medici che hanno prestato soccorso ",
    "Weight": 10,
    "Id": 221
},
{
    "URL": "https://x.com/PeruginiNic/status/1784174124853506286",
    "Date": "27/04/2024",
    "Text": "This is an explicit policy which goes beyond a limited number of airstrikes. Check this passage from UN Special Rapporteur \n@FranceskAlbs\n's recent report \"Anatomy of a genocide\" in the section on the safe zones and evacuations as \"humanitarian camouflage\"   ",
    "Weight": 5,
    "Id": 222
},
{
    "URL": "https://x.com/FranceskAlbs/status/1783899181049868475",
    "Date": "26/04/2024",
    "Text": "APR Report by \n@CanArabLaw\n : https://static1.squarespace.com/static/61db30d12e169a5c45950345/t/627dcf83fa17ad41ff217964/1652412292220/Anti-Palestinian+Racism-+Naming%2C+Framing+and+Manifestations.pdf…",
    "Weight": 4,
    "Id": 223
},
{
    "URL": "https://x.com/FranceskAlbs/status/1783486879758766548",
    "Date": "25/04/2024",
    "Text": "Professor Amos Goldberg is not just an incredible historian. I strongly recommend the book #TheHolocaustAndTheNakba that he edited with Dr Bashir Bashir. \nMy encounter with him has been a gift of enlightenment and hope.\n\n#FriendsWithoutBorders.",
    "Weight": 3,
    "Id": 224
},
{
    "URL": "https://x.com/NLGnews/status/1783162674982904100",
    "Date": "24/04/2024",
    "Text": "Join the NLG and \n@NLGIC\n's Palestine Sub-committee, as we host an in-depth conversation with Francesca Albanese, a Special Rapporteur to Palestine, on her report \"Anatomy of a Genocide\".\n\nSign-up, and get more information at : https://bit.ly/gazanlg\n\n#FreePalestine #Gaza",
    "Weight": 25,
    "Id": 225
},
{
    "URL": "https://x.com/FranceskAlbs/status/1782454497475760196",
    "Date": "22/04/2024",
    "Text": "The Arab region has an important role to play in the defense of  Palestinians who are being genocided in Gaza and ethnically cleansed all over the occupied Palestinian territory. May solidarity and international law prevail.",
    "Weight": 21,
    "Id": 226
},
{
    "URL": "https://x.com/FranceskAlbs/status/1782401322932731968",
    "Date": "22/04/2024",
    "Text": "Shocking to see how commonly and nonchalantly the genocidal logic behind Israel's assault on Gaza is referred to as necessary and unavoidable, in certain milieux.",
    "Weight": 8,
    "Id": 227
},
{
    "URL": "https://x.com/profbensaul/status/1781443635835556107",
    "Date": "19/04/2024",
    "Text": "My latest piece: \"The tail-spin of violence between Israel and Iran is a bitter lesson on what happens when we let the law of the jungle smother the rule of law\" https://smh.com.au/world/middle-east/israel-and-iran-are-following-the-rules-of-the-jungle-not-the-rule-of-law-20240419-p5fl7p.html…",
    "Weight": 12,
    "Id": 228
},
{
    "URL": "https://x.com/FranceskAlbs/status/1781441579795804642",
    "Date": "19/04/2024",
    "Text": "In solidarity with Professor Shalhoub-Kevorkian, who was arrested by Israeli police in occupied east Jerusalem.",
    "Weight": 8,
    "Id": 229
},
{
    "URL": "https://x.com/FranceskAlbs/status/1781078298270822891",
    "Date": "18/04/2024",
    "Text": "Il razzismo è una violazione gravissima del diritto internazionale. Additare \"un palestinese\" come di per sè sospetto o pericoloso è espressione di razzismo antipalestinese.\nConoscere per capire e riconoscere. \nE poi adire le vie legali.",
    "Weight": 10,
    "Id": 230
},
{
    "URL": "https://x.com/SaulStaniforth/status/1780844348810088621",
    "Date": "18/04/2024",
    "Text": "Israel has killed over 14,000 children. Murdered journalists. Attacked hospitals. Shot civilians holding up white flags. Bombed ambulances. Used starvation as a weapon of war\n\nThe EU: \"We have decided to put in place sanctions against Iran\"",
    "Weight": 6,
    "Id": 231
},
{
    "URL": "https://x.com/OmarSShakir/status/1780576064109945068",
    "Date": "17/04/2024",
    "Text": "With world's attention on Gaza, Israeli settlers & soldiers are literally wiping Palestinian communities off the map. Palestinians displaced from 20 communities—at least 7 entirely uprooted. Large areas of the West Bank depopulated of Palestinians in just months. New \n@hrw\n report.",
    "Weight": 32,
    "Id": 232
},
{
    "URL": "https://x.com/FranceskAlbs/status/1780634011133530469",
    "Date": "17/04/2024",
    "Text": "I wonder if any of these ambassadors insisted on their need to visit Gaza to verify the conditions of the land and the people. Foreign correspondents also must be allowed into Gaza.",
    "Weight": 8,
    "Id": 233
},
{
    "URL": "https://x.com/FranceskAlbs/status/1780220855726829670",
    "Date": "16/04/2024",
    "Text": "\"I’m an Israeli academic. My community is still too silent about the war in Gaza.\" (cit LM)\n\nAnd about the genocide in Gaza. And about the ethnic cleansing of Palestinians.",
    "Weight": 29,
    "Id": 234
},
{
    "URL": "https://x.com/FranceskAlbs/status/1779894959568498993",
    "Date": "15/04/2024",
    "Text": "Preparing to go to 'the region'. First stop, Jordan. \nI continue to seek access to the occupied Palestinian territory, in line with my UN mandate and procedures.",
    "Weight": 4,
    "Id": 235
},
{
    "URL": "https://x.com/fadiquran/status/1779416796157616340",
    "Date": "14/04/2024",
    "Text": "Reminder: For the last four months the people in northern Gaza have on average only had 245 calories a day due to Israel’s starvation tactics, which are still ongoing. \n\nImage 1 shows what 245 calories look like, and Image 2 shows what that does to a child. \n\nAll eyes on Gaza.",
    "Weight": 12,
    "Id": 236
},
{
    "URL": "https://x.com/democracynow/status/1779179489055957023",
    "Date": "13/04/2024",
    "Text": "Children in Gaza are like \"ghosts,\" says journalist \n@IamArwaDamon\n. \"They’re ghosts of their past. They’re the ghosts of who they used to be. And they’re constantly haunted by the ghosts of everything that they have lost.\"",
    "Weight": 4,
    "Id": 237
},
{
    "URL": "https://x.com/PeruginiNic/status/1778342374902579220",
    "Date": "11/04/2024",
    "Text": "In Journal of \n@PalStudies\n, \n@nevegordon\n and I analyse the emergence and circulation of \"medical lawfare\" —Israel's discourse of legitimization of its attacks on lifesaving and sustaining infrastructures, from 2007 until the ongoing genocide in Gaza https://tandfonline.com/doi/full/10.1080/0377919X.2024.2330366…",
    "Weight": 13,
    "Id": 238
},
{
    "URL": "https://x.com/FranceskAlbs/status/1778354799664128135",
    "Date": "11/04/2024",
    "Text": "It takes generations to recover from a genocide. For many survivors, the beloved ones who could help heal the wounds, are either gone or broken.",
    "Weight": 5,
    "Id": 239
},
{
    "URL": "https://x.com/FranceskAlbs/status/1778183981437165828",
    "Date": "10/04/2024",
    "Text": "EU should suspend its Association Agreement with Israel with immediate effect, because of serious violations of international law. \n\nhttps://telesurenglish.net/news/UN-Rapporteur-Calls-on-European-Union-to-Stop-Genocide-in-Gaza-20240410-0008.html?s=09…",
    "Weight": 13,
    "Id": 240
},
{
    "URL": "https://x.com/FranceskAlbs/status/1778180334456361321",
    "Date": "10/04/2024",
    "Text": "Like in 1948.\nLike in 1967.\nSo in 2023\\2024.\nUnder the fog of war Israel creates conditions for significant and sudden instances of ethnic cleansing.",
    "Weight": 4,
    "Id": 241
},
{
    "URL": "https://x.com/FranceskAlbs/status/1778179478759391572",
    "Date": "10/04/2024",
    "Text": "Genocide can be committed through patterns of conduct that, at the microscope, appear as war crimes.",
    "Weight": 17,
    "Id": 242
},
{
    "URL": "https://x.com/OmarSShakir/status/1778087747456024886",
    "Date": "10/04/2024",
    "Text": "Let’s be clear: Relatives of combatants that are not involved in the fighting are civilians. Even political leaders—if uninvolved in military ops—are not legitimate targets under laws of war. Deliberate attacks on civilians are heinous war crimes that have no justification. Ever.",
    "Weight": 12,
    "Id": 243
},
{
    "URL": "https://x.com/DionNissenbaum/status/1778050214772801647",
    "Date": "10/04/2024",
    "Text": "1/The Fog of War: Beheaded Babies.\nSix months ago today, a series of reputable news outlets published reports that Hamas militants had beheaded babies at the Kfar Aza kibbutz on Oct. 7 in southern Israel. The \n@WSJ\n was not one of them.",
    "Weight": 8,
    "Id": 244
},
{
    "URL": "https://x.com/pbi_es/status/1778009792688119809",
    "Date": "10/04/2024",
    "Text": "La relatora especial de la ONU para los territorios palestinos ocupados, Francesca Albanese, ha reclamado este miércoles en el Parlamento Europeo que la Unión Europea suspenda el acuerdo de asociación con Israel en respuesta al \"genocidio\" en Gaza",
    "Weight": 8,
    "Id": 245
},
{
    "URL": "https://x.com/MiddleEastEye/status/1778030209742041432",
    "Date": "10/04/2024",
    "Text": "\"The bold, brilliant and thoroughly researched report Albanese recently issued, aptly titled 'Anatomy of a Genocide', has inspired much admiration around the globe for her tireless work, but also horror and fury among Zionists\"\n\n Opinion by Hamid Dabashi",
    "Weight": 15,
    "Id": 246
},
{
    "URL": "https://x.com/FranceskAlbs/status/1777681253568811127",
    "Date": "09/04/2024",
    "Text": "Merci Raffaëlle Maison et \n@OrientXXI\n pour cette analyse, offrant une synthèse efficace de mon rapport «Anatomie d’un génocide» sur la situation à Gaza.",
    "Weight": 4,
    "Id": 247
},
{
    "URL": "https://x.com/FranceskAlbs/status/1777661405182742553",
    "Date": "09/04/2024",
    "Text": "Honored to be speaking at the European Parliament today, and present my 'Anatomy of a Genocide' report. Grateful to both hosts and guests.",
    "Weight": 5,
    "Id": 248
},
{
    "URL": "https://x.com/rohantalbot/status/1777061128603889828",
    "Date": "07/04/2024",
    "Text": "I cannot underscore enough how important \n@FranceskAlbs\n's analysis on Israel's sophisticated \"humanitarian camouflage\" for it's genocide in Gaza is. It's how states like the UK and the US justify their own complicity, endangering the very law itself. It must be wholly rejected.",
    "Weight": 13,
    "Id": 249
},
{
    "URL": "https://x.com/hzomlot/status/1776915031419937066",
    "Date": "07/04/2024",
    "Text": "Israeli doctor says detained Palestinians are undergoing ‘routine’ amputations for handcuff injuries, Haaretz reports | CNN",
    "Weight": 16,
    "Id": 250
},
{
    "URL": "https://x.com/FranceskAlbs/status/1776939348023296215",
    "Date": "07/04/2024",
    "Text": "\"Medical Shileding\"  has been the backbone of Israel's genocidal violence in Gaza- see paras 87-92 of my report \"Anatomy of a Genocide: https://ohchr.org/sites/default/files/documents/hrbodies/hrcouncil/sessions-regular/session55/advance-versions/a-hrc-55-73-auv.pdf….",
    "Weight": 13,
    "Id": 251
},
{
    "URL": "https://x.com/ASE/status/1776609859674181720",
    "Date": "06/04/2024",
    "Text": "“Every time I get falsely accused of anti-semitism, I respond. I don’t stay quiet. I don’t get intimidated. I get louder and louder, and by doing so, I think I also inspire other people to do the same!”\n\n— \n@FranceskAlbs\n (echoed by \n@kwbogen\n)",
    "Weight": 3,
    "Id": 252
},
{
    "URL": "https://x.com/NimerSultany/status/1776382984083456421",
    "Date": "05/04/2024",
    "Text": "Colombia argues that the ICJ needs to take note of UN reports like \n@FranceskAlbs\n's report on Genocide and \"give special probative status\" to them",
    "Weight": 5,
    "Id": 253
},
{
    "URL": "https://x.com/FranceskAlbs/status/1776593687230677049",
    "Date": "06/04/2024",
    "Text": "What about the investigation of the 33,000+ Palestinians, including 13,000+ children, that you have killed in the past six months?",
    "Weight": 8,
    "Id": 254
},
{
    "URL": "https://x.com/FranceskAlbs/status/1776231257090703402",
    "Date": "05/04/2024",
    "Text": "This new \n@WorldBank\n -#UN report shows that the estimates of the Gaza destruction used in my \"Anatomy of a genocide\" report were conservative. \n\nThe report exposes a level of erasure of a society that is unprecedented in our time:",
    "Weight": 9,
    "Id": 255
},
{
    "URL": "https://x.com/Alonso_GD/status/1775664315267223795",
    "Date": "03/04/2024",
    "Text": "It does not seem wrong. It is wrong. It proves the original point that Palestinians are not seen as human or equal by the West",
    "Weight": 8,
    "Id": 256
},
{
    "URL": "https://x.com/FranceskAlbs/status/1775260956056277307",
    "Date": "02/04/2024",
    "Text": "6. Selected recommendations:\n- Arms embargo on Israel & sanctions;\n-Support South Africa's resort to UNSC under UN Charter art 94(2);\n- investigation & prosecution;\n- establishment of register of damage;\n- reconstitute UN Spec Cttee agst Apartheid;\n- protective presence in oPt.",
    "Weight": 4,
    "Id": 257
},
{
    "URL": "https://x.com/FranceskAlbs/status/1775260948821053483",
    "Date": "02/04/2024",
    "Text": "3. “By deliberately redefining the categories of human shields, evacuation orders, safe zones, collateral damage and medical protection, Israel has used their protective functions as ‘humanitarian camouflage’ to conceal its genocidal campaign,” she said.",
    "Weight": 4,
    "Id": 258
},
{
    "URL": "https://x.com/FranceskAlbs/status/1775260951266418897",
    "Date": "02/04/2024",
    "Text": "4. “Israel’s genocide of Palestinians in Gaza is an escalatory stage of a long-standing settler colonial process of erasure.”",
    "Weight": 21,
    "Id": 259
},
{
    "URL": "https://x.com/FranceskAlbs/status/1775260943825727586",
    "Date": "02/04/2024",
    "Text": "THREAD: \n1. Anatomy of a genocide sketched out.",
    "Weight": 5,
    "Id": 260
},
{
    "URL": "https://x.com/FranceskAlbs/status/1775260946338099520",
    "Date": "02/04/2024",
    "Text": "2. \"Israel's executive and military leadership and soldiers have intentionally distorted foundational rules of international humanitarian law - distinction, proportionality and precaution - in an attempt to legitimise genocidal violence against the Palestinian people.\"",
    "Weight": 8,
    "Id": 261
},
{
    "URL": "https://x.com/FranceskAlbs/status/1775243387043471706",
    "Date": "02/04/2024",
    "Text": "Knowing how Israel operates,my assessment is that Israeli forces intentionally killed #WCK workers so that donors would pull out & civilians in Gaza could continue to be starved quietly.Israel knows Western countries & most Arab countries won't move a finger for the Palestinians.",
    "Weight": 28,
    "Id": 262
},
{
    "URL": "https://x.com/UN_SPExperts/status/1775139192231608322",
    "Date": "02/04/2024",
    "Text": "#Gaza: \"The incalculable collective trauma will be experienced for generations to come,\" - \n@FranceskAlbs\n calls on States to fulfil their obligations under the Genocide Convention to prevent further loss of life.\n\nhttps://ohchr.org/en/press-releases/2024/03/states-must-adhere-obligations-under-genocide-convention-prevent-further…  #HRC55",
    "Weight": 14,
    "Id": 263
},
{
    "URL": "https://x.com/FranceskAlbs/status/1775104162818072830",
    "Date": "02/04/2024",
    "Text": "On the day Israel bombed a foreign embassy in a third country,  it also killed \n@WCKitchen\n humanitarian workers. Israel is crossing every possible red line, still with full impunity.\nSanctions now.\nIndictements now.",
    "Weight": 8,
    "Id": 264
},
{
    "URL": "https://x.com/FranceskAlbs/status/1774896800295440773",
    "Date": "01/04/2024",
    "Text": "I hoped my \"anatomy of a genocide\" report to the \n@UN_HRC\n would be a wake-up call for States who are aiding/abetting Israel's genocide in Gaza. Instead,despite several UNGA res +one UNSC res ordering a ceasefire, & \n@CIJ_ICJ\n provisional measures, this genocide seems unstoppable.",
    "Weight": 23,
    "Id": 265
},
{
    "URL": "https://x.com/FranceskAlbs/status/1774896054007194076",
    "Date": "01/04/2024",
    "Text": "What a useful thread capturing 31 years of work of eight Special Rapporteurs on the occupied Palestinian territory.\nThree decades of Cassandra prophecies, one would conclude looking at the region today.",
    "Weight": 4,
    "Id": 266
},
{
    "URL": "https://x.com/FranceskAlbs/status/1774888257148403961",
    "Date": "01/04/2024",
    "Text": "Is \"battle-tested\" a cynical euphemism for \"genocide-tested\"?\nNo one should trade with a country that commits (or with corporations that may partake in) atrocity crimes. \nAt this time, this may violate the Genocide Convention.",
    "Weight": 12,
    "Id": 267
},
{
    "URL": "https://x.com/BCanossi/status/1774750073714311473",
    "Date": "01/04/2024",
    "Text": "We are witnessing from the comfort of our houses a live streamed erasure of a population from their lands, from earth itself. We can’t look back tomorrow condemning this as history, this MUST STOP NOW, WE MUST ACT NOW #FreeGaza #FreePalestine #SaveGaza ",
    "Weight": 12,
    "Id": 268
},
{
    "URL": "https://x.com/FranceskAlbs/status/1774839407448666134",
    "Date": "01/04/2024",
    "Text": "\"Medical Shielding\" is part of Israel's genocidal techniques in Gaza. \nThe context is fully explained in my last report, #AnatomyofGenocide.",
    "Weight": 13,
    "Id": 269
},
{
    "URL": "https://x.com/FranceskAlbs/status/1774829967336939773",
    "Date": "01/04/2024",
    "Text": "Criminalizing the cry for freedom and equal rights of an entire people, instead of stopping their genocide, is the sign of profound political bankrupcy.",
    "Weight": 5,
    "Id": 270
},
{
    "URL": "https://x.com/FranceskAlbs/status/1774818999643095424",
    "Date": "01/04/2024",
    "Text": "A true honor to speak to \n@mehdirhasan\n and his audience on the newly launched \n@zeteo_news\n. I wish the occasion had been less painful.\n\n#AnatomyofGenocide\n#StopGenocideInGazaNow\n#CEASEFIRE_NOW",
    "Weight": 14,
    "Id": 271
},
{
    "URL": "https://x.com/FranceskAlbs/status/1774697364390916118",
    "Date": "01/04/2024",
    "Text": "Each heinous crime the Israeli army is committing against exhausted and traumatised civilians in Gaza is part and parcel of a genocidal campaign.\n\nLooking forward to \n@KarimKhanQC\n's action. This is the greatest moment of truth in the ICC history.",
    "Weight": 12,
    "Id": 272
},
{
    "URL": "https://x.com/tparsi/status/1774450619937378453",
    "Date": "31/03/2024",
    "Text": "WOW! \n\nIsrael has created kill zones in Gaza where they kill everything that moves. Many of the 9,000 terrorists Israel claims it has killed, Israeli soldiers now say, were \n\"civilians whose only crime was to cross an invisible line drawn by the IDF.\"\n\nhttps://haaretz.com/israel-news/2024-03-31/ty-article-magazine/.premium/israel-created-kill-zones-in-gaza-anyone-who-crosses-into-them-is-shot/0000018e-946c-d4de-afee-f46da9ee0000…",
    "Weight": 42,
    "Id": 273
},
{
    "URL": "https://x.com/FranceskAlbs/status/1774373430944497820",
    "Date": "31/03/2024",
    "Text": "Eroding International Law one crime at the time.\n\n#ArmsEmbargoNow\n\nhttps://amp.theguardian.com/us-news/2024/mar/29/us-approves-weapons-bombs-israel…",
    "Weight": 4,
    "Id": 274
},
{
    "URL": "https://x.com/PeruginiNic/status/1774175288735212030",
    "Date": "30/03/2024",
    "Text": "The relentless destruction of the civil networks in charge of distributing the scarce aid that reaches Northern Gaza. The humanitarian distribution roundabouts in Gaza City have been turned into extermination areas.",
    "Weight": 8,
    "Id": 275
},
{
    "URL": "https://x.com/PeruginiNic/status/1773969370730951065",
    "Date": "30/03/2024",
    "Text": "Yes, on this crucial point see also \n@FranceskAlbs\n’s new report (https://ohchr.org/en/documents/country-reports/ahrc5573-report-special-rapporteur-situation-human-rights-palestinian…) in which she analyses Israel’s “humanitarian camouflage” (especially use of IHL) as a manifestation of genocidal intent",
    "Weight": 8,
    "Id": 276
},
{
    "URL": "https://x.com/SRjudgeslawyers/status/1774092349326413864",
    "Date": "30/03/2024",
    "Text": "Rather than upholding its IHL obligation to prevent grave crimes under IHL in #Gaza, the US govt has slandered \n@FranceskAlbs\n who bravely & rigorously fulfills UN mandate to protect the HR of Palestinians. Instead, US must halt arms transfers and insist on aid to stop starvation.",
    "Weight": 14,
    "Id": 277
},
{
    "URL": "https://x.com/MaryLawlorhrds/status/1774077622114279806",
    "Date": "30/03/2024",
    "Text": "Really disappointed and shocked at attempts by States to smear the Special Rapporteur on OPT \n@FranceskAlbs\n for simply carrying out what the #UNHRC mandated her to do- to follow and report on human rights situation in OPT. She is NOT anti-semitic. \n@IsraelMFA\n \n@StateDept",
    "Weight": 4,
    "Id": 278
},
{
    "URL": "https://x.com/kthalps/status/1773815948434096555",
    "Date": "29/03/2024",
    "Text": "I hope \n@StateDeptSpox\n knows how many people, including Jews, find his baseless smearing of \n@FranceskAlbs\n not only transparently cynical but dangerous. Pretending that criticizing Israel and defending human rights is antisemitism  trivializes actual antisemitism.",
    "Weight": 14,
    "Id": 279
},
{
    "URL": "https://x.com/luigidaniele10/status/1773662251376955582",
    "Date": "29/03/2024",
    "Text": "Thanks \n@AJEnglish\n for these questions on the umpteenth, shocking footage documenting intentional attacks against protected members of the Palestinian national group in Gaza\n\nThis is not an isolated incident. The pattern of mass killing of civilians and executions is manifest.\n\n1/",
    "Weight": 8,
    "Id": 280
},
{
    "URL": "https://x.com/UN_HRC/status/1772636445779300744",
    "Date": "26/03/2024",
    "Text": "“Following nearly 6 months of unrelenting Israeli assault on occupied #Gaza, it is my solemn duty to report on the worst of what humanity is capable of & to present my findings: 'the Anatomy of a Genocide'.”\n\n— Special Rapporteur \n@FranceskAlbs\n at \n@UN\n Human Rights Council.\n\n#HRC55",
    "Weight": 17,
    "Id": 281
},
{
    "URL": "https://x.com/FranceskAlbs/status/1773704818298679752",
    "Date": "29/03/2024",
    "Text": "Priorities in the time of genocide.",
    "Weight": 5,
    "Id": 282
},
{
    "URL": "https://x.com/SaulStaniforth/status/1773658536976711742",
    "Date": "29/03/2024",
    "Text": ".\n@andrewfeinstein\n and \n@FranceskAlbs\n on how, if you criticise the actions of the state of Israel, you are accused of antisemitism.\n\nClip is from the 26min documentary 'Israel: Above the Law'. Watch the full program here:\nhttps://youtube.com/watch?v=ueXEXjqXNvk…",
    "Weight": 11,
    "Id": 283
},
{
    "URL": "https://x.com/FranceskAlbs/status/1773683736694972623",
    "Date": "29/03/2024",
    "Text": "I welcome #Ireland's decision to join #SouthAfrica's proceedings before the ICJ. Ireland has historically been a strong principled voice on the question of Palestine (while other #EU countries have lost their compass). May it continue to lead in the pursuit of justice.",
    "Weight": 4,
    "Id": 284
},
{
    "URL": "https://x.com/FranceskAlbs/status/1773679780698722736",
    "Date": "29/03/2024",
    "Text": "Thank you \n@krystalball\n for breaking down my report \"Anatomy of a Genocide\".",
    "Weight": 5,
    "Id": 285
},
{
    "URL": "https://x.com/FranceskAlbs/status/1773677680833012097",
    "Date": "29/03/2024",
    "Text": "Deeply touched by the MANY who stood up agst the recent attacks on my mandate & persona. I treasure your messages of solidarity and concern, and trust me: I am fine. \nLet's stay focused on Palestine, the Palestinians and let's make sure we stop the ongoing genocide.",
    "Weight": 17,
    "Id": 286
},
{
    "URL": "https://x.com/rohantalbot/status/1772282485088375139",
    "Date": "25/03/2024",
    "Text": "As the UNSC finally passed a resolution calling for a ceasefire in #Gaza, the UN special rapporteur \n@FranceskAlbs\n's sobering new report lands: \n\n\"There are reasonable grounds to believe that the threshold indicating Israel’s commission of #genocide is met.\"",
    "Weight": 13,
    "Id": 287
},
{
    "URL": "https://x.com/FranceskAlbs/status/1772054809664766435",
    "Date": "25/03/2024",
    "Text": "\"An organizational culture systematically dehumanising the Palestinians\". \nGreat interview \n@luigidaniele10\n, concise and clear.",
    "Weight": 8,
    "Id": 288
},
{
    "URL": "https://x.com/FranceskAlbs/status/1771955999240282526",
    "Date": "24/03/2024",
    "Text": "I lost count of how many renowned journalists interviewed me on the alleged mistreatment of/sexual abuse against Palestinian women by Israeli forces, and never published any article on this. \n\nOne day I will give a full account in my memoir.",
    "Weight": 12,
    "Id": 289
},
{
    "URL": "https://x.com/Rania_Muhareb/status/1771262898456690716",
    "Date": "22/03/2024",
    "Text": "Speaking at our \n@IrishCentreHR\n annual distinguished lecture this evening \n@UN_SPExperts\n \n@FranceskAlbs\n said \"genocide is the apex of the annihilation of the other,\" a process of settler colonialism, ethnic cleansing, mass killing, forcible transfer & apartheid #NMARW24 \n@uniofgalway",
    "Weight": 5,
    "Id": 290
},
{
    "URL": "https://x.com/FranceskAlbs/status/1771125088428937373",
    "Date": "22/03/2024",
    "Text": "Israel’s reassurance to the US that it has not violated Int'l Law in Gaza clashes against the colossal amount of evidence of such violations being committed at an unprecedented pace and scale, with no redlines whatsoever.",
    "Weight": 8,
    "Id": 291
},
{
    "URL": "https://x.com/democracynow/status/1713900853818523840",
    "Date": "16/10/2023",
    "Text": "Israeli historian and genocide scholar Raz Segal says Israeli leaders' dehumanizing language about Palestinians in Gaza and the IDF's conduct are cause for alarm. \"We're seeing the combination of genocidal acts with special intent. This is indeed a textbook case of genocide.\"",
    "Weight": 38,
    "Id": 292
},
{
    "URL": "https://x.com/FranceskAlbs/status/1770793462230581459",
    "Date": "21/03/2024",
    "Text": "Nutro grande preoccupazione per la sistematicità con cui in Italia si manganella chi chiede giustizia per Gaza. Oggi è la Palestina: e domani?\nCosa pensano i genitori, i nonni, gli insegnanti di questa gioventù malmenata?\n\n\"chi dimentica il passato rischia di riviverlo\" (P. Levi) https://x.com/affari_politic/affari_politici/status/1770528857612845358…",
    "Weight": 4,
    "Id": 293
},
{
    "URL": "https://x.com/FranceskAlbs/status/1770718907055112334",
    "Date": "21/03/2024",
    "Text": "The intentional starvation of Palestinians in Gaza needs a political response in line with international law.",
    "Weight": 12,
    "Id": 294
},
{
    "URL": "https://x.com/FranceskAlbs/status/1770690144019812816",
    "Date": "21/03/2024",
    "Text": "WHO says an increasing number of children in Gaza are on the brink of death due to acute hunger, with newborns “dying because of low birth weight”.\n\nMeanwhile thousands of trucks with essential supplies have been blocked at Rafah for months.",
    "Weight": 6,
    "Id": 295
},
{
    "URL": "https://x.com/QudsNen/status/1770436198441308587",
    "Date": "20/03/2024",
    "Text": "In a desperate attempt to spread chaos in Gaza, Israel has begun deliberately targeting any entity involved in securing and distributing aid in the Strip. This includes the assassination of police members and Palestinian tribes trying to maintain order.",
    "Weight": 12,
    "Id": 296
},
{
    "URL": "https://x.com/KenRoth/status/1770639240864367033",
    "Date": "21/03/2024",
    "Text": "Israel is challenging investigations of UNRWA even before they are released. That's because the facts don't matter. Netanyahu wants UNRWA destroyed to further his starvation strategy in Gaza and his hope that Palestinian refugees will forget who they are.",
    "Weight": 12,
    "Id": 297
},
{
    "URL": "https://x.com/FranceskAlbs/status/1770450552150708635",
    "Date": "20/03/2024",
    "Text": "Famine in Gaza is not a natural disaster. It's a political choice. Outrageous, yes. But also criminal: deliberately depriving 2.3ML Palestinians of resources crucial for survival reflects an intent to inflict conditions of life calculated to bring about their physical destruction",
    "Weight": 12,
    "Id": 298
},
{
    "URL": "https://x.com/FranceskAlbs/status/1770108824717783460",
    "Date": "19/03/2024",
    "Text": "Di passaggio a ROMA. Felice di presentare J'Accuse alla Casa Internazionale delle Donne stasera alle 18:00 e domani alla Libreria del Senato della Repubblica alle 16:00.",
    "Weight": 2,
    "Id": 299
},
{
    "URL": "https://x.com/profbensaul/status/1769503903907807455",
    "Date": "17/03/2024",
    "Text": "Pleased to brief members of the United Kingdom Parliament on the unlawfulness of weapons transfers to Israel in the Gaza war https://ohchr.org/sites/default/files/documents/issues/terrorism/sr/statements/SR-CT-Remarks-UK-Parliamentarians-Arms-Transfers-Israel.pdf…",
    "Weight": 12,
    "Id": 300
},
{
    "URL": "https://x.com/FranceskAlbs/status/1769757966968754621",
    "Date": "18/03/2024",
    "Text": "ComGen \n@UNLazzarini\n: the highest number of people ever recorded as facing human-made famine, along with mass killings, constant harm  & creation of conditions that gut life of humanity has a name: Genocide.\n\nIsrael wants no witnesses, no truth-tellers. \n\nRespect & solidarity.",
    "Weight": 9,
    "Id": 301
},
{
    "URL": "https://x.com/FranceskAlbs/status/1769693962128728353",
    "Date": "18/03/2024",
    "Text": "Presidente \n@GiorgiaMeloni\n: il bimbo in foto con Lei è scampato all'attacco più brutale mai lanciato da Israele >Gaza.\nOltre 13,000 bimbi uccisi, migliaia feriti, orfani e mutilati in una Gaza distrutta e alla fame.\nUrgono sanzioni+embargo di armi a Israele per fermare il massacro",
    "Weight": 16,
    "Id": 302
},
{
    "URL": "https://x.com/FranceskAlbs/status/1769627742968885698",
    "Date": "18/03/2024",
    "Text": "\"Compelling Israel to Stop its Assault and Starvation of Gaza\".\nThanks Jamal and Jess.\nhttps://arabtalkradioblog.wordpress.com/2024/03/17/compelling-israel-to-stop-its-assault-and-starvation-of-gaza/… via \n@ArabTalk",
    "Weight": 16,
    "Id": 303
},
{
    "URL": "https://x.com/michelegiorgio2/status/1769004786878128235",
    "Date": "16/03/2024",
    "Text": "21 anni fa in questo giorno ricevemmo la notizia dell'uccisione dell'attivista americana Rachel Corrie. La ragazza era a Rafah, a sud di Gaza, dove, ferma davanti a una ruspa israeliana, cercava di impedire la demolizione di una casa palestinese. Fu travolta dal mezzo corazzato",
    "Weight": 18,
    "Id": 304
},
{
    "URL": "https://x.com/LeeMordechai/status/1768844679439651111",
    "Date": "16/03/2024",
    "Text": "1/ I’m an Israeli academic. My community is too silent about the ongoing war in Gaza. Here is how I see things based on reading hundreds of articles and watching thousands of videos and images about the war. This tweet chain contains my conclusions as a sort of executive summary.",
    "Weight": 12,
    "Id": 305
},
{
    "URL": "https://x.com/FranceskAlbs/status/1768936003673190527",
    "Date": "16/03/2024",
    "Text": "I welcome Australia's reinstating UNRWA funding. The decision to suspend funds was hasty/unwarranted. Absolutely urgent is to ensure compliance with the ICJ's order which recognises the risk of Israel committing genocide in Gaza.\n\nMy interview with #ABC:",
    "Weight": 13,
    "Id": 306
},
{
    "URL": "https://x.com/QudsNen/status/1768898237660815668",
    "Date": "16/03/2024",
    "Text": "Dozens of innocent Palestinian civilians were massacred last night in an Israeli airstrike which targeted the Tabatibi family home in Nusseirat refugee camp, central Gaza.",
    "Weight": 16,
    "Id": 307
},
{
    "URL": "https://x.com/FranceskAlbs/status/1768795511056642373",
    "Date": "16/03/2024",
    "Text": "Leggo con preoccupazione degli attacchi da parte del Console di Israele a Firenze e della Presidente dell’unione delle comunità ebraiche al Rettore dell'Università di Pisa e al meraviglioso studente italopalestinese  \n@anaskhalil1997\n, per le denunce sulla situazione a Gaza. Basta.",
    "Weight": 12,
    "Id": 308
},
{
    "URL": "https://x.com/SaulStaniforth/status/1768239064388358390",
    "Date": "14/03/2024",
    "Text": "\"I'm very concerned about what this might mean, because Israel has been using humanitarian language to cover what is.. the commission of crimes in Gaza\"\n\n\n@FranceskAlbs\n on Israels proposals to move the 1.4m people out of Rafah",
    "Weight": 16,
    "Id": 309
},
{
    "URL": "https://x.com/SaulStaniforth/status/1768240781632983419",
    "Date": "14/03/2024",
    "Text": ".\n@FranceskAlbs\n on the fact that Israel is the occupying power in Gaza and under international law has responsibility to provide the people of Gaza with what they need to live.",
    "Weight": 12,
    "Id": 310
},
{
    "URL": "https://x.com/FranceskAlbs/status/1768214707494691293",
    "Date": "14/03/2024",
    "Text": "To US audiences: in 5 months Israel has killed as many children as 675 Sandy Hook massacres combined. That is more than 4 Sandy Hook a day for Palestinian children. For 150 days. With US-manifactured weapons. Can you imagine the level of grief of the Palestinian people?",
    "Weight": 12,
    "Id": 311
}]