[
    {
        "URL": "https://x.com/LailaAlarian/status/1855611578424438888",
        "Date": "10/11/2024",
        "Text": "Please read and share \n@KaviChek\n op-ed about the killing of journalists in Gaza which begins and ends with \n@HossamShabat\n words",
        "Weight": 4,
        "Id": 9
    },
    {
        "URL": "https://x.com/HossamShabat/status/1863287815695397027",
        "Date": "01/12/2024",
        "Text": "➤ Director of the Ministry of Health in Gaza, Dr. Al-Bursh: “We urgently need an international investigation committee to uncover what Israel is doing to us. These bombs have terrifying sounds, and when a person gets within 200-300 meters of them, they vaporize.”",
        "Weight": 8,
        "Id": 13
    },
    {
        "URL": "https://x.com/HossamShabat/status/1862915831635554796",
        "Date": "30/11/2024",
        "Text": "Israeli forces have targeted civilians in northern Gaza, striking a civilian's head with a smoke bomb, and it’s stuck in the civilian's head, as you can see.",
        "Weight": 12,
        "Id": 24
    },
    {
        "URL": "https://x.com/HossamShabat/status/1862739426733850871",
        "Date": "30/11/2024",
        "Text": "After speaking with first responders and doctors in northern Gaza, many are reporting that Israeli forces are using new weapons that cause bodies to evaporate on the scene. They describe it as something they have never seen before.",
        "Weight": 12,
        "Id": 30
    },
    {
        "URL": "https://x.com/HossamShabat/status/1861828134066147803",
        "Date": "27/11/2024",
        "Text": "Every day, I’m filming new massacres; every day, the world continues to be complicit in this genocide.",
        "Weight": 5,
        "Id": 57
    },
    {
        "URL": "https://x.com/HossamShabat/status/1861629419116237247",
        "Date": "27/11/2024",
        "Text": "In Gaza, the rain falls heavily, filling the streets with sadness. Each drop reminds us of lost lives and broken dreams. Puddles gather where laughter used to be, now silent signs of pain and longing.",
        "Weight": 4,
        "Id": 62
    },
    {
        "URL": "https://x.com/HossamShabat/status/1861478432611115364",
        "Date": "26/11/2024",
        "Text": "The Displaced in Gaza City: Struggling for survival under an open sky amid rubble and endless hardship.",
        "Weight": 4,
        "Id": 70
    },
    {
        "URL": "https://x.com/HossamShabat/status/1861214476415930686",
        "Date": "26/11/2024",
        "Text": "The entire Gaza Strip is facing horrific conditions due to cold weather and heavy rainfall. Two million people are experiencing bombardment, starvation, and displacement as the Israeli government uses collective punishment as a tool against the entire population.",
        "Weight": 12,
        "Id": 75
    },
    {
        "URL": "https://x.com/HossamShabat/status/1861179904831684741",
        "Date": "25/11/2024",
        "Text": "My report on the horrific living conditions of displaced families in northern Gaza.",
        "Weight": 4,
        "Id": 76
    },
    {
        "URL": "https://x.com/HossamShabat/status/1861104891676008729",
        "Date": "25/11/2024",
        "Text": "Footage I took today shows displaced children across northern Gaza. The majority don’t have shoes or winter clothes and are living in makeshift tents that continue to flood due to the heavy rains",
        "Weight": 4,
        "Id": 81
    },
    {
        "URL": "https://x.com/HossamShabat/status/1860762309695603060",
        "Date": "24/11/2024",
        "Text": "Today, I visited a family with young babies who are struggling to feed their children due to a shortage of formula.Israeli forces continue to restrict the entry of aid into northern Gaza, including baby formula, diapers, and feminine hygiene products.",
        "Weight": 12,
        "Id": 87
    },
    {
        "URL": "https://x.com/HossamShabat/status/1860715979078090822",
        "Date": "24/11/2024",
        "Text": "The Civil Defense warned those displaced to Gaza City not to seek refuge or settle in homes at risk of collapsing. However, due to limited options in the area, many had no choice but to reside in these unsafe structures.",
        "Weight": 4,
        "Id": 89
    },
    {
        "URL": "https://x.com/HossamShabat/status/1860116725897003369",
        "Date": "23/11/2024",
        "Text": "Thanks to everyone who continues to support us, who stands with Gaza, who engages with us, and who is still protesting. Please don’t stop talking about Gaza.",
        "Weight": 8,
        "Id": 94
    },
    {
        "URL": "https://x.com/wawog_now/status/1859649461250851224",
        "Date": "21/11/2024",
        "Text": "Israel kills journalists to kill the truth of Zionist genocide. \n@HossamShabat\n and \n@AnasAlSharif0\n know this; they report anyway. These posters, which are free to download and print, are a tribute to all living and martyred Palestinian journalists.",
        "Weight": 18,
        "Id": 96
    },
    {
        "URL": "https://x.com/HossamShabat/status/1859343154882748518",
        "Date": "20/11/2024",
        "Text": "Paramedics are working hard to pull the injured from under the rubble after a house was bombed in Gaza City",
        "Weight": 4,
        "Id": 109
    },
    {
        "URL": "https://x.com/HossamShabat/status/1858675959265653203",
        "Date": "19/11/2024",
        "Text": "Israeli forces have prohibited the entry of tents into Gaza. As a result, people are living in makeshift shelters made of plastic and blankets, which have all been flooded due to the heavy rain.",
        "Weight": 12,
        "Id": 127
    },
    {
        "URL": "https://x.com/HossamShabat/status/1858675349577511403",
        "Date": "19/11/2024",
        "Text": "Devastating interview I did with an elderly man in north Gaza .",
        "Weight": 4,
        "Id": 128
    },
    {
        "URL": "https://x.com/HossamShabat/status/1858621564604084248",
        "Date": "18/11/2024",
        "Text": "The suffering of a displaced mother in northern Gaza whose tent has flooded due to the heavy rain.",
        "Weight": 4,
        "Id": 131
    },
    {
        "URL": "https://x.com/HossamShabat/status/1858532623737393253",
        "Date": "18/11/2024",
        "Text": "This is the remains of a child from today’s bombing in Gaza City. We continue to livestream our genocide, while the world continues to complicity.",
        "Weight": 9,
        "Id": 137
    },
    {
        "URL": "https://x.com/HossamShabat/status/1858381992452042873",
        "Date": "18/11/2024",
        "Text": "This morning’s heavy rains and cold weather in the Gaza Strip have turned life into an even worse nightmare. Imagine waking up to find your tent flooded, the streets around you submerged, and nowhere to go for warmth or safety.",
        "Weight": 4,
        "Id": 140
    },
    {
        "URL": "https://x.com/HossamShabat/status/1858174426572849496",
        "Date": "17/11/2024",
        "Text": "A little boy  happy to be reunited with his dad, who was detained by Israeli occupation forces in northern Gaza.",
        "Weight": 17,
        "Id": 143
    },
    {
        "URL": "https://x.com/HossamShabat/status/1857525252835680313",
        "Date": "15/11/2024",
        "Text": "The family of my friend and colleague Fadi Al-Wahidi have just announced an indefinite hunger strike to protest Israel's refusal to permit him to travel for critical medical treatment. His mother, who is battling cancer, is joining this act of defiance.",
        "Weight": 4,
        "Id": 151
    },
    {
        "URL": "https://x.com/HossamShabat/status/1857224682782785600",
        "Date": "15/11/2024",
        "Text": "Palestinian mother from northern Gaza: \n\n“We will not leave Gaza; we stand in defiance,we will rebuild and return to our home,  Gaza is where our hearts belong.",
        "Weight": 16,
        "Id": 154
    },
    {
        "URL": "https://x.com/HossamShabat/status/1857078038858531087",
        "Date": "14/11/2024",
        "Text": "The Israeli occupation targeted the Salahuddin School in Gaza City, where thousands of displaced individuals had sought refuge.",
        "Weight": 17,
        "Id": 158
    },
    {
        "URL": "https://x.com/HossamShabat/status/1856859008528760860",
        "Date": "14/11/2024",
        "Text": "This isn't one of the top 10 saddest stories I've heard during this genocide, most I just block out .",
        "Weight": 5,
        "Id": 161
    },
    {
        "URL": "https://x.com/HossamShabat/status/1856833445042737509",
        "Date": "13/11/2024",
        "Text": "The never-ending targeting of kids in Gaza continues. These children were sleeping when they were bombed just a short while ago in Gaza City.",
        "Weight": 8,
        "Id": 162
    },
    {
        "URL": "https://x.com/HossamShabat/status/1856759536616706555",
        "Date": "13/11/2024",
        "Text": "Urgent Appeal from Dr. Hossam Abu Safiya\n\nThis is an urgent appeal regarding the catastrophic situation in north Gaza. All hospitals in the north have completely collapsed, and there is no medicine, fuel, or any basic necessities available. Please amplify this message.",
        "Weight": 4,
        "Id": 167
    },
    {
        "URL": "https://x.com/HossamShabat/status/1856352318079267177",
        "Date": "12/11/2024",
        "Text": "Today, I filmed a video of paramedics pulling out the body of a little girl who was killed in an Israeli airstrike in Gaza City.",
        "Weight": 12,
        "Id": 173
    },
    {
        "URL": "https://x.com/HossamShabat/status/1856157947216212243",
        "Date": "12/11/2024",
        "Text": "Israeli occupation forces have stopped all the work of medics in northern Gaza a couple of weeks ago. Anyone who is bombed and trapped under the rubble will die a painful death since there’s no first responders or medical personnel available to help.",
        "Weight": 17,
        "Id": 185
    },
    {
        "URL": "https://x.com/HossamShabat/status/1855745772463305118",
        "Date": "10/11/2024",
        "Text": "Hunted.\n\n“That is how Hossam Shabat recently described his life as a journalist in northern Gaza.”",
        "Weight": 4,
        "Id": 191
    },
    {
        "URL": "https://x.com/HossamShabat/status/1855709583567655162",
        "Date": "10/11/2024",
        "Text": "“We lived off salt,\" an elderly displaced Palestinian woman says, describing the harsh reality of surviving 30 days of siege in northern Gaza.",
        "Weight": 8,
        "Id": 192
    },
    {
        "URL": "https://x.com/LailaAlarian/status/1855607714988138498",
        "Date": "10/11/2024",
        "Text": "Hunted. That is how \n@HossamShabat\n recently described his life as a journalist in northern Gaza. \n\nThis urgent piece by \n@KaviChek\n looks at the killing of journalists in Gaza by the Israeli military as journalists there continue to be threatened.",
        "Weight": 16,
        "Id": 194
    },
    {
        "URL": "https://x.com/HossamShabat/status/1855366374782050727",
        "Date": "09/11/2024",
        "Text": "Thank you for everyone who continues to protest , speak up and stand with us much from Gaza ",
        "Weight": 4,
        "Id": 198
    },
    {
        "URL": "https://x.com/HossamShabat/status/1854229496401932557",
        "Date": "06/11/2024",
        "Text": "Israeli occupation forces kidnapped men from north Gaza, blindfolded them, numbered them, executed many, and kidnapped the rest to unknown locations.",
        "Weight": 17,
        "Id": 224
    },
    {
        "URL": "https://x.com/HossamShabat/status/1854228908482138215",
        "Date": "06/11/2024",
        "Text": "Displaced families in north Gaza cry out for shelter and safety, waiting in the streets with nowhere left to go. How long will their pleas go unanswered?",
        "Weight": 4,
        "Id": 225
    },
    {
        "URL": "https://x.com/HossamShabat/status/1854021611625517117",
        "Date": "06/11/2024",
        "Text": "While people are watching the U.S. elections, we in North Gaza  can hear heavy shelling and U.S.-sponsored bombs being dropped on us. Remember, whoever wins, they are all war criminals.",
        "Weight": 4,
        "Id": 230
    },
    {
        "URL": "https://x.com/HossamShabat/status/1853538041836560571",
        "Date": "04/11/2024",
        "Text": "It’s been 30 days since Israeli forces assassinated my friend and colleague Hassan. He was only 19, full of life and eager to become a journalist. But Israeli forces killed and shredded him to pieces for simply doing his job. May you rest in eternal peace, my beloved Hassan.",
        "Weight": 16,
        "Id": 234
    },
    {
        "URL": "https://x.com/HossamShabat",
        "Date": "02/11/2024",
        "Text": "Who is committing crimes against journalists? Which country just killed 170 journalists? Which country is constantly threatening journalists? You would think an official spokesperson would be able to name the killer and identify the victims?",
        "Weight": 2,
        "Id": 251
    },
    {
        "URL": "https://x.com/HossamShabat/status/1851686403853132149",
        "Date": "30/10/2024",
        "Text": "These soldiers came from all over the world to kill my friends and family, to displace us, to starve us. Yet somehow I, the journalist, am the criminal, and these guys who are openly filming themselves killing us and bombing our neighborhoods are the good guys? https://x.com/trackingisrael/trackingisrael/status/1851315904593662170…",
        "Weight": 8,
        "Id": 263
    },
    {
        "URL": "https://x.com/HossamShabat/status/1851452023117660582",
        "Date": "30/10/2024",
        "Text": "Not even a drop of water has entered the besieged north Gaza  since October 1st. The Israeli government is systematically using starvation as a tool of war; they want to starve the remaining population that wasn’t killed by their bombs.",
        "Weight": 12,
        "Id": 264
    },
    {
        "URL": "https://x.com/HossamShabat/status/1851291960511791315",
        "Date": "29/10/2024",
        "Text": "My latest report on updates from north Gaza",
        "Weight": 4,
        "Id": 268
    },
    {
        "URL": "https://x.com/HossamShabat/status/1851200080650350756",
        "Date": "29/10/2024",
        "Text": "77 Palestinians killed in a single airstrike and hundreds injured don’t even get any attention anymore. The Israeli government has been able to kill us constantly, facing no consequences or repercussions, and the world is watching.",
        "Weight": 16,
        "Id": 273
    },
    {
        "URL": "https://x.com/HossamShabat/status/1851196437494665393",
        "Date": "29/10/2024",
        "Text": "No cemeteries, No hospitals, No doctors, No civil defense, No ambulances. The living are under the rubble, and no one can rescue them, the situation in north Gaza gets more horrific by the minute.",
        "Weight": 4,
        "Id": 274
    },
    {
        "URL": "https://x.com/HossamShabat/status/1850576685105856643",
        "Date": "27/10/2024",
        "Text": "Israeli forces forced people out of northern Gaza and made them walk for hours to reach a shelter for the displaced in Gaza City, only to bomb that shelter. \n\nNowhere is safe.",
        "Weight": 16,
        "Id": 292
    },
    {
        "URL": "https://x.com/HossamShabat/status/1850544906692903246",
        "Date": "27/10/2024",
        "Text": "The Israeli occupation forces have committed a new massacre at Asmaa School, which was sheltering displaced people from northern Gaza in Al-Shati refugee camp, west of Gaza City.",
        "Weight": 21,
        "Id": 293
    },
    {
        "URL": "https://x.com/HossamShabat/status/1850178997738450982",
        "Date": "26/10/2024",
        "Text": "I interviewed this young boy from northern Gaza who collapses on the ground after a grueling journey past Israeli tanks and drones, carrying bags on his back and pushing a cart.",
        "Weight": 12,
        "Id": 306
    },
    {
        "URL": "https://x.com/HossamShabat/status/1849848081774436609",
        "Date": "25/10/2024",
        "Text": "Israeli occupation forces have surrounded Kamal Adwan Hospital, bulldozed everything around it, invaded the facility, and arrested all men and medical personnel from the hospital and surrounding buildings. They stripped the detainees and kidnapped many of  them to Israel",
        "Weight": 17,
        "Id": 310
    },
    {
        "URL": "https://x.com/HossamShabat/status/1849799665736110112",
        "Date": "25/10/2024",
        "Text": "Israeli occupation forces stormed the last remaining hospital in northern Gaza, kidnapping medical personnel and patients. Watch my report for the latest updates.",
        "Weight": 17,
        "Id": 312
    },
    {
        "URL": "https://x.com/HossamShabat/status/1849626376887824530",
        "Date": "25/10/2024",
        "Text": "It’s currently 10 degrees in the Gaza Strip on a cold night, and there are still many injured under the rubble in Jabalia—shivering, cold, injured, starving, and hungry—hoping someone will help them. But no one is coming; they will die a painful, cold death. #Gaza",
        "Weight": 8,
        "Id": 321
    },
    {
        "URL": "https://x.com/falstinya1948/status/1849554527642341633",
        "Date": "24/10/2024",
        "Text": "Instead of the \n@nytimes\n advocating for their Palestinian colleagues whom the official Israeli government has targeted for simply doing their jobs, this is what they choose to write about.",
        "Weight": 12,
        "Id": 323
    },
    {
        "URL": "https://x.com/HossamShabat/status/1849213814970974482",
        "Date": "23/10/2024",
        "Text": "Despite the dangerous and untrue  threats made against us from the Israeli occupation, we remain committed to our profession and will continue to report on this genocide .",
        "Weight": 18,
        "Id": 350
    },
    {
        "URL": "https://x.com/HossamShabat/status/1849189941084893375",
        "Date": "23/10/2024",
        "Text": "Please watch and amplify latest updates from besieged north Gaza .",
        "Weight": 4,
        "Id": 351
    },
    {
        "URL": "https://x.com/HossamShabat/status/1848916455737462858",
        "Date": "23/10/2024",
        "Text": "I met a woman who was fleeing from bombs, all alone, after Israeli forces killed her entire family.",
        "Weight": 8,
        "Id": 363
    },
    {
        "URL": "https://x.com/HossamShabat/status/1848840762449858604",
        "Date": "22/10/2024",
        "Text": "Israeli occupation forces are using explosive barrels in the north, causing  children’s heads to explode or beheaded from the intensity of new weapons.",
        "Weight": 13,
        "Id": 364
    },
    {
        "URL": "https://x.com/HossamShabat/status/1848810576828305645",
        "Date": "22/10/2024",
        "Text": "I’m a reporter on the ground in North Gaza, and I’m here to tell you that no aid has entered the besieged area for the past 21 days. The Israeli and American governments are spreading inaccurate information.",
        "Weight": 12,
        "Id": 369
    },
    {
        "URL": "https://x.com/HossamShabat/status/1848771370530021641",
        "Date": "22/10/2024",
        "Text": "Israeli occupation forces burned schools to make sure no displaced people return; they are killing any form of life in northern Gaza.",
        "Weight": 17,
        "Id": 371
    },
    {
        "URL": "https://x.com/HossamShabat/status/1848750216100339733",
        "Date": "22/10/2024",
        "Text": "Due to limited ambulances this is how we transport injured in North Gaza .",
        "Weight": 4,
        "Id": 373
    },
    {
        "URL": "https://x.com/HossamShabat/status/1848675395870015696",
        "Date": "22/10/2024",
        "Text": "The Situation In north Gaza",
        "Weight": 4,
        "Id": 378
    },
    {
        "URL": "https://x.com/HossamShabat/status/1848591619575972260",
        "Date": "22/10/2024",
        "Text": "Israeli Quadcopter planes ask displaced families sheltering in schools in Beit Lahya to leave immediately in a plan to ethnically cleanse the north of Gaza.",
        "Weight": 12,
        "Id": 388
    },
    {
        "URL": "https://x.com/HossamShabat/status/1847778489019355372",
        "Date": "19/10/2024",
        "Text": "When the paramedics brought the wounded to Kamal Adwan Hospital in north Gaza , Israeli occupation forces began heavy shelling around the hospital and then targeted the hospital's water tanks and electricity network.",
        "Weight": 17,
        "Id": 400
    },
    {
        "URL": "https://x.com/HossamShabat/status/1847748217078772067",
        "Date": "19/10/2024",
        "Text": "Civil defense teams are facing difficulties in counting the number of killed, wounded, and missing persons. So far, 80 have been confirmed dead, and hundreds are still missing in the new massacre in North Gaza",
        "Weight": 4,
        "Id": 402
    },
    {
        "URL": "https://x.com/HossamShabat/status/1847498416043024792",
        "Date": "19/10/2024",
        "Text": "I don’t know to who we are sending the urgent calls or who we are appealing to, as it’s obvious that the north of Gaza is being exterminated and no one can stop this. \nAll of our screams are falling on deaf ears.",
        "Weight": 4,
        "Id": 415
    },
    {
        "URL": "https://x.com/HossamShabat/status/1847497000972874087",
        "Date": "19/10/2024",
        "Text": "Out of the three remaining hospitals in the north, Israeli occupation forces have besieged and attacked two, meaning that most injured patients will die since there is no place to treat them.",
        "Weight": 13,
        "Id": 416
    },
    {
        "URL": "https://x.com/HossamShabat/status/1846904215353929873",
        "Date": "17/10/2024",
        "Text": "Massacres in Jabalia refugee camps haven’t stopped for the past 10 days. Today’s massacre occurred at a school sheltering families when the Israeli occupation bombed the school, resulting in the death of 30 and 150 wounded",
        "Weight": 13,
        "Id": 438
    },
    {
        "URL": "https://x.com/HossamShabat/status/1846812041534730247",
        "Date": "17/10/2024",
        "Text": "Northern Gaza is experiencing forced starvation imposed by the occupation and approved by USA,  Germany and other western European imperialist criminal governments",
        "Weight": 9,
        "Id": 441
    },
    {
        "URL": "https://x.com/HossamShabat/status/1846612811557880078",
        "Date": "16/10/2024",
        "Text": "A very important clarification: no aid has entered northern Gaza since October 1st. What the Israeli government is saying is only propaganda; nothing has entered the besieged areas since that October first .",
        "Weight": 12,
        "Id": 443
    },
    {
        "URL": "https://x.com/HossamShabat/status/1846271257295442149",
        "Date": "15/10/2024",
        "Text": "The family of Taysir Al-Masri, which was besieged for five days between the bullets of the occupation army and tanks, resulted in six martyrs. \n\nعائلة تيسير المصري التي حوصرت لمدى 5 ايام بين رصاص جيش الاحتلال والدبابات وراح ضحيتها ستة شهداء",
        "Weight": 5,
        "Id": 453
    },
    {
        "URL": "https://x.com/HossamShabat/status/1846222105639096471",
        "Date": "15/10/2024",
        "Text": "The family of Taysir Al-Masri, which was besieged for five days between the bullets of the occupation army and tanks, resulted in six martyrs. \n\nعائلة تيسير المصري التي حوصرت لمدى 5 ايام بين رصاص جيش الاحتلال والدبابات وراح ضحيتها ستة شهداء",
        "Weight": 5,
        "Id": 456
    },
    {
        "URL": "https://x.com/falstinya1948/status/1845945887220277469",
        "Date": "14/10/2024",
        "Text": "The burning of Palestinians alive in Gaza is being funded by the U.S. government. Don’t be fooled by the empty statements from politicians; we don’t need more empty statements.A ceasefire is the bare minimum—we need an arms embargo against the apartheid,genocidal state of Israel.",
        "Weight": 16,
        "Id": 460
    },
    {
        "URL": "https://x.com/SuppressedNws/status/1845863836382884277",
        "Date": "14/10/2024",
        "Text": "Join us today in 30 minutes [8PM Palestine] to understand what’s happening in North Gaza with Journalist Hossam Shabat \n@HossamShabat",
        "Weight": 8,
        "Id": 466
    },
    {
        "URL": "https://x.com/HossamShabat/status/1845714426881610170",
        "Date": "14/10/2024",
        "Text": "The occupation army burned human beings alive in their tents. These were patients, with IVs still in their arms, trapped and helpless in tents in front of the hospital. This is a holocaust.",
        "Weight": 8,
        "Id": 471
    },
    {
        "URL": "https://x.com/HossamShabat/status/1845611275738345613",
        "Date": "13/10/2024",
        "Text": "Burning displaced families alive while sleeping in tents is Israel’s way of defending itself",
        "Weight": 4,
        "Id": 472
    },
    {
        "URL": "https://x.com/HossamShabat/status/1845598144035512543",
        "Date": "13/10/2024",
        "Text": "Israeli occupation forces just bombed the tents of displaced people around Al-Aqsa Hospital, causing citizens to be trapped and burn inside their tents while they were sleeping , massacres are non stop.",
        "Weight": 13,
        "Id": 473
    },
    {
        "URL": "https://x.com/HossamShabat/status/1845478636624765276",
        "Date": "13/10/2024",
        "Text": "This scene has become the usual sight to wake up to in northern Gaza: funeral prayers for our martyrs.",
        "Weight": 4,
        "Id": 476
    },
    {
        "URL": "https://x.com/HossamShabat/status/1845397690546270669",
        "Date": "13/10/2024",
        "Text": "Very bloody night in north Gaza , I made it but hundreds didn’t",
        "Weight": 4,
        "Id": 479
    },
    {
        "URL": "https://x.com/HossamShabat/status/1845200319095111965",
        "Date": "12/10/2024",
        "Text": "Due to the Israeli occupation siege on Jabalia camp, most injuries caused by the occupation's bullets and shelling lead to death, as there are no medical resources or capabilities available to effectively treat the wounded.",
        "Weight": 18,
        "Id": 482
    },
    {
        "URL": "https://x.com/HossamShabat/status/1845194495983341931",
        "Date": "12/10/2024",
        "Text": "The situation in Northern Gaza",
        "Weight": 4,
        "Id": 484
    },
    {
        "URL": "https://x.com/HossamShabat/status/1845096742187856179",
        "Date": "12/10/2024",
        "Text": "This entire family was killed together today in north Gaza , this entire family was erased from the civil registry today .",
        "Weight": 4,
        "Id": 489
    },
    {
        "URL": "https://x.com/HossamShabat/status/1844841629179342925",
        "Date": "11/10/2024",
        "Text": "#SaveNorthernGaza",
        "Weight": 4,
        "Id": 494
    },
    {
        "URL": "https://x.com/HossamShabat/status/1844828518074483011",
        "Date": "11/10/2024",
        "Text": "We are unable to count the number of massacres happening in Jabalia, and ambulances are unable to reach the calls due to the fuel shortage in northern Gaza.",
        "Weight": 4,
        "Id": 496
    },
    {
        "URL": "https://x.com/HossamShabat/status/1844717649848127667",
        "Date": "11/10/2024",
        "Text": "A baby girl was born at dawn today in the northern Gaza Strip and was injured due to the ongoing bombardment of civilian homes by Israeli occupation forces.",
        "Weight": 17,
        "Id": 502
    },
    {
        "URL": "https://x.com/HossamShabat/status/1844475564197118109",
        "Date": "10/10/2024",
        "Text": "A summary of what’s currently happening in north Gaza please amplify.",
        "Weight": 4,
        "Id": 504
    },
    {
        "URL": "https://x.com/HossamShabat/status/1844435005281534158",
        "Date": "10/10/2024",
        "Text": "This is my second birthday during this genocide, I don't have many wishes; I just want all this to be over. I want Fadi to be ok , and I want to reunite with my family",
        "Weight": 5,
        "Id": 507
    },
    {
        "URL": "https://x.com/HossamShabat/status/1844405820890451974",
        "Date": "10/10/2024",
        "Text": "This is urgent , The medical condition of my brother got worse ,  We are in critical need to evacuate Fadi out of the Gaza Strip.  \nPlease share this post. \n\nتدهورت الحالة الطبية لزميلي الصحفي فادي الوحيدي ، نحن بحاجة ماسة لإجلاء فادي من قطاع غزة",
        "Weight": 4,
        "Id": 513
    },
    {
        "URL": "https://x.com/HossamShabat/status/1844074111250939914",
        "Date": "09/10/2024",
        "Text": "To annex and ethnically cleanse northern Gaza, Israeli occupation forces have been shelling the area nonstop and systematically targeting journalists, hospitals, and schools. The situation continues to worsen by the minute .",
        "Weight": 17,
        "Id": 527
    },
    {
        "URL": "https://x.com/HossamShabat/status/1844065658189054256",
        "Date": "09/10/2024",
        "Text": "Fadi Alwahidi is my friend and colleague who has not had a moment of rest for the past year. He was targeted by an Israeli sniper while wearing his clear press vest, and he is currently in critical condition.",
        "Weight": 8,
        "Id": 528
    },
    {
        "URL": "https://x.com/HossamShabat/status/1844021965075763480",
        "Date": "09/10/2024",
        "Text": "My colleague Fadi Alwahdi was just targeted by an Israeli sniper and shot in the neck. The goal is to kill us one by one.",
        "Weight": 8,
        "Id": 533
    },
    {
        "URL": "https://x.com/HossamShabat/status/1844021116853215669",
        "Date": "09/10/2024",
        "Text": "So far 10 killed from the horrific massacre targeting displaced people’s tents in the yard of Al-Yemen Al-Saeed Hospital in the heart of Jabalia refugee camp, northern Gaza.",
        "Weight": 4,
        "Id": 534
    },
    {
        "URL": "https://x.com/HossamShabat/status/1843758313273733124",
        "Date": "08/10/2024",
        "Text": "Israeli occupation forces bombed the only remaining bakery serving the population in northern Gaza. The bakery is currently burning and out of service. This is being done intentionally to eradicate any semblance of life in northern Gaza.",
        "Weight": 21,
        "Id": 540
    },
    {
        "URL": "https://x.com/HossamShabat/status/1843743248680136963",
        "Date": "08/10/2024",
        "Text": "The north of Gaza is facing the greatest threat since the start of the genocide. They have officially declared it an Israeli military zone and are working toward its ethnic cleansing. What we witness in the next 24 hours will be detrimental to the entire Palestinian cause.",
        "Weight": 21,
        "Id": 541
    },
    {
        "URL": "https://x.com/HossamShabat/status/1843740762976182642",
        "Date": "08/10/2024",
        "Text": "This was the scene yesterday at Kamal Adwan Hospital. This is the hospital Israeli occupation forces are demanding to be evacuated which is currently housing hundreds of critically wounded patients with no where to go .",
        "Weight": 13,
        "Id": 542
    },
    {
        "URL": "https://x.com/HossamShabat/status/1843657174112973081",
        "Date": "08/10/2024",
        "Text": "Israeli occupation forces have targeted ambulances, rendering them out of service. Many injured individuals are calling for help, but paramedics are unable to respond due to the destruction of their vehicles in north Gaza",
        "Weight": 17,
        "Id": 550
    },
    {
        "URL": "https://x.com/HossamShabat/status/1843390391061754136",
        "Date": "07/10/2024",
        "Text": "Where are the statements from Western leaders condemning the 50,000 Palestinians killed by Israeli occupation forces?  The statements condemning the displacement of 2 million Palestinians in Gaza ? \n\nAmerican politicians are all complicit in this genocide.",
        "Weight": 38,
        "Id": 553
    },
    {
        "URL": "https://x.com/HossamShabat/status/1843382380566065618",
        "Date": "07/10/2024",
        "Text": "A year of genocide",
        "Weight": 5,
        "Id": 554
    },
    {
        "URL": "https://x.com/HossamShabat/status/1843363388384235612",
        "Date": "07/10/2024",
        "Text": "A wife breaks down while bidding farewell to her husband, who was killed today in northern Gaza.",
        "Weight": 4,
        "Id": 555
    },
    {
        "URL": "https://x.com/HossamShabat/status/1843317062149808163",
        "Date": "07/10/2024",
        "Text": "Mother bids farewell to her son who was killed today in north Gaza .",
        "Weight": 4,
        "Id": 556
    },
    {
        "URL": "https://x.com/HossamShabat/status/1843294373049769999",
        "Date": "07/10/2024",
        "Text": "On October 7th, I would like to remind the world that the Israeli occupation forces  are still killing us. Here is footage from the massacre today in northern Gaza of a young boy bidding farewell to his brother .",
        "Weight": 22,
        "Id": 558
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842976451139948585",
        "Date": "06/10/2024",
        "Text": "For them, it’s a game; they press a button. For us, it’s about our loved ones, our homes, our cities, and our memories. Israeli occupation forces know no boundaries; they thrive on killing us and destroying our lives.",
        "Weight": 13,
        "Id": 565
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842875180848226760",
        "Date": "06/10/2024",
        "Text": "I can’t even grieve the loss of my friend Hassan, as Israeli occupation forces are invading the north. The shelling has not stopped for the past 24 hours, but we will keep going. We will not stop, just like Hassan never stopped. ",
        "Weight": 13,
        "Id": 573
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842787694482498031",
        "Date": "06/10/2024",
        "Text": "I just saw my friend and colleague Hassan Hamad an hour ago Israeli occupation forces have just killed him, and what remains of his body is in pieces in a plastic bag. Why do I have to see my friends in plastic bags? Why is this world so cruel to us?",
        "Weight": 13,
        "Id": 579
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842781234834841602",
        "Date": "06/10/2024",
        "Text": "My friend and colleague Hassan Hamad was just killed after Israeli occupation forces targeted his house in North Gaza . \n\nFarewell my dear brother",
        "Weight": 17,
        "Id": 581
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842696657110270392",
        "Date": "05/10/2024",
        "Text": "The outcome of a very bloody night in north Gaza .",
        "Weight": 4,
        "Id": 585
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842692203547676790",
        "Date": "05/10/2024",
        "Text": "The bombing was very tense tonight, with nonstop shelling and more than 50 bombings across northern Gaza in just the last couple of hours.",
        "Weight": 4,
        "Id": 586
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842686271916777536",
        "Date": "05/10/2024",
        "Text": "The Israeli occupation army directly targeted us with gunfire during the coverage in northern Gaza .",
        "Weight": 17,
        "Id": 589
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842643075153244404",
        "Date": "05/10/2024",
        "Text": "Israeli occupation forces just targeted me and my colleagues while en route to cover a nearby bombing. We were in our car, which clearly reads \"press” , they are preparing for something big in the north , if we don’t make it please keep taking about Gaza .",
        "Weight": 17,
        "Id": 591
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842609709351670168",
        "Date": "05/10/2024",
        "Text": "Just now, very heavy bombing across northern Gaza feels like it's the first days of the aggression .",
        "Weight": 4,
        "Id": 597
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842608190447653289",
        "Date": "05/10/2024",
        "Text": "Multiple families in northern Gaza rushed to look for their children after Israeli occupation forces bombed a residential area.",
        "Weight": 17,
        "Id": 598
    },
    {
        "URL": "https://x.com/HossamShabat/status/1842303768357999099",
        "Date": "04/10/2024",
        "Text": "After a year after of genocide, how did the citizens undermine the occupation army's plan to evacuate the north of its residents?",
        "Weight": 10,
        "Id": 604
    },
    {
        "URL": "https://x.com/HossamShabat/status/1841308230087004327",
        "Date": "02/10/2024",
        "Text": "Nights are long because all I hear are the screams of children and parents. Nights are long because I'm alone with my thoughts, reliving everything horrific I see during the day. \n\nThere’s no rest in genocide.",
        "Weight": 5,
        "Id": 616
    }
]