
[
{
    "URL": "https://x.com/Issaamro/status/1860316774857576565",
    "Date": "23/11/2024",
    "Text": "Happening now in Hebron, Israeli settlers are attacking Palestinian houses by throwing stones and empty beer bottles.",
    "Weight": 12,
    "Id": 0
},
{
    "URL": "https://x.com/Issaamro/status/1857176310549786789",
    "Date": "14/11/2024",
    "Text": "Happening now in Hebron 11 pm, Israeli Jewish settlers are stealing Palestinian olives, the Israeli army few days ago prevented the Palestinian families from picking their olives. Now the settlers stole it .",
    "Weight": 28,
    "Id": 1
},
{
    "URL": "https://x.com/Issaamro/status/1854608851389063343",
    "Date": "07/11/2024",
    "Text": "Our daily life under the Israeli occupation and apartheid.",
    "Weight": 13,
    "Id": 2
},
{
    "URL": "https://x.com/Issaamro/status/1854056062867177817",
    "Date": "06/11/2024",
    "Text": "Democrats lost the 2024 election because of \n@POTUS\n and his team blind support to the Israeli war and genocide. \nIt is the time for the democrats to act according to their principles and values and stop the blind support to the Israeli racism and genocide.",
    "Weight": 26,
    "Id": 3
},
{
    "URL": "https://x.com/Issaamro/status/1852842418087014666",
    "Date": "02/11/2024",
    "Text": "The Israeli settlers stole my house CCTV camera again and again, each new camera they come and steal it, the Israel soldiers see them stealing but do nothing to stop them.",
    "Weight": 12,
    "Id": 4
},
{
    "URL": "https://x.com/Issaamro/status/1852015450617458758",
    "Date": "31/10/2024",
    "Text": "Today the Israeli military detained and interrogated 22 Palestinians in Dura city next to Hebron, the detainees were labeled  by drawing numbers on their foreheads, the Israeli army used their numbers as identification, \nIt is more than occupation, it is fascizim",
    "Weight": 29,
    "Id": 5
},
{
    "URL": "https://x.com/Issaamro/status/1850109310732251560",
    "Date": "26/10/2024",
    "Text": "Today is Shabbat , Israeli Jewish settlers attacked a Palestinian family during the olives harvest in Hebron , they stole the olives & sheets which the family use to pick the olives. Soldiers did nothing to stop them.\nIsraeli Jewish settlers don’t represent the Jews in the world.",
    "Weight": 32,
    "Id": 6
},
{
    "URL": "https://x.com/Issaamro/status/1846809595773087896",
    "Date": "17/10/2024",
    "Text": "Thursday, October 17th , all the checkpoints in Hebron are closed for the Palestinian people because of the Jewish holiday #sukkot2024 , we are not allowed to leave out or in our houses. No schools no jobs no life . It is racism and apartheid not security to anyone .",
    "Weight": 8,
    "Id": 7
},
{
    "URL": "https://x.com/Issaamro/status/1846461008413401448",
    "Date": "16/10/2024",
    "Text": "A video shows the moment Israeli occupation forces murdered 15-year-old Rayan Al-Sayed in Jenin yesterday.\nIt is the orders of the national security minister in Israel who is infamous of his support of this type of killings.",
    "Weight": 17,
    "Id": 8
},
{
    "URL": "https://x.com/Issaamro/status/1843285141357281480",
    "Date": "07/10/2024",
    "Text": "A Year of Israel’s Genocide and the Collapse of World Order. \nStand up now before it is too late to do so.",
    "Weight": 9,
    "Id": 9
},
{
    "URL": "https://x.com/Issaamro/status/1842829382114521585",
    "Date": "06/10/2024",
    "Text": "Leaked video shows Israeli occupation soldiers mentally and physically torturing Palestinian civilians arrested from the occupied west bank, lying on the ground and on the stones, While the Israeli soldier seemingly reading the Jewish Torah book and provoking them.",
    "Weight": 29,
    "Id": 10
},
{
    "URL": "https://x.com/Issaamro/status/1842814668387029367",
    "Date": "06/10/2024",
    "Text": "In Hebron today , the Israeli army closed the main checkpoint, the teachers and the students were not able to reach their school on time.\nIt is daily harassment’s without any excuse, it is happening because it is occupation and apartheid.",
    "Weight": 13,
    "Id": 11
},
{
    "URL": "https://x.com/RamAbdu/status/1841791704728252552",
    "Date": "03/10/2024",
    "Text": "A must-watch| Al Jazeera investigative unit \n@AJIunit\n exposes Israeli war crimes in Gaza through soldier-posted videos. It reveals looting, demolition, and murder, with Western complicity. \n@EuroMedHR\n \n@MahaGaza\n \nhttps://youtube.com/watch?v=kPE6vbKix6A…",
    "Weight": 28,
    "Id": 12
},
{
    "URL": "https://x.com/rightlivelihood/status/1841802854740168921",
    "Date": "03/10/2024",
    "Text": "Congratulations to 2024 #RightLivelihood Laureate, \n@Issaamro\n/\n@YASHebron\n, leaders in the non-violent movement against Israeli occupation in the West Bank.\n\nAmro and YAS strive to create a future where Palestinians live freely and with dignity.\n\nRead more  https://rightlivelihood.org/the-change-makers/find-a-laureate/issa-amro-youth-against-settlements/…",
    "Weight": 21,
    "Id": 13
},
{
    "URL": "https://x.com/Issaamro/status/1841749569190662302",
    "Date": "03/10/2024",
    "Text": "This prize is for Palestinian rights to live with freedom, justice and equality . \nThanks to all the supporters of my work .",
    "Weight": 4,
    "Id": 14
},
{
    "URL": "https://x.com/Palestine_UN/status/1840366272934023360",
    "Date": "29/09/2024",
    "Text": "  Minister Thórdis Kolbrún ReykfjÖrd Gylfadóttir: “No country is above the law. The Palestinian right to self-determination is beyond debate.”",
    "Weight": 4,
    "Id": 15
},
{
    "URL": "https://x.com/Issaamro/status/1835249695251206181",
    "Date": "15/09/2024",
    "Text": "The Israeli settlers stole my CCTV camera in Hebron  , and they stole the telecommunication hub. It is not the first time, my CCTV cameras system was stolen and damaged more than one time by Israeli settlers and soldiers.",
    "Weight": 16,
    "Id": 16
},
{
    "URL": "https://x.com/Issaamro/status/1833014716857307500",
    "Date": "09/09/2024",
    "Text": "The Israeli military prevented the students from using the main road to reach their school in Hebron , the students were forced to use the fields.",
    "Weight": 8,
    "Id": 17
},
{
    "URL": "https://x.com/Issaamro/status/1831234375607816663",
    "Date": "04/09/2024",
    "Text": "The treatment of the Palestinians at the Israeli checkpoints in Hebron.",
    "Weight": 16,
    "Id": 18
},
{
    "URL": "https://x.com/Issaamro/status/1831007128255172806",
    "Date": "03/09/2024",
    "Text": "Hebron municipality was not able to collect  garbage in the last days because Hebron city is under Israeli military siege .",
    "Weight": 8,
    "Id": 19
},
{
    "URL": "https://x.com/Issaamro/status/1830509872946741644",
    "Date": "02/09/2024",
    "Text": "All the checkpoints in Hebron are closed for the second day, it is Collective punishments against Palestinian civilians.\nIn H2 the people are not able to leave their homes nor to come back to stay with their children.",
    "Weight": 4,
    "Id": 20
},
{
    "URL": "https://x.com/catebrown12/status/1829580013546381475",
    "Date": "30/08/2024",
    "Text": "Israel issued 16 evacuation orders this month,  shrinking #Gaza’s only humanitarian zone by nearly 1/3.\n\nA resident told \n@MiriamABerger\n that there are no empty places left, \"no water, no food.\"\n\nHow much more can Gaza afford to lose?\nhttps://wapo.st/3YZj8U2",
    "Weight": 12,
    "Id": 21
},
{
    "URL": "https://x.com/Issaamro/status/1828532887517569322",
    "Date": "27/08/2024",
    "Text": "I ask the Turkish government not to deport her , she is only trying to help the Palestinian people . \nI was at the event, I will feel sad if she is punished .",
    "Weight": 4,
    "Id": 22
},
{
    "URL": "https://x.com/medeabenjamin/status/1828177803000385689",
    "Date": "26/08/2024",
    "Text": "Discover how funds from US nonprofit groups are fueling illegal Israeli settlements in the West Bank. Palestinian activist from Hebron, \n@Issaamro\n , calls for targeted campaigns to cut off financial support and expose the ties that perpetuate Israeli apartheid and occupation.",
    "Weight": 25,
    "Id": 23
},
{
    "URL": "https://x.com/sarahleah1/status/1824551928933568837",
    "Date": "16/08/2024",
    "Text": "“What is happening here in the West Bank is the second front of this dramatic war.” Palestinian activist - & my friend! -  Issa Amro (\n@Issaamro\n) speaks with \n@mannocchia\n in Hebron for a special interview illustrated by \n@channeldraw\n. | \n@DAWN_Journal",
    "Weight": 4,
    "Id": 24
},
{
    "URL": "https://x.com/Issaamro/status/1823617812985786441",
    "Date": "14/08/2024",
    "Text": "Israeli army is using Palestinian elders and children as human shields in Gaza, because the soldiers think that their lives are more important than the life of the Palestinians. \nSource: Haaretz",
    "Weight": 24,
    "Id": 25
},
{
    "URL": "https://x.com/Issaamro/status/1822267391646064684",
    "Date": "10/08/2024",
    "Text": "Watch the video : Israeli settlers are attacking Palestinian vehicles near Beit Eil Israeli settlement in occupied West Bank.",
    "Weight": 20,
    "Id": 26
},
{
    "URL": "https://x.com/Issaamro/status/1818348721806917665",
    "Date": "30/07/2024",
    "Text": "I was honored today to meet \n@itamar_green\n who is refusing to be part of the Israeli military occupation, so he is going to jail next Monday, to spend 6 months in jail. \nHe is calling you to join him to support his decision.",
    "Weight": 13,
    "Id": 27
},
{
    "URL": "https://x.com/CamJLPA/status/1817873209502433465",
    "Date": "29/07/2024",
    "Text": "• Palestinian human rights defender \n@Issaamro\n in conversation with Legal Researcher Shahad Alkamas on the challenges of life in occupied Hebron and the impact that Israeli authorities, settlements, and military law have had on the Palestinian community",
    "Weight": 16,
    "Id": 28
},
{
    "URL": "https://x.com/Issaamro/status/1816192095457296494",
    "Date": "24/07/2024",
    "Text": "Thanks to the American Jews who protested against the War criminal (Netanyahu) visit to the US  congress.\nWe feel stronger with your support and solidarity.",
    "Weight": 4,
    "Id": 29
},
{
    "URL": "https://x.com/Issaamro/status/1815755318808228088",
    "Date": "23/07/2024",
    "Text": "During the Israeli War on Gaza, Israeli military is busy to demolish Palestinian homes in West Bank and to encourage the Israeli settlers to violently attack Palestinians. \nToday the Israeli military demolished many homes in south mount Hebron.",
    "Weight": 48,
    "Id": 30
},
{
    "URL": "https://x.com/Issaamro/status/1813170501742739779",
    "Date": "16/07/2024",
    "Text": "Happening now in Hebron, Israeli soldiers violently arrest a Palestinian resident of Tal Rumieda, he was going in to His house, the soldiers act violently without excuse.",
    "Weight": 12,
    "Id": 31
},
{
    "URL": "https://x.com/Issaamro/status/1812766823600828771",
    "Date": "15/07/2024",
    "Text": "The Israeli military beat up my dear Friend Mohammad Al- Natsheh, they detained him for hours then beat him up without any reason.",
    "Weight": 8,
    "Id": 32
},
{
    "URL": "https://x.com/Issaamro/status/1808811177658446283",
    "Date": "04/07/2024",
    "Text": "I wish all my American friends a happy Independence Day, I wish that one day  the American administration stops its blind support to the Israeli occupation and apartheid.",
    "Weight": 13,
    "Id": 33
},
{
    "URL": "https://x.com/Issaamro/status/1807400770989429146",
    "Date": "30/06/2024",
    "Text": "Happening now , Israeli settlers are throwing stones toward Palestinian shops and customers in Hebron market. The military post is few meters from the location of the stones throwing.",
    "Weight": 12,
    "Id": 34
},
{
    "URL": "https://x.com/Issaamro/status/1806403973798375790",
    "Date": "27/06/2024",
    "Text": "Watch the video which shows Israeli  soldiers in Hebron throwing  3 Palestinian cars to the valley, the cars were confiscated by the soldiers under the excuse  that it is not legal cars.",
    "Weight": 12,
    "Id": 35
},
{
    "URL": "https://x.com/Issaamro/status/1799881871117226313",
    "Date": "09/06/2024",
    "Text": "My friend Bassem Tamimi  is released now from Israeli jail.",
    "Weight": 8,
    "Id": 36
},
{
    "URL": "https://x.com/Issaamro/status/1797014316916363681",
    "Date": "01/06/2024",
    "Text": "Happening now: Israeli settlers stole my metal water tanks , I usually save water in the tanks in order to use it later because we have shortage of water , Israeli government steals our water , and Israeli settlers steal our water tanks .",
    "Weight": 24,
    "Id": 37
},
{
    "URL": "https://x.com/Issaamro/status/1796597996957880665",
    "Date": "31/05/2024",
    "Text": "Israel is apartheid state .",
    "Weight": 4,
    "Id": 38
},
{
    "URL": "https://x.com/Issaamro/status/1796595059259044284",
    "Date": "31/05/2024",
    "Text": "Happening now: Israeli settler destroyed my house wall, the Israeli soldier did nothing to stop him.\nThe Israeli police will do nothing to make him accountable.",
    "Weight": 24,
    "Id": 39
},
{
    "URL": "https://x.com/catebrown12/status/1795978402291191936",
    "Date": "30/05/2024",
    "Text": "The Israeli military used a US-supplied bomb in a set of deadly strikes in #Gaza Sunday, killing at least 45 people in Rafah.\n\nThe State Department approved a transfer of the same SDB GBU-39 bombs on the day Israeli forces bombed a \n@WCKitchen\n convoy.",
    "Weight": 22,
    "Id": 40
},
{
    "URL": "https://x.com/catebrown12/status/1795983195558511091",
    "Date": "30/05/2024",
    "Text": "Israel said it used munitions containing “17 kilos of explosive material,” a weight consistent with the size of a GBU-39 warhead, according to \n@Easybakeovensz\n \n\nThe cage code “81873” linked the fragment to California-based manufacturer Woodward HRT.",
    "Weight": 4,
    "Id": 41
},
{
    "URL": "https://x.com/Issaamro/status/1794446818283336012",
    "Date": "25/05/2024",
    "Text": "Happening now , Israeli soldiers closed the checkpoints in Hebron in order to let few Israeli settlers celebrate LagB’Omer Jewish holiday , people are waiting outside the checkpoints with those kids and women. \nIt is apartheid and Israeli Jewish supremacy.",
    "Weight": 32,
    "Id": 42
},
{
    "URL": "https://x.com/Issaamro/status/1794444711769293138",
    "Date": "25/05/2024",
    "Text": "I Want to thank all the solidarity groups all over the world with Palestine, your work make peace happen sooner and it will force Israel  to end its  occupation and apartheid.",
    "Weight": 13,
    "Id": 43
},
{
    "URL": "https://x.com/Issaamro/status/1793681221416784171",
    "Date": "23/05/2024",
    "Text": "The Israeli military have burned down many libraries in Gaza,the Israeli PM \n@netanyahu\n described  that the war is between the civilized and uncivilized nations.\nIs burning books and libraries a civilized behavior???!.\n\nThe Photo is showing Israeli soldier in AL- Aqsa university.",
    "Weight": 28,
    "Id": 44
},
{
    "URL": "https://x.com/Issaamro/status/1793206796640727282",
    "Date": "22/05/2024",
    "Text": "Thank you #Norway , #spain #Irelan for finally recognising us as a nation who deserve freedom and Justice. \n\nWe are waiting the other countries to do so. \n\nIsrael must be forced to end the occupation.",
    "Weight": 9,
    "Id": 45
},
{
    "URL": "https://x.com/Issaamro/status/1792917213264888312",
    "Date": "21/05/2024",
    "Text": "They want to hide the truth , they want to shut off our voices. \nIsraeli is not defending itself, Israel is defending its occupation and apartheid.",
    "Weight": 17,
    "Id": 46
},
{
    "URL": "https://x.com/Issaamro/status/1791523820001509597",
    "Date": "17/05/2024",
    "Text": "Two Israeli Jewish settlers stole my new lemon tree, I was watering it for more than a year, the soldier saw them and didn’t do anything to stop them. \nThe Israeli soldiers are protecting the crimes of the Israeli settlers in the West Bank.\nWatch the videos .",
    "Weight": 30,
    "Id": 47
},
{
    "URL": "https://x.com/RamAbdu/status/1754132647503180167",
    "Date": "04/02/2024",
    "Text": "The clip of Hala’s killing is one of a growing number that show unarmed civilians holding white flags being shot dead by Israel soldiers in Gaza. An investigative report by \n@CNN",
    "Weight": 8,
    "Id": 48
},
{
    "URL": "https://x.com/Issaamro/status/1790820035201466412",
    "Date": "15/05/2024",
    "Text": "Israeli settlers broke into a Palestine private house in south mount Hebron, they sat with the family without the family permission, they acted as if it is their house, they smoked cigarettes, they are intimidating the families to force them to leave .",
    "Weight": 12,
    "Id": 49
},
{
    "URL": "https://x.com/Issaamro/status/1790415652236279968",
    "Date": "14/05/2024",
    "Text": "Israeli soldiers harassed our tour in Hebron today, they claimed that we are not allowed to be in the land next to my house, in the other hand Israeli settlers and their visitors are traveling freely in our land.",
    "Weight": 16,
    "Id": 50
},
{
    "URL": "https://x.com/Issaamro/status/1789171478186860760",
    "Date": "11/05/2024",
    "Text": "God bless all American students who are demonstrating peacefully for stopping the genocide in Gaza and to end Israeli occupation . They chant that they want free Palestine in their lifetime .",
    "Weight": 26,
    "Id": 51
},
{
    "URL": "https://x.com/CIJ_ICJ/status/1788986217624682500",
    "Date": "10/05/2024",
    "Text": "PRESS RELEASE: South Africa submits an urgent request for the indication of additional provisional measures and the modification of previous provisional measures indicated by the #ICJ in the case #SouthAfrica v. #Israel https://tinyurl.com/3bphwf3p",
    "Weight": 4,
    "Id": 52
},
{
    "URL": "https://x.com/JerseyPSC/status/1782110326500049155",
    "Date": "21/04/2024",
    "Text": "Even if you disagree with me, do you believe #Democracy & #FreeSpeech are an important tenet of modern society? \n\n#StandAgainstZionistIntimidation\n#FreePalestine \n#StopTheGenocide",
    "Weight": 14,
    "Id": 53
},
{
    "URL": "https://x.com/Issaamro/status/1779973052756787315",
    "Date": "15/04/2024",
    "Text": "Israeli settlers murdered  two Palestinian farmers today, they have impunity. \nThe settlers had Israeli army escort during the attack, Israel is lead by the fanatic settlers  militia .",
    "Weight": 24,
    "Id": 54
},
{
    "URL": "https://x.com/Issaamro/status/1778841877040574521",
    "Date": "12/04/2024",
    "Text": "Israeli settlers are attacking Palestinian villages near Ramallah now , the settlers are armed and protected by the Israeli army. \nMany Palestinians are injured by settlers bullets and stones .",
    "Weight": 28,
    "Id": 55
},
{
    "URL": "https://x.com/mhdksafa/status/1778284858088870191",
    "Date": "11/04/2024",
    "Text": "42% of Palestinian civilians killed by Israel have been in zones designated as safe zones by Israel.",
    "Weight": 12,
    "Id": 56
},
{
    "URL": "https://x.com/Issaamro/status/1772643466486415527",
    "Date": "26/03/2024",
    "Text": "Israeli government is preventing the animals food to get in to Gaza Strip . \nIs it for Israeli security????\nWhere is the animal rights organizations to work to pressure Israel to allow the animal food.??!!’",
    "Weight": 24,
    "Id": 57
},
{
    "URL": "https://x.com/Issaamro/status/1772260219487219725",
    "Date": "25/03/2024",
    "Text": "Israeli settlers are throwing rubbish to Palestinian houses in Hebron.\n#Purim2024",
    "Weight": 12,
    "Id": 58
},
{
    "URL": "https://x.com/Issaamro/status/1771843277550923944",
    "Date": "24/03/2024",
    "Text": "عيد المساخر في الخليل ، المستوطنون يحتفلون ، ومنع التجوال وإغلاق الحواجز على العائلات  الفلسطينية .\nPurim in Hebron, Palestinians are not allowed to leave their houses, checkpoints are closed too, fear. In the other hand Israeli settlers are celebrating . \n#Purim2024",
    "Weight": 16,
    "Id": 59
},
{
    "URL": "https://x.com/Issaamro/status/1768615480674193572",
    "Date": "15/03/2024",
    "Text": "Today Friday , the Israeli settlers blocked the main checkpoint which leads to the Ibrahim mosque from the southern part of Hebron. They prevented the people from praying in the mosque. \nThe Israeli army and police did nothing to them, but they closed the checkpoint.",
    "Weight": 16,
    "Id": 60
},
{
    "URL": "https://x.com/BtSIsrael/status/1762857346068353334",
    "Date": "28/02/2024",
    "Text": "No opposition to Israel's policies in the oPt is truly deemed legitimate. If it’s Palestinian diplomatic actions, they're labeled diplomatic terrorism. If you're a human rights Pal defender who believes in non-violence like \n@issaamro\n or \n@basel_adra\n, you’ll be constantly harassed",
    "Weight": 8,
    "Id": 61
},
{
    "URL": "https://x.com/Issaamro/status/1767313776796111116",
    "Date": "11/03/2024",
    "Text": "Today we distributed crescent moon ( Ramadan moon) to the families in H2 in hebron , to protect the Palestinian identity in the targeted area. They try to remove us , we are steadfast and we will remain using nonviolence resistance.",
    "Weight": 4,
    "Id": 62
},
{
    "URL": "https://x.com/Issaamro/status/1766579596793676223",
    "Date": "09/03/2024",
    "Text": "Israeli military arrested 7 years old Palestinian child in Qabatia village near Jenin, the child was released after few hours  in a different  village .",
    "Weight": 12,
    "Id": 63
},
{
    "URL": "https://x.com/catebrown12/status/1766227462088790219",
    "Date": "08/03/2024",
    "Text": "162 \n@UNRWA\n staff members have been killed since the war in #Gaza began. \n\nThe toll marks the highest number of U.N. team members ever killed in any conflict or natural disaster. \n\nMore from \n@JulietteTouma\n \n@saribashi\n \n—->",
    "Weight": 4,
    "Id": 64
},
{
    "URL": "https://x.com/Issaamro/status/1764324851743871460",
    "Date": "03/03/2024",
    "Text": "Israeli settler walking in Hebron in his army uniform, his rifle with his baby.  We live under apartheid and supremacy.",
    "Weight": 8,
    "Id": 65
},
{
    "URL": "https://x.com/Issaamro/status/1762446589061148700",
    "Date": "27/02/2024",
    "Text": "It is a proof that the American society still believe in the principles of the civil rights movement. \nWe love Aaron, and we love all Americans who support justice- freedom and equality in Palestine.",
    "Weight": 4,
    "Id": 66
},
{
    "URL": "https://x.com/catebrown12/status/1762277721667719629",
    "Date": "27/02/2024",
    "Text": "The Palestinian economy has experienced “one of [the] largest shocks recorded in recent economic history,” a new World Bank report has found.\n\nNearly every sector of #Gaza’s economy has been damaged or destroyed:\nhttps://washingtonpost.com/world/2024/02/26/israel-hamas-war-news-gaza-palestine/…",
    "Weight": 24,
    "Id": 67
},
{
    "URL": "https://x.com/Issaamro/status/1758582950713545028",
    "Date": "16/02/2024",
    "Text": "How to make a revolution play in India receives standing ovation. \n\n@EinatWeizman\n and \n@TamerNafar\n and three team of the play did great . \nThey criticized the Indian government support to the Israeli occupation and the war on Gaza.",
    "Weight": 17,
    "Id": 68
},
{
    "URL": "https://x.com/Issaamro/status/1757468962793701758",
    "Date": "13/02/2024",
    "Text": "Thank you for your brave voices, we need you to act according to the real Jewish morals, we need your voice to speak up to protect the children, women and civilians, we need your actions to end the war and to end the Israeli occupation.",
    "Weight": 17,
    "Id": 69
},
{
    "URL": "https://x.com/Issaamro/status/1753496732862730326",
    "Date": "02/02/2024",
    "Text": "A 6-year-old in Gaza City was calling to be rescued. Did anyone find her?",
    "Weight": 4,
    "Id": 70
},
{
    "URL": "https://x.com/Issaamro/status/1753410052788990162",
    "Date": "02/02/2024",
    "Text": "Israeli soldiers are harassing the Palestinian families in Hebron. \nThey closed the checkpoint to delay them and to make them wait under the rain. \nThe checkpoint leads to their homes not to another country.",
    "Weight": 12,
    "Id": 71
},
{
    "URL": "https://x.com/Issaamro/status/1753042003669950888",
    "Date": "01/02/2024",
    "Text": "The US state department removed the Israeli Kahanists ( who are violent and terrorists) from the terrorists list in 2022. \nBut they  kept PLO on the list and today the congress approved the law to prevent PLO members from visiting the United States. \nWhat is going on ???",
    "Weight": 28,
    "Id": 72
},
{
    "URL": "https://x.com/Issaamro/status/1752562345908244573",
    "Date": "31/01/2024",
    "Text": "We can’t have peace until everybody is equal. \nPeace comes after ending the occupation , apartheid and the injustice.",
    "Weight": 5,
    "Id": 73
},
{
    "URL": "https://x.com/Issaamro/status/1752368067378614367",
    "Date": "30/01/2024",
    "Text": "Imagine a prominent British journalist taking a photo next to an armed Palestinian leader holding up a framed map of just Palestine from the river to the sea?",
    "Weight": 8,
    "Id": 74
},
{
    "URL": "https://x.com/Issaamro/status/1751677060597141723",
    "Date": "28/01/2024",
    "Text": "The daily life under the Israeli occupation in Hebron. \nIsraeli soldier beat up a Palestine child in Hebron.",
    "Weight": 25,
    "Id": 75
},
{
    "URL": "https://x.com/FranceskAlbs/status/1750951992476717470",
    "Date": "26/01/2024",
    "Text": "Genocide is a dormant gene of settler-colonialism.Seeing ISR as the state born out of the Holocaust,  some countries cant accept that it might commit atrocities,incl genocide.\nAcknowledging ISR's settler-colonial origins would help remedy that false perception & move twd justice.",
    "Weight": 13,
    "Id": 76
},
{
    "URL": "https://x.com/Issaamro/status/1749512836483805629",
    "Date": "22/01/2024",
    "Text": "Hebron-Halhul city now, Israeli soldiers beat up Palestinian men in the street.\nIt is the daily life under the Israeli occupation and apartheid.",
    "Weight": 25,
    "Id": 77
},
{
    "URL": "https://x.com/Issaamro/status/1748983599930409228",
    "Date": "21/01/2024",
    "Text": "Yesterday, Israeli soldiers sprayed star of David on the Palestinian authority transportation ministry sign and deleted the Palestinian flag from it.\nDoes the Israeli army consider the Palestinian authority in the West Bank as an enemy too???. \nIs the war really against Hamas??.",
    "Weight": 32,
    "Id": 78
},
{
    "URL": "https://x.com/catebrown12/status/1747764342898987212",
    "Date": "17/01/2024",
    "Text": "The \n@WHO\n predicts that the death toll from sickness and starvation in #Gaza could eclipse the total number killed in the war so far — 24,000+ — unless something changes in the coming months -\n\n\n@cairo_claire1\n on the hurdles of delivering humanitarian aid:",
    "Weight": 4,
    "Id": 79
},
{
    "URL": "https://x.com/Issaamro/status/1746890054063030379",
    "Date": "15/01/2024",
    "Text": "The Israeli military used a Palestinian man as human shield in Dura-Hebron.  stones clashes started between Palestinian youth & Israeli army after army raid in the city . \nIt is common act in West Bank since October 7th to use Palestinian civilians as human shield by the army.",
    "Weight": 33,
    "Id": 80
},
{
    "URL": "https://x.com/Issaamro/status/1746790050937835854",
    "Date": "15/01/2024",
    "Text": "More than 700,000 civilians are staying in North Gaza now, they are desperate for Food and Water, they are besieged and have not received any aids for almost 100 days. \nWe all should shout out to stop targeting civilians in Gaza, and allow food, water, fuel and medical supplies.",
    "Weight": 8,
    "Id": 81
},
{
    "URL": "https://x.com/Issaamro/status/1746589833529598027",
    "Date": "14/01/2024",
    "Text": "Leaving people without food is genocide .",
    "Weight": 5,
    "Id": 82
},
{
    "URL": "https://x.com/Issaamro/status/1745527392263696674",
    "Date": "11/01/2024",
    "Text": "What about the Israeli occupation and apartheid ?? \nWhat about peace process??  What about ending the siege on Gaza ?? \nWhat about the Israeli supremacy and racism? \nWhat about West Bank ??!! Many many questions ?????",
    "Weight": 25,
    "Id": 83
},
{
    "URL": "https://x.com/RepRashida/status/1745479839585390994",
    "Date": "11/01/2024",
    "Text": "Today South Africa will present their genocide case against the Israeli government at the \n@CIJ_ICJ\n. I submitted the entire case to the Congressional Record.\n\nLet me read directly from the case file so \n@SecBlinken\n can hear from Israeli officials in their own words, not mine:",
    "Weight": 21,
    "Id": 84
},
{
    "URL": "https://x.com/Issaamro/status/1745510837937148367",
    "Date": "11/01/2024",
    "Text": "The life is getting much harder in the West Bank especially in Hebron, the Israeli soldiers treat us as animals, they talk to us badly,  supremacy and master slave relationship, they are dehumanizing , delaying , making us wait under the rain for long time.",
    "Weight": 8,
    "Id": 85
},
{
    "URL": "https://x.com/Issaamro/status/1744400411803386064",
    "Date": "08/01/2024",
    "Text": "A woman carrying white flag was shot in Gaza, is Israel really defending itself??!!! \nStop the war\nEnd Israeli occupation and apartheid.",
    "Weight": 21,
    "Id": 86
},
{
    "URL": "https://x.com/Issaamro/status/1743171138274881689",
    "Date": "05/01/2024",
    "Text": "Watch the video:\nIsraeli military  executed the teenager Usaid Rimawi 17 years old , and injured two others who tried to help him during a raid into Beit Rima town in Ramallah.\nThe Israeli soldiers shoot and kill Palestinians in west bank without any accountability.",
    "Weight": 24,
    "Id": 87
},
{
    "URL": "https://x.com/Issaamro/status/1741513019916505118",
    "Date": "31/12/2023",
    "Text": "Hebron, Israeli soldiers humiliated a Palestinian worker in Hebron. \nIt is typical to do that without any accountability.",
    "Weight": 12,
    "Id": 88
},
{
    "URL": "https://x.com/Issaamro/status/1740610421541990647",
    "Date": "29/12/2023",
    "Text": "Israeli soldier painted Star of David on a private Palestinian family  door during Israeli army raid in Dura near Hebron, and on few other doors in the area.",
    "Weight": 20,
    "Id": 89
},
{
    "URL": "https://x.com/Issaamro/status/1739525149857042760",
    "Date": "26/12/2023",
    "Text": "Israeli army is dehumanizing and torturing Palestinian civilians in Gaza, they forced civilians to take off their clothes under very cold weather. \nMany horrible testimonies came out from whom were released after days of detention.",
    "Weight": 16,
    "Id": 90
},
{
    "URL": "https://x.com/Issaamro/status/1739190046563958864",
    "Date": "25/12/2023",
    "Text": "Security of settlements means in practice to steal more Palestinian private land around the settlements, Siege the land, then build new settler apartments in that land. Then expand again under the name of security.",
    "Weight": 4,
    "Id": 91
},
{
    "URL": "https://x.com/Issaamro/status/1738887718271062356",
    "Date": "24/12/2023",
    "Text": "More than 20k Palestinian civilians were killed by Israeli military in Gaza, one day we will make them accountable according to the international law. \nI dont know how some people can justify killing civilians??!!, I dont know how some people are silent about it???!!!.",
    "Weight": 16,
    "Id": 92
},
{
    "URL": "https://x.com/xabueid/status/1738631041315717287",
    "Date": "23/12/2023",
    "Text": "Just attended a moving service in #Bethlehem for our people in #Gaza. \n\nRev. \n@MuntherIsaac\n: “To our European friends: I never ever want to hear you lecture us on Human Rights or International Law again. We are not white - it does not apply to us according to your own logic”.\n\n",
    "Weight": 4,
    "Id": 93
},
{
    "URL": "https://x.com/Issaamro/status/1738255136407916810",
    "Date": "22/12/2023",
    "Text": "What is the rocket target in the photo???\nIsraeli military is randomly bombing Gaza since October 7th. \nIt is not self defense, it is a genocide war on civilians. \nStop the war \nEnd the occupation \nEnd the Israeli apartheid.",
    "Weight": 35,
    "Id": 94
},
{
    "URL": "https://x.com/catebrown12/status/1738005913750110456",
    "Date": "22/12/2023",
    "Text": "The number of people facing “catastrophic” levels of food hunger in Gaza is 4 times higher than observed in “the rest of the world”, according to the latest IPC \n@WFP\n report. \n\nWFP predicts a famine if conditions persist: https://wfp.org/news/gaza-grapples-catastrophic-hunger-new-report-predicts-famine-if-conflict-continues…",
    "Weight": 8,
    "Id": 95
},
{
    "URL": "https://x.com/PeterBeinart/status/1737527649164304409",
    "Date": "20/12/2023",
    "Text": "The \"pro-Israel\" groups that now justify slaughtering Palestinians will also justify expelling them, if Egypt opens the border. They will call it a humanitarian gesture. This is what young American Jews have learned, to their horror: our communal leaders have no moral red lines",
    "Weight": 21,
    "Id": 96
},
{
    "URL": "https://x.com/Issaamro/status/1737534504992932188",
    "Date": "20/12/2023",
    "Text": "20k Palestinians were murdered in Gaza by the Israeli apartheid regime, 50k injuries, 2.3 minions terrified to death , 1.8 million were displaced, the majority of them are kids and women.\nDo you think killing, displacing Palestinian civilians will bring peace to Israel????.",
    "Weight": 28,
    "Id": 97
},
{
    "URL": "https://x.com/Issaamro/status/1736834853750833370",
    "Date": "18/12/2023",
    "Text": "Testimonies of war crimes.",
    "Weight": 12,
    "Id": 98
},
{
    "URL": "https://x.com/mannocchia/status/1735950582475583775",
    "Date": "16/12/2023",
    "Text": "Qui il reportage dalla Cisgiordania per \n@welikeduel\n \n\nCi sono le voci dei palestinesi privati della loro terra, i coloni che li guardano dall'altra parte delle colline. \nE poi c'è \n@Issaamro\n, che non smette di credere nella resistenza non violenta",
    "Weight": 4,
    "Id": 99
},
{
    "URL": "https://x.com/Issaamro/status/1735751381854687627",
    "Date": "15/12/2023",
    "Text": "Extrajudicial execution of two Palestinians in west bank by Israel military",
    "Weight": 12,
    "Id": 100
},
{
    "URL": "https://x.com/Issaamro/status/1735590163105943573",
    "Date": "15/12/2023",
    "Text": "Palestinian accused of blocking Israeli colleague on social media arrested by Israeli police ( \n@itamarbengvir\n Militia).\nTrainee doctor banned from Israel and unable to work despite saying she doesn't even have any active social media accounts.\nhttps://middleeasteye.net/news/israel-palestinian-accused-blocking-colleague-social-media-arrested-police…?",
    "Weight": 32,
    "Id": 101
},
{
    "URL": "https://x.com/FriendsHebron/status/1735375886612902124",
    "Date": "14/12/2023",
    "Text": "\"Either we choose to make it deeper and worse, or we make it as an opportunity to solve the conflict and to solve the occupation, to solve the apartheid and make living together possible because the 'security solution' failed.\" \n@IssaAmro\n to the \n@BBC",
    "Weight": 5,
    "Id": 102
},
{
    "URL": "https://x.com/rehakansara/status/1734183314888486983",
    "Date": "11/12/2023",
    "Text": "Since the war in Gaza began, violence against Palestinians in the West Bank has risen sharply. The UN says settlers have killed eight Palestinians and injured more than 84 (as of (9/12). An explainer ft. \n@moehash1",
    "Weight": 20,
    "Id": 103
},
{
    "URL": "https://x.com/Issaamro/status/1733808483655446582",
    "Date": "10/12/2023",
    "Text": "General strike in Palestine and all over the world. \nMonday , December 11th . \nShow solidarity and speak loud against the war and genocide in Palestine.",
    "Weight": 13,
    "Id": 104
},
{
    "URL": "https://x.com/OnlinePalEng/status/1732784462356787567",
    "Date": "07/12/2023",
    "Text": "ISRAELI ARMY TAKING CIVILIANS HOSTAGE\n\nMen were abducted from a UN shelter in Beit Lahia Northern Gaza, while women and children were forced south.\nThis echoes a distressing pattern observed multiple times in the Gaza Strip.",
    "Weight": 16,
    "Id": 105
},
{
    "URL": "https://x.com/IfNotNowOrg/status/1732826903650652185",
    "Date": "07/12/2023",
    "Text": "This is an abomination. As Jews, to see this being done in our name... horrifying, despicable, words fail.\n\nThis is what our government supports in Gaza. Thousands of children murdered, people being rounded up, stripped, and G-d knows what else.\n\nCeasefire NOW, end this nightmare",
    "Weight": 8,
    "Id": 106
},
{
    "URL": "https://x.com/will_christou/status/1732785669204754529",
    "Date": "07/12/2023",
    "Text": "One of the men arrested in this video is our colleague Al-Araby Correspondent Diaa Kahlot, along with his family, who are most definitely not members of Hamas.\n\nHe and other captives were stripped naked in the street and taken to an unknown location. \n\nJournalism is not a crime! https://x.com/OliLondonTV/st/OliLondonTV/status/1732766194136977634…",
    "Weight": 4,
    "Id": 107
},
{
    "URL": "https://x.com/Issaamro/status/1732831319611093413",
    "Date": "07/12/2023",
    "Text": "Watch the treatment of the wE hostages in Gaza, they are obviously civilians.",
    "Weight": 4,
    "Id": 108
},
{
    "URL": "https://x.com/FriendsHebron/status/1732713782017757529",
    "Date": "07/12/2023",
    "Text": "\"Israel is not protecting itself. Israel is protecting its occupation, its apartheid and its settlements. They want to keep their supremacy above Palestinians.\" \n@Issaamro",
    "Weight": 21,
    "Id": 109
},
{
    "URL": "https://x.com/Issaamro/status/1731266624462688584",
    "Date": "03/12/2023",
    "Text": "My best friend and my brother passed away today, he spent his life defending Palestine and defending the truth. \nI hope he rests in peace .\nHis body left us , but his soul is with us for ever. \nAhmad amro goodbye",
    "Weight": 4,
    "Id": 110
},
{
    "URL": "https://x.com/Issaamro/status/1731011770137907614",
    "Date": "02/12/2023",
    "Text": "Israeli settlers burnt Palestinian cars near Nablus city in West Bank, Israeli government is responsible about settlers militia terror against Palestinians.",
    "Weight": 28,
    "Id": 111
},
{
    "URL": "https://x.com/Issaamro/status/1730988870139883976",
    "Date": "02/12/2023",
    "Text": "Israel is killing anyone with critical brain, smart , or doing great for his community. \nThe Islamic university president was killed today . \nHe is one of the best scientists in Palestine. \nBrain drain with by forcing  them out of Palestine or kill them.",
    "Weight": 12,
    "Id": 112
},
{
    "URL": "https://x.com/Issaamro/status/1730728245786526156",
    "Date": "01/12/2023",
    "Text": "Israeli soldier stoped his Jeep next to the body of a Palestinian child who was murdered  by the Israeli army in Jenin in West Bank few days ago , the soldier took a photo of the killed child instead of medical treatment. \nWatch the video and share please.",
    "Weight": 20,
    "Id": 113
},
{
    "URL": "https://x.com/Issaamro/status/1730577730868228343",
    "Date": "01/12/2023",
    "Text": "Moving and moving the Palestinian in Gaza till they reach Egypt, this is the main goal of the Israeli War on Gaza.",
    "Weight": 20,
    "Id": 114
},
{
    "URL": "https://x.com/Issaamro/status/1730571411767398440",
    "Date": "01/12/2023",
    "Text": "We are not allowed to pick our olives because of the military closure, but the Israeli settlers are allowed to steal our own olives. \nIt is occupation and apartheid.",
    "Weight": 13,
    "Id": 115
},
{
    "URL": "https://x.com/Issaamro/status/1730481566571225185",
    "Date": "01/12/2023",
    "Text": "Gaza under fire again, Israel right wing government is using Gaza as internal political game. They want to stay on power by extending the war on Gaza and West Bank civilians.",
    "Weight": 16,
    "Id": 116
},
{
    "URL": "https://x.com/Issaamro/status/1730294205166084342",
    "Date": "30/11/2023",
    "Text": "Israel is controlling the quantity of water ,electricity,food and any other basic human needs in Gaza and West Bank, they treat us as animals who seek food and shelters\nIt was  happening before Oct 7th, it is more restricted now. Why Israel is doing that?..\nTell me your opinion",
    "Weight": 12,
    "Id": 117
},
{
    "URL": "https://x.com/Issaamro/status/1729917309869801671",
    "Date": "29/11/2023",
    "Text": "On the International day of Solidarity with the Palestinian people. \n\nI want to thank you all for your solidarity and actions for peace and justice in Palestine.\nWe should never lose the hope. \n#InternationalDayOfSolidarity \n#Palestine_will_be_free",
    "Weight": 12,
    "Id": 118
},
{
    "URL": "https://x.com/Issaamro/status/1729873939730714935",
    "Date": "29/11/2023",
    "Text": "2 Palestinian children were murdered in Jenin city in West Bank, one of them is only 9 years old. They were killed by Israeli army snipers. \nWatch the video . \nThe child was trying to escape, we have other videos so the Israeli army can’t claim that they didn’t shoot the kids .",
    "Weight": 20,
    "Id": 119
},
{
    "URL": "https://x.com/Issaamro/status/1729744137526632527",
    "Date": "29/11/2023",
    "Text": "I invite \n@elonmusk\n to visit my occupied city Hebron and visit my house to learn the reality of the Israeli occupation, apartheid and Jewish supremacy. \n\n@cnnbrk\n \n@BBCBreaking\n \n@BtSIsrael\n \n@AJENews\n , \n@SkyNewsBreak",
    "Weight": 21,
    "Id": 120
},
{
    "URL": "https://x.com/AmnestyNow/status/1729585721994777016",
    "Date": "28/11/2023",
    "Text": "Some hostages held in Gaza have been released in exchange for the release of Palestinian prisoners. \n\nAll remaining civilian hostages must be released now and the current humanitarian pause extended into a sustained ceasefire.",
    "Weight": 8,
    "Id": 121
},
{
    "URL": "https://x.com/dianabuttu/status/1728034366821921099",
    "Date": "24/11/2023",
    "Text": "Of the 12 Palestinian children to be released from Israeli prisons today:\n- 5 have been thrown in prison without charge or trial\n- 5 have have not been convicted",
    "Weight": 12,
    "Id": 122
},
{
    "URL": "https://x.com/Issaamro/status/1727977531658076538",
    "Date": "24/11/2023",
    "Text": "Israeli soldiers in Hebron damaged the windows of a Palestinian car in a Palestinian neighborhood .\nIt is happening almost daily in the West Bank that Israeli soldiers attack Palestinian civilians and their properties.",
    "Weight": 28,
    "Id": 123
},
{
    "URL": "https://x.com/BtSIsrael/status/1727342362555560046",
    "Date": "22/11/2023",
    "Text": "The Israeli right has a focus right now. The goal? Resettle the Gaza Strip.\n\nTheir way to establish it in the hearts and minds of Israelis: to aggressively push the false notion that the 2005 disengagement was the main failure that led to this moment. This lie must be debunked\n",
    "Weight": 23,
    "Id": 124
},
{
    "URL": "https://x.com/MairavZ/status/1726913629600223734",
    "Date": "21/11/2023",
    "Text": "Irrespective of your views on Israel or Hamas, the fact is, Israel is killing children (over 5,000) and journalists (over 50) at alarming and record breaking rates. Make it stop. \n\nhttps://cpj.org/2023/11/journalist-casualties-in-the-israel-gaza-conflict/…\n\nhttps://aljazeera.com/news/2023/11/20/world-childrens-day-tragedy-gazas-5500-lives-lost-to-israels-attacks…",
    "Weight": 28,
    "Id": 125
},
{
    "URL": "https://x.com/Issaamro/status/1726286358241796260",
    "Date": "19/11/2023",
    "Text": "Watch who is tweeting this picture, it is the Israeli national security minister. \nDehumanizing a woman is not legal , targeting civilians is not legal . \n\n@SecBlinken\n \n@EuroMedHRAr\n \n@btselem\n \n@cnnbrk\n \n@BBCBreaking",
    "Weight": 8,
    "Id": 126
},
{
    "URL": "https://x.com/Issaamro/status/1726279674781937887",
    "Date": "19/11/2023",
    "Text": "We have no other choice, which is to Resist the Israeli occupation peacefully in order to get Freedom, Justice and Equality.",
    "Weight": 13,
    "Id": 127
},
{
    "URL": "https://x.com/Issaamro/status/1725864414237093897",
    "Date": "18/11/2023",
    "Text": "Bombing UN school which is used by civilians in Gaza as safe shelter. \nIt is shocking video,\nit is not at all self defense\nit is not to destroy Hamas. \nIt is “Price Tag”\n\n@StateDept_NEA\n \n@POTUS\n \n@USAbilAraby\n \n@UN_Spokesperson\n \n@netanyahu\n \n@IDF\n @IDFAlliance \n@EU_Commission",
    "Weight": 8,
    "Id": 128
},
{
    "URL": "https://x.com/mck_beth/status/1715688187077566932",
    "Date": "21/10/2023",
    "Text": "In the last week, 8 entire Palestinian communities have been forced off their land by settler violence. Unheard of levels of displacement in the West Bank, which is usually permanent. \nVia \n@Quique_K\n and \n@_EmmaGH",
    "Weight": 4,
    "Id": 129
},
{
    "URL": "https://x.com/Issaamro/status/1725159261418692651",
    "Date": "16/11/2023",
    "Text": "Watch how the Israeli military mistreat and dehumanize the old Palestinian women in West bank - Hebron.",
    "Weight": 12,
    "Id": 130
},
{
    "URL": "https://x.com/muhammadshehad2/status/1724786704798933253",
    "Date": "15/11/2023",
    "Text": "The Biden admin & EU's \n@JosepBorrellF\n are both FULLY complicit in the Israeli siege & attack on al-Shifa. They repeated the lie that the hospital was used for military purposes..\n\nWill they apologize & condemn Israel? or pretend it wasn't a biggie babies were killed for that lie?",
    "Weight": 12,
    "Id": 131
},
{
    "URL": "https://x.com/Issaamro/status/1724708913591767240",
    "Date": "15/11/2023",
    "Text": "Biden \n@POTUS\n will lose the 2024 presidential election because of his blind support to Israel.",
    "Weight": 4,
    "Id": 132
},
{
    "URL": "https://x.com/MairavZ/status/1724673784639074550",
    "Date": "15/11/2023",
    "Text": "IDF has been operating overnight in the basement of Shifa hospital in Gaza, alongside eports of an imminent hostage release deal. So far, Israel has not shown clear evidence the hospitals are operating as Hamas command centers. It seems IDF is scrambling to find that evidence.",
    "Weight": 12,
    "Id": 133
},
{
    "URL": "https://x.com/30minuts/status/1724462983949021244",
    "Date": "14/11/2023",
    "Text": "\"Volen que siguem com animals\" \n\nAl reportatge \"Cisjordània, l'altra guerra\" l'activista \n@Issaamro\n ens mostra la realitat amb què viuen els palestins d'Hebron. Des de la guerra a Gaza, la situació encara ha empitjorat més\n\nA \n@som3cat\n \nhttp://ccma.cat/3cat/cisjordania-laltra-guerra/video/6250431/…",
    "Weight": 4,
    "Id": 134
},
{
    "URL": "https://x.com/Issaamro/status/1724417880828084444",
    "Date": "14/11/2023",
    "Text": "The Israeli soldiers are forcing the Palestinian detainees to stand up for the Israeli national anthem .\nThis video is another example of the mistreatment  of the Palestinian detainees. \nIt is another violation to the international law.",
    "Weight": 24,
    "Id": 135
},
{
    "URL": "https://x.com/Issaamro/status/1724352608100327925",
    "Date": "14/11/2023",
    "Text": "Watch how the Israeli military treat Palestinian detainees in West Bank.\nIt is against the international law. \nThey torture them, they dehumanize them and keep them naked.",
    "Weight": 12,
    "Id": 136
},
{
    "URL": "https://x.com/RamAbdu/status/1724330328351797487",
    "Date": "14/11/2023",
    "Text": "As rain & winter descend, my family like other Palestinians in Gaza suffers more. They are forced to live in tents & even in open areas. Many have lost their homes, their livelihoods, & their loved ones.\nThe international community and UN agencies failed them and left them alone.",
    "Weight": 12,
    "Id": 137
},
{
    "URL": "https://x.com/Issaamro/status/1724329555723231397",
    "Date": "14/11/2023",
    "Text": "Biden \n@POTUS\n will lose 2024 election because of his blind support to Israel \n\n@netanyahu\n was not loyal to his friend \n@realDonaldTrump\n, and he will not be loyal to Biden.",
    "Weight": 4,
    "Id": 138
},
{
    "URL": "https://x.com/Issaamro/status/1723750788420227511",
    "Date": "12/11/2023",
    "Text": "Terrorists Militia act with full impunity",
    "Weight": 10,
    "Id": 139
},
{
    "URL": "https://x.com/maximillian_alv/status/1723748207702712344",
    "Date": "12/11/2023",
    "Text": "HAPPENING TOMORROW: Midwest Jews Demand Ceasefire Now---Mass Action. Monday morning, Nov. 13, Jews from across the Midwest will come to Chicago to disrupt business as usual & demand the US call for an immediate ceasefire in Gaza. \n@jvplive\n \n@IfNotNowOrg\n \n@NeverAgainActn",
    "Weight": 12,
    "Id": 140
},
{
    "URL": "https://x.com/Issaamro/status/1723394594027475008",
    "Date": "11/11/2023",
    "Text": "Thanks to UK protestors, mass protests will end the war and make Palestine free. \nGo on go on \nWe are wining the public opinion all over the world, \nDear protestors : \nyou give us hope, energy and power to continue our struggle for freedom , and we will not give up our rights.",
    "Weight": 4,
    "Id": 141
},
{
    "URL": "https://x.com/inthesetimesmag/status/1723134613856411735",
    "Date": "11/11/2023",
    "Text": "\"I Want American Workers to Be United to Make the Occupation Costly, to Make the Israeli Apartheid Costly.\"\n\n\n@maximillian_alv\n interviews Palestinian activist \n@Issaamro\n for \n@WorkingPod\n. Issa calls on U.S. workers to fight for an end to the occupation.",
    "Weight": 22,
    "Id": 142
},
{
    "URL": "https://x.com/Issaamro/status/1722861590406414610",
    "Date": "10/11/2023",
    "Text": "Watch how Israeli soldiers used a Palestinian detainee as a Human Shield in Al Fawar Refugee camp in Hebron .",
    "Weight": 12,
    "Id": 143
},
{
    "URL": "https://x.com/Issaamro/status/1722858126230118849",
    "Date": "10/11/2023",
    "Text": "More than 2,660 people trapped under rubble with their fate uncertain including 1,350 children. \nThe ongoing Israeli bombing, fuel shortages, and limited civil defense capabilities are hindering rescue efforts.\n#ichr #GazaUnderAttack",
    "Weight": 12,
    "Id": 144
},
{
    "URL": "https://x.com/Issaamro/status/1722853846576226815",
    "Date": "10/11/2023",
    "Text": "Israeli leaders announced openly that they will kill Palestinian Journalists.",
    "Weight": 12,
    "Id": 145
},
{
    "URL": "https://x.com/Issaamro/status/1722208432173031872",
    "Date": "08/11/2023",
    "Text": "Palestinians in the West Bank say that while all the attention is on Gaza, Israeli settlers overseen by the military are killing people and forcing them from the land.",
    "Weight": 20,
    "Id": 146
},
{
    "URL": "https://x.com/Issaamro/status/1721981275404153014",
    "Date": "07/11/2023",
    "Text": "Thanks to \n@kthalps\n and \n@aaronjmate\n for interviewing me, it was very hard to tell them what happened to me and to many Palestinians in the last month.",
    "Weight": 8,
    "Id": 147
},
{
    "URL": "https://x.com/MiddleEastEye/status/1721911164119007523",
    "Date": "07/11/2023",
    "Text": "“Israel is not defending itself. Israel is defending its occupation, its apartheid and its supremacy,” human rights defender \n@Issaamro\n tells MEE.\n\nAmro, who lives in Hebron in the West Bank, says “since October 7, Israeli settler violence in the West Bank has increased 20 times\"",
    "Weight": 21,
    "Id": 148
},
{
    "URL": "https://x.com/ajplus/status/1721517308403761527",
    "Date": "06/11/2023",
    "Text": "Israel has killed over 10,000 Palestinians in Gaza. \n\nBabies who never celebrated a birthday. Child cancer survivors. Children who loved football and surfing. Entire families. \n\nThese are some of their names and faces.",
    "Weight": 16,
    "Id": 149
},
{
    "URL": "https://x.com/Issaamro/status/1721597005699404033",
    "Date": "06/11/2023",
    "Text": "According to our morals & principles,We don’t accept to target or justify targeting civilians, BUT we are targeted & mistreated badly.\nOnly a political peaceful solution according to http://int.law will reduce violence.\nPalestinians should get Equality, Justice, Freedom.",
    "Weight": 8,
    "Id": 150
},
{
    "URL": "https://x.com/Issaamro/status/1721406666569023608",
    "Date": "06/11/2023",
    "Text": "Israeli military arrested Ahed Tamimi from her house .",
    "Weight": 8,
    "Id": 151
},
{
    "URL": "https://x.com/Issaamro/status/1721406516501020820",
    "Date": "06/11/2023",
    "Text": "Israeli military is mistreating Palestinian detainees, Israel is violating the international law day after day without accountability . \nThe detainees are in the West Bank not in Gaza ,  it is  arbitrarily arrest.",
    "Weight": 20,
    "Id": 152
},
{
    "URL": "https://x.com/UsefulIdiotpod/status/1721191706463224069",
    "Date": "05/11/2023",
    "Text": "Palestinian activist \n@Issaamro\n sheds light on the unreported atrocities committed by Israel in the occupied West Bank.\n\nHear his story here:",
    "Weight": 8,
    "Id": 153
},
{
    "URL": "https://x.com/Issaamro/status/1720538531053903903",
    "Date": "03/11/2023",
    "Text": "Israeli airstrikes have hit three hospitals and 2 ambulances in the past 48 hours. This pattern is not new. It is systemic.",
    "Weight": 8,
    "Id": 154
},
{
    "URL": "https://x.com/JerseyPSC/status/1717608342460186906",
    "Date": "26/10/2023",
    "Text": "People of conscience use ur voices. Bear witness so Palestinians aren't genocided in the darkness. Do everything in ur power, because if we don't, how will we look at ourselves ever again. This sets a dangerous precedent if we allow this, who will be next?!\n\n#FreePalestine",
    "Weight": 17,
    "Id": 155
},
{
    "URL": "https://x.com/AJEPodcasts/status/1720441700718399970",
    "Date": "03/11/2023",
    "Text": "Palestinians of the occupied West Bank are facing a rise in Israeli settler violence backed by soldiers.\n\n#AJTheTake speaks to Palestinian activist \n@Issaamro\n, who was kidnapped, tortured and assaulted by armed settlers and soldiers: http://aj.audio/thetake-681",
    "Weight": 20,
    "Id": 156
},
{
    "URL": "https://x.com/Issaamro/status/1720456938880639065",
    "Date": "03/11/2023",
    "Text": "The horse and the ambulances were targeted today near Al Shifa hospital by three Israeli military  . \nMaybe Israeli military considers horses as a threat. \n\nIsrael is defending its occupation and apartheid .",
    "Weight": 25,
    "Id": 157
},
{
    "URL": "https://x.com/Issaamro/status/1719943906941423778",
    "Date": "02/11/2023",
    "Text": "Call for global action for Palestine . \nGlobal strike . \nNovember 6th. \nPlease share .",
    "Weight": 4,
    "Id": 158
},
{
    "URL": "https://x.com/Issaamro/status/1719943301770473572",
    "Date": "02/11/2023",
    "Text": "More videos of Israeli soldiers dehumanizing and torturing Palestinian detainees in West Bank .",
    "Weight": 12,
    "Id": 159
},
{
    "URL": "https://x.com/Issaamro/status/1719805351791329336",
    "Date": "01/11/2023",
    "Text": "More videos of Israeli soldiers dehumanizing Palestinian detainees, the detained man in the video is from West Bank .",
    "Weight": 12,
    "Id": 160
},
{
    "URL": "https://x.com/BenzionSanders/status/1719775501672161791",
    "Date": "01/11/2023",
    "Text": "One year ago Israel held elections.\n\nWe voted to “manage the conflict” and not solve it.\n\nWe voted for more settlements.\n\nWe voted to ignore the Palestinians.\n\nWe voted to live by the sword forever.\n\nWe voted for blood.",
    "Weight": 12,
    "Id": 161
},
{
    "URL": "https://x.com/Issaamro/status/1719732589055930618",
    "Date": "01/11/2023",
    "Text": "Palestinians walk in front of closed shop during a general strike protesting against Israeli air strikes on Jabalia in Gaza, in Hebron, in the Israeli-occupied West Bank, November 1, 2023. REUTERS/Mussa Qawasma\n#فلسطين #Palestine #Gaza",
    "Weight": 36,
    "Id": 162
},
{
    "URL": "https://x.com/Issaamro/status/1719332892608753828",
    "Date": "31/10/2023",
    "Text": "Shocking video .\nMore are videos coming out which shows how Palestinian workers  are detained and dehumanized by the Israeli military. \nThe majority of the detainees are tortured and dehumanized. I was one of them .",
    "Weight": 12,
    "Id": 163
},
{
    "URL": "https://x.com/Issaamro/status/1719284988787478967",
    "Date": "31/10/2023",
    "Text": "Watch the video clip . \nIsraeli soldiers continue dehumanizing Palestinian detainees, the majority of them are workers. \nSo Israel is not defending it self, it is defending its occupation and apartheid.",
    "Weight": 21,
    "Id": 164
},
{
    "URL": "https://x.com/BenzionSanders/status/1719254591223525708",
    "Date": "31/10/2023",
    "Text": "My government is degrading Holocaust victims in order to buy time to obliterate more of Gaza.",
    "Weight": 7,
    "Id": 165
},
{
    "URL": "https://x.com/Issaamro/status/1718575232716271671",
    "Date": "29/10/2023",
    "Text": "According to ministry of education, at least  2000 Palestinian students were killed by the Israeli occupation since October 7th. \nNo words can describe what is going on now in Gaza and West Bank .\nI underhand now why Palestinians left their homes , towns, villages in 1948",
    "Weight": 34,
    "Id": 166
},
{
    "URL": "https://x.com/Issaamro/status/1718306113966235789",
    "Date": "28/10/2023",
    "Text": "The anti war protesters are giving us hope, energy and we will not give up. \n\nPlease keep showing your solidarity with the Palestinian victims .",
    "Weight": 4,
    "Id": 167
},
{
    "URL": "https://x.com/YehudaShaul/status/1718189023594680745",
    "Date": "28/10/2023",
    "Text": "As the world's eyes are on Gaza, settlers in the West Bank continue to use the opportunity by escalating their terror attacks against Palestinians & their property.\n\nHere are just 3 settler attacks from yesterday in the South Hebron Hills. As usual, no arrests were made.",
    "Weight": 12,
    "Id": 168
},
{
    "URL": "https://x.com/Issaamro/status/1717973712446566436",
    "Date": "27/10/2023",
    "Text": "A total blackout...\nGaza had been cut off all internet & communications now...\nLord have Mercy ",
    "Weight": 4,
    "Id": 169
},
{
    "URL": "https://x.com/Issaamro/status/1717970353501167933",
    "Date": "27/10/2023",
    "Text": "We are very proud of our Jewish friends who are acting according to their Jewish values and Morals .",
    "Weight": 8,
    "Id": 170
},
{
    "URL": "https://x.com/Issaamro/status/1717887313022210465",
    "Date": "27/10/2023",
    "Text": "What Israel is doing against Pal civilians in Gaza is called Self REVENGE Not self defense.\nThe Israeli army is killing civilians,destroying  houses & buildings to revenge from Gaza.\nThey are using the Israeli settler terrorists Militia strategy of Price Tag.\nMake peace not War.",
    "Weight": 38,
    "Id": 171
},
{
    "URL": "https://x.com/Issaamro/status/1717843581564580034",
    "Date": "27/10/2023",
    "Text": "The Israeli military destroyed The site of journalist \n@ShireenAbuAkleh\n murder at the entrance to #Jenin refugee camp which has turned into a memorial. \n \nIts war on #Palestinians rights\n Israel  is defending its occupation, apartheid and supremacy.",
    "Weight": 25,
    "Id": 172
},
{
    "URL": "https://x.com/Issaamro/status/1717833454484590787",
    "Date": "27/10/2023",
    "Text": "The Israeli occupation forces removed the Palestinian flag from the flagpole of the public plaza at the town of Sebastia village near Nablus in West Bank .\n\nIt is another evidence that Israeli is not defending it self , Israel is defending its occupation and apartheid .",
    "Weight": 34,
    "Id": 173
},
{
    "URL": "https://x.com/catebrown12/status/1717633546947379213",
    "Date": "26/10/2023",
    "Text": "The \n@PalestineRCS\n has announced that it will be forced to shut down its ambulance services in #Gaza within 24 hours due to a lack of fuel. \n\n“We are packing ambulances with tens of people now, trying to save as many as we can,” says spox Nebal Farsakh.",
    "Weight": 8,
    "Id": 174
},
{
    "URL": "https://x.com/Issaamro/status/1717256166407913882",
    "Date": "25/10/2023",
    "Text": "The son and the daughter of Al-Jazeera’s chief correspondent in Gaza , they were trying to report about the situation in Gaza , both of them were killed with their mother . \nIt is war on civilians .",
    "Weight": 8,
    "Id": 175
},
{
    "URL": "https://x.com/Issaamro/status/1716672201665978385",
    "Date": "24/10/2023",
    "Text": "Since October 7th , Israel has killed at least 5,087 Palestinians in Gaza, including:\n2,055 children,\n18 journalists,\n49 medical workers,\n61 teachers,\nand 29 UN employees.\nSource \n@theIMEU",
    "Weight": 21,
    "Id": 176
},
{
    "URL": "https://x.com/Issaamro/status/1715971675735699522",
    "Date": "22/10/2023",
    "Text": "It is exactly what happened to me on October 7th when I was beaten and tortured by the Israeli soldiers and settlers.",
    "Weight": 13,
    "Id": 177
},
{
    "URL": "https://x.com/Issaamro/status/1715314963403751532",
    "Date": "20/10/2023",
    "Text": "Settlers violence in West Bank using the war on Gaza .",
    "Weight": 4,
    "Id": 178
},
{
    "URL": "https://x.com/MairavZ/status/1715061704474644659",
    "Date": "19/10/2023",
    "Text": "Think about the fact that before this war, dozens of top former Israeli security officials who worked with  Netanyahu, among them former head of Mossad, came out publicly saying he cannot be trusted. And now he is running the most fateful war Israel has faced in decades",
    "Weight": 12,
    "Id": 179
},
{
    "URL": "https://x.com/Issaamro/status/1715051897634140297",
    "Date": "19/10/2023",
    "Text": "Happening now : \nWe are in lockdown and curfew in Hebron, Palestinian families don’t have enough food and terrified , in the other hand Israeli soldiers are dancing with very loud music. \nStop the war \nStop displacing Palestinian from their land.",
    "Weight": 16,
    "Id": 180
},
{
    "URL": "https://x.com/democracynow/status/1714996997998903566",
    "Date": "19/10/2023",
    "Text": "Veteran Haaretz journalist Amira Hass has reported from the Occupied Palestinian Territories for decades and says the Israeli public is \"drunk with the will to take revenge\" on Palestinians, spurred on by a far-right government dominated by \"extreme fascist settlers.\"",
    "Weight": 20,
    "Id": 181
},
{
    "URL": "https://x.com/alextomo/status/1714670858914894046",
    "Date": "18/10/2023",
    "Text": "Several experts confirm Hamas’ view to \n@Channel4News\n that the audio tape of “Hamas” operatives talking about the missile malfunction is a fake . They say the tone, syntax, accent and idiom are absurd.",
    "Weight": 8,
    "Id": 182
},
{
    "URL": "https://x.com/Issaamro/status/1714594091273433137",
    "Date": "18/10/2023",
    "Text": "Israeli military is dehumanizing & TORTURING Palestinian detainees in the West Bank,they are using the war to practice their supremacy\nIt is exactly what happened to me on Oct 7th when I was tortured by the soldiers& settlers for 10h.\nEnd the War\nEnd the occupation and apartheid.",
    "Weight": 17,
    "Id": 183
},
{
    "URL": "https://x.com/Issaamro/status/1714337807919911129",
    "Date": "17/10/2023",
    "Text": "They just bombed a hospital in Gaza , around 500 civilians lost their lives. \nIt is a war crime to justify killing the civilians in hospitals.\nStop the war now .",
    "Weight": 9,
    "Id": 184
},
{
    "URL": "https://x.com/Issaamro/status/1714167062526939242",
    "Date": "17/10/2023",
    "Text": "Israel is asking United States for 10 Billion dollars as emergency Aid,to use it to strengthen the occupation & apartheid, to kill as many Palestinian civilians as possible.\n\nWhy Israel needs the West only during the wars?,but doesn’t listen when  they ask to end the occupation.",
    "Weight": 22,
    "Id": 185
},
{
    "URL": "https://x.com/Issaamro/status/1713883001602416868",
    "Date": "16/10/2023",
    "Text": "It is not only me, all the families are suffering locked in their homes, it is curfew in Hebron/H2, settlers are using the war to terrify Palestinians civilians.",
    "Weight": 8,
    "Id": 186
},
{
    "URL": "https://x.com/Issaamro/status/1713882731594055882",
    "Date": "16/10/2023",
    "Text": "Israeli settlers in an army uniform raided my houses yard two times in the last 48 hours, they damaged my free Palestine sign, and other staff, they tried to break in to the house, I refused to open.\nYesterday I was detained and attacked, I am not allowed to leave the house now.",
    "Weight": 12,
    "Id": 187
},
{
    "URL": "https://x.com/Issaamro/status/1713536992183529905",
    "Date": "15/10/2023",
    "Text": "Happening now in Hebron:\nThe Israeli settlers are taking over a Palestinian private property in Tal Rumieda in Hebron.\nIt was used by the Palestinian owners as a metal factory, it was closed by the Israeli military after the Ibrahimi mosque massacre on 1994.",
    "Weight": 24,
    "Id": 188
},
{
    "URL": "https://x.com/Issaamro/status/1713199209090887983",
    "Date": "14/10/2023",
    "Text": "5 years old Jenna talks about life in Gaza now. She is Palestinian Indian, with British citizenship. \ndog land.'* Jenna is talking about the place where dogs live,\nDemand the bombing of Gaza stop, \nmovement of medical supplies, food and water and civilians.*",
    "Weight": 12,
    "Id": 189
},
{
    "URL": "https://x.com/FranceskAlbs/status/1713183214674518228",
    "Date": "14/10/2023",
    "Text": "URGENT- Mass forced displacement of Palestinians has occurred in 1947/49 and 1967, and continued ever since, in less visible but not less painful forms. This time it risks to be as cruel as ever, under our watch, with some member states even risking to enable it. #CeasefireNow.",
    "Weight": 8,
    "Id": 190
},
{
    "URL": "https://x.com/Issaamro/status/1713169133427175598",
    "Date": "14/10/2023",
    "Text": "The Israeli military is bombing the hostages in Gaza , another 9 were killed. \nStop the war and save the lives of the civilians.\n\nIt is a war crime not defense .",
    "Weight": 17,
    "Id": 191
},
{
    "URL": "https://x.com/Issaamro/status/1713157858085257533",
    "Date": "14/10/2023",
    "Text": "Israel has been explicit about what it’s carrying out in Gaza. Why isn’t the world listening?",
    "Weight": 8,
    "Id": 192
},
{
    "URL": "https://x.com/nour_odeh/status/1712860530694561946",
    "Date": "13/10/2023",
    "Text": " Health ministry in Gaza confirms: 40 people were killed, 150 injured by an Israeli airstrike that targeted Palestinians attempting to evacuate from Gaza, as ordered by the Israeli army. Israel had ordered 1.2 million Palestinians to leave their homes in Gaza and head south.",
    "Weight": 48,
    "Id": 193
},
{
    "URL": "https://x.com/Issaamro/status/1712827547975655652",
    "Date": "13/10/2023",
    "Text": "Today Friday October 13th: \n\n9 Palestinian civilians were killed in West bank by the Israeli military .",
    "Weight": 12,
    "Id": 194
},
{
    "URL": "https://x.com/LaraFriedmanDC/status/1712805583324127693",
    "Date": "13/10/2023",
    "Text": "We are watching Israel commit large scale genocide/ethnic cleansing in real time, with the US govt and much of the organized Jewish community justifying it, defending it, materially supporting it, celebrating it and quite literally cheering it on.",
    "Weight": 13,
    "Id": 195
},
{
    "URL": "https://x.com/Issaamro/status/1712796883121254910",
    "Date": "13/10/2023",
    "Text": "Israeli Settler terrorist in the A-Tuwani -Hebron just shot a Palestinian civilian  in his own village. The settler was escorted by Israeli soldiers. \n\nWho protects the Palestinian civilians from Israeli Jewish supremacy ???!!\n\n\n@SecBlinken\n \n@USAbilAraby\n \n@amnestyusa",
    "Weight": 41,
    "Id": 196
},
{
    "URL": "https://x.com/Issaamro/status/1712771003791626370",
    "Date": "13/10/2023",
    "Text": "Israel is not defending it self nor its existence, in the contrary  Palestinian people are losing their land & identity.\nWe are losing our existence & our dream of freedom. \nIsraeli government is using the opportunity to do another NAKBA.\n\nDon’t let them do that. Show solidarity.",
    "Weight": 16,
    "Id": 197
},
{
    "URL": "https://x.com/Issaamro/status/1712742122061725912",
    "Date": "13/10/2023",
    "Text": "The crazy Israeli extremists government is killing the Israeli hostages in Gaza. \n\nIt is crazy army in a crazy world.",
    "Weight": 20,
    "Id": 198
},
{
    "URL": "https://x.com/Issaamro/status/1712719464431575097",
    "Date": "13/10/2023",
    "Text": "The Israeli military announced  a curfew in H2 in Hebron, the Palestinian families can’t leave their homes to get food, the checkpoints are closed since Saturday. \n\nCollective punishments and war crimes .",
    "Weight": 24,
    "Id": 199
},
{
    "URL": "https://x.com/Issaamro/status/1712696821519188190",
    "Date": "13/10/2023",
    "Text": "The Israeli occupation is targeting Palestinian civilians  in #Gaza especially children to revenge and to get back their ego. \n\n447 children and 248 women among 1,417 killed in Israeli strikes in Gaza. Reuters.",
    "Weight": 33,
    "Id": 200
},
{
    "URL": "https://x.com/Issaamro/status/1712499555080499415",
    "Date": "12/10/2023",
    "Text": "GAZA UPDATE 12-10-2023 : \n\n447 Palestinian children have been killed by Israeli airstrikes in Gaza, \n\nTargeting any civilian is a war crime. \n\nStop the war, make peace by ending the occupation and apartheid . \n \nPeace is always possible and it guarantees  sustainable security.",
    "Weight": 30,
    "Id": 201
},
{
    "URL": "https://x.com/Issaamro/status/1712199886203167077",
    "Date": "11/10/2023",
    "Text": "This is why we still have occupation and apartheid  and violence .",
    "Weight": 5,
    "Id": 202
},
{
    "URL": "https://x.com/Issaamro/status/1712162570537185488",
    "Date": "11/10/2023",
    "Text": "1100 killed in Gaza \n27 killed in West Bank",
    "Weight": 4,
    "Id": 203
},
{
    "URL": "https://x.com/Issaamro/status/1712162545027440853",
    "Date": "11/10/2023",
    "Text": "My interview with the Sky news , it was very hard to explain what is happening to us . It is very hard to describe the fairly life under the Israeli occupation and apartheid .",
    "Weight": 13,
    "Id": 204
},
{
    "URL": "https://x.com/Issaamro/status/1712142174765166666",
    "Date": "11/10/2023",
    "Text": "Ministry of Health in Gaza: \n4 paramedics were killed in an Israeli air strike that targeted an ambulance in Gaza today. 11.10.23",
    "Weight": 16,
    "Id": 205
},
{
    "URL": "https://x.com/Issaamro/status/1712129718554652977",
    "Date": "11/10/2023",
    "Text": "They are denying the occupation ???",
    "Weight": 5,
    "Id": 206
},
{
    "URL": "https://x.com/RamAbdu/status/1711324660636209372",
    "Date": "09/10/2023",
    "Text": "Literally dozens of dead bodies are being evacuated from Jabalia refugee camp's central market bombed by Israel shortly ago. Those are people who Israel instructed to move to the UNRWA schools located there. \n@Belalmd12",
    "Weight": 8,
    "Id": 207
},
{
    "URL": "https://x.com/Issaamro/status/1711983375886561772",
    "Date": "11/10/2023",
    "Text": "The Israeli (moral) army is destroying Gaza Strip, The army is killing palestinian civilians in purpose to revenge of the massacre Hamas did.\n2.3M people who are living without basic rights are facing fear and death because the Israeli army was defeated and they want to revenge.",
    "Weight": 28,
    "Id": 208
},
{
    "URL": "https://x.com/Issaamro/status/1711809114236461418",
    "Date": "10/10/2023",
    "Text": "Why they destroy business in Gaza ???!!!",
    "Weight": 4,
    "Id": 209
},
{
    "URL": "https://x.com/Issaamro/status/1711803789257191854",
    "Date": "10/10/2023",
    "Text": "GAZA UPDATE: Israeli airstrikes have killed at least 140 Palestinian children in Gaza since October 7. \n@DCIPalestine\n has documented the killings of 74 Palestinian children so far. Among the dead: 10-year-old Yazan Shamlakh and his baby brothers. http://dci-palestine.org/israeli_airstr…",
    "Weight": 40,
    "Id": 210
},
{
    "URL": "https://x.com/Issaamro/status/1711777373912285516",
    "Date": "10/10/2023",
    "Text": "They were killed with their mom in Gaza , their mom was a famous journalist , the father was killed too \n\nIsraeli leaders are war criminals, what they are doing now is to revenge from civilians and it is collective punishment. \n\nThey are very strong only against civilians.",
    "Weight": 12,
    "Id": 211
},
{
    "URL": "https://x.com/Lowkey0nline/status/1711752898151899499",
    "Date": "10/10/2023",
    "Text": "Netanyahu told people to leave Gaza then bombed the only possible crossing they could leave from...\n\nSadistic.",
    "Weight": 4,
    "Id": 212
},
{
    "URL": "https://x.com/Issaamro/status/1711654189300875595",
    "Date": "10/10/2023",
    "Text": "War crimes are announced by the Israeli military spokes person.",
    "Weight": 20,
    "Id": 213
},
{
    "URL": "https://x.com/Issaamro/status/1711417418868748783",
    "Date": "09/10/2023",
    "Text": "They are children too, Palestinian children deserve protection. \nTargeting civilians is a war crime, Israel is trying to revenge by killing as many Palestinian civilians as possible. \nIt is genocide .",
    "Weight": 22,
    "Id": 214
},
{
    "URL": "https://x.com/SaulStaniforth/status/1711366712396841016",
    "Date": "09/10/2023",
    "Text": "Sky presenter: \"In terms of achieving an end to the occupation, as you call it...\"\n\nwhat?\n\n\n@Issaamro\n has to explain its not him calling it an occupation, its international law! Amro goes on to call out the media for its double standards",
    "Weight": 10,
    "Id": 215
},
{
    "URL": "https://x.com/Issaamro/status/1711412084016066893",
    "Date": "09/10/2023",
    "Text": "Israeli Minister of Defense Yoav Gallant says he has given an order for Gaza’s “complete siege.” No electricity, No food, No fuel or water will be delivered to the enclave, 2.3 million Palestinians with nowhere to go. Facing death.\nIsrael is revenging by targeting Pal civilians.",
    "Weight": 24,
    "Id": 216
},
{
    "URL": "https://x.com/Issaamro/status/1711276267490725993",
    "Date": "09/10/2023",
    "Text": "Ministry of Health: \n436 Palestinians killed, including \n91 children\n 61 women\n2271 others injured in the lsraeli aggression on Gaza Strip. \nStop the war, end the occupation.",
    "Weight": 17,
    "Id": 217
},
{
    "URL": "https://x.com/Issaamro/status/1711270792443372020",
    "Date": "09/10/2023",
    "Text": "They are civilians too, watch the photos very well to remember that we are all born equal and deserve the same rights . \nStop you blindfolded coverage.\nThe Israel weak  army can only kill Palestinian civilians. Especially children.",
    "Weight": 8,
    "Id": 218
},
{
    "URL": "https://x.com/Issaamro/status/1711266811352617386",
    "Date": "09/10/2023",
    "Text": "We are civilians too, do you count Palestinians as civilians????. Do you recognize Palestinians as human beings who deserve security, human rights, freedom , justice, equality and homeland.\nJust peace with full equality will give all of us safety and we can build a better future",
    "Weight": 16,
    "Id": 219
},
{
    "URL": "https://x.com/Issaamro/status/1711227091918733563",
    "Date": "09/10/2023",
    "Text": "They are suppose to die ? The Israeli revenge army can target only civilians",
    "Weight": 8,
    "Id": 220
},
{
    "URL": "https://x.com/DrRoundglasses/status/1710984945714303053",
    "Date": "08/10/2023",
    "Text": "Israel's longest running paper blames its Prime Minister for violence by 'establishing a government of annexation & dispossession..while embracing a foreign policy that openly ignored the existence & rights of Palestinians'\n\nSuch views censored in UK media",
    "Weight": 12,
    "Id": 221
},
{
    "URL": "https://x.com/Issaamro/status/1711083541197459758",
    "Date": "08/10/2023",
    "Text": "Israel is targeting civilians in Gaza as a revenge .\nThe Israeli army can kill civilians only. They show their power on them . \nFor sure no one should target civilians, all civilians should be protected during wars. \nAnd Israel must end its occupation and apartheid very soon.",
    "Weight": 25,
    "Id": 222
},
{
    "URL": "https://x.com/Issaamro/status/1710972483174543468",
    "Date": "08/10/2023",
    "Text": "Yesterday during my detention by the Israeli soldiers & settlers in Tal Rumieda, I experienced high level of hate&supremacy , I experienced what it means no mercy & no accountability. \nI experienced the real torture.\nI experienced the real face of Israeli occupation and apartheid",
    "Weight": 21,
    "Id": 223
},
{
    "URL": "https://x.com/Issaamro/status/1707446516032401595",
    "Date": "28/09/2023",
    "Text": "Happy Jewish holidays for my Jewish friends who believe in ending the Israeli occupation and apartheid .",
    "Weight": 21,
    "Id": 224
},
{
    "URL": "https://x.com/btselem/status/1706939041919189184",
    "Date": "27/09/2023",
    "Text": "\"In their latest publication, human rights group B’Tselem says Israel is using settler pogroms to carry out the forcible transfer of Palestinians in the occupied West Bank - a war crime under international law.\"",
    "Weight": 17,
    "Id": 225
},
{
    "URL": "https://x.com/Issaamro/status/1700174931281981843",
    "Date": "08/09/2023",
    "Text": "The majority of Palestinians are asking him to resign, because of corruption, dictatorship and human rights violations. \nNo one raised these things before his history denial . \nPlease take us in consideration when you create your opinion about any leader.",
    "Weight": 8,
    "Id": 226
},
{
    "URL": "https://x.com/Issaamro/status/1700104707371352499",
    "Date": "08/09/2023",
    "Text": "Happening now, Israeli settler threw stones at me today in front of the soldiers. \nWatch the video clip .",
    "Weight": 8,
    "Id": 227
},
{
    "URL": "https://x.com/mehdirhasan/status/1698502962270679343",
    "Date": "04/09/2023",
    "Text": "Forget Israel's critics: Israel's own far-right government ministers keep admitting, again and again, that their country is guilty of apartheid and racism.\n\nI brought receipts from just the past couple of weeks, on tonight's \n@MehdiHasanShow\n.\n\nWatch/share:",
    "Weight": 8,
    "Id": 228
},
{
    "URL": "https://x.com/Issaamro/status/1697975439862440374",
    "Date": "02/09/2023",
    "Text": "You are welcome to join our olive harvest campaign in Hebron, give Palestinian farmers your hands and your protection.  your solidarity with Palestinians will make the Israeli occupation and apartheid end soon.",
    "Weight": 25,
    "Id": 229
},
{
    "URL": "https://x.com/Issaamro/status/1697494232078881132",
    "Date": "01/09/2023",
    "Text": "645 movement obstacles are spread across the West Bank\n-49 constantly staffed\n-139 intermittently staffed\n-304 roadblocks,road gates\n-73 earth walls, road barriers & trenches.\n\n80 additional obstacles of various types within the Israeli-controlled area of Hebron (H2).\n\nOCHA",
    "Weight": 8,
    "Id": 230
},
{
    "URL": "https://x.com/Issaamro/status/1695855171253817486",
    "Date": "27/08/2023",
    "Text": "Today while I was showing the Australian tv the situation in Hebron, we got a bear bottle which was thrown by the  Israeli settlers, I was hit slightly . And then we were harassed and detained at the checkpoint by an Israeli fanatic soldier.",
    "Weight": 16,
    "Id": 231
},
{
    "URL": "https://x.com/Issaamro/status/1695853006153982411",
    "Date": "27/08/2023",
    "Text": "Israeli settlers hate graphite in shuhada street in Hebron, “kill the Arabs , “Revenge”, David star on Palestinian houses .",
    "Weight": 12,
    "Id": 232
},
{
    "URL": "https://x.com/Issaamro/status/1695409002358710616",
    "Date": "26/08/2023",
    "Text": "We want to get equal rights as everyone else even as \n@itamarbengvir\n . We don’t want more than anyone else.\nHe was honest with his racism, he exposed the Israeli Jewish supremacy from the river to the sea.",
    "Weight": 12,
    "Id": 233
},
{
    "URL": "https://x.com/BtSIsrael/status/1693193629227962700",
    "Date": "20/08/2023",
    "Text": "Proud of our friend and partner \n@Issaamro\n \n\nhttps://thenation.com/article/activism/issa-amro-hebron-palestine-tour-youth-against-settlements/…",
    "Weight": 4,
    "Id": 234
},
{
    "URL": "https://x.com/IfNotNowOrg/status/1692585819465306463",
    "Date": "18/08/2023",
    "Text": "Yesterday, IfNotNow and \n@JvpAction\n members confronted Rep. Dan Goldman about his participation in an AIPAC-sponsored trip to Israel last week. \n\nGoldman repeatedly refused to disavow AIPAC, claiming that AIPAC is a “force for good”, as it continues to back far-right extremists.",
    "Weight": 4,
    "Id": 235
},
{
    "URL": "https://x.com/ochaopt/status/1692241178551312616",
    "Date": "17/08/2023",
    "Text": "The #WestBank elementary school of Ein Samiya was demolished today by the Israeli authorities.\n\nListen to this press briefing by \n@UN_Spokesperson\n.\n\nMore information: http://ochaopt.org/content/elementary-school-ein-samiya-demolished…",
    "Weight": 8,
    "Id": 236
},
{
    "URL": "https://x.com/theiachatelle/status/1692240041752330425",
    "Date": "17/08/2023",
    "Text": "Latest in \n@thenation\n, thank you to \n@Julian_Epp\n for all your help with the piece. \n\nSpoke with \n@Issaamro\n about all things Hebron, the Israeli occupation, and nonviolent resistance. \n\nhttps://thenation.com/article/activism/issa-amro-hebron-palestine-tour-youth-against-settlements/…",
    "Weight": 17,
    "Id": 237
},
{
    "URL": "https://x.com/Issaamro/status/1691746525192327229",
    "Date": "16/08/2023",
    "Text": "Israeli bus driver orders girls to 'cover up' and sit at the back of the bus",
    "Weight": 8,
    "Id": 238
},
{
    "URL": "https://x.com/Issaamro/status/1691746328009728361",
    "Date": "16/08/2023",
    "Text": "Israeli bus driver orders girls to 'cover up' and sit at the back of the bus",
    "Weight": 8,
    "Id": 239
},
{
    "URL": "https://x.com/Issaamro/status/1691148013484257303",
    "Date": "14/08/2023",
    "Text": "Today, the Israeli military tried to stop us from bringing in construction materials to do maintenance to our houses. But they help settlers to build illegal settlements. \nBut we never give up our rights.",
    "Weight": 8,
    "Id": 240
},
{
    "URL": "https://x.com/btselem/status/1689573830807715842",
    "Date": "10/08/2023",
    "Text": "This is an emergency! Forcible transfer is happening right now in the West Bank. Israel successfully expels more and more Palestinians from their homes using settler violence. In three months, four communities have been expelled. >",
    "Weight": 12,
    "Id": 241
},
{
    "URL": "https://x.com/Issaamro/status/1689155780304322560",
    "Date": "09/08/2023",
    "Text": "The Israeli settler who killed a Palestinian was released from jail, it is apartheid and Jewish supremacy.",
    "Weight": 16,
    "Id": 242
},
{
    "URL": "https://x.com/Issaamro/status/1688942134064209920",
    "Date": "08/08/2023",
    "Text": "'Heroes': Ben Gvir defends settlers suspected of killing Palestinian https://middleeasteye.net/news/israel-palestine-ben-gvir-defends-settlers-suspected-killing…",
    "Weight": 12,
    "Id": 243
},
{
    "URL": "https://x.com/IfNotNowOrg/status/1687559488033738752",
    "Date": "04/08/2023",
    "Text": "Our hearts are with the family of Qosai Jammal Mi’tan, who was murdered by settlers in the West Bank, and we’re wishing a speedy and full recovery to the four people injured in the attack. This state-backed settler violence against Palestinians must end.",
    "Weight": 8,
    "Id": 244
},
{
    "URL": "https://x.com/JessicaMontell/status/1686317817010798592",
    "Date": "01/08/2023",
    "Text": "The most important article you can read today: \n@aboxerman1\n & \n@adamrasgon\n's deep dive profile of Palestinian Minister Hussein al-Sheikh & the role he, and the PA more broadly, play in maintaining the Israeli occupation.",
    "Weight": 17,
    "Id": 245
},
{
    "URL": "https://x.com/KatieHalperShow/status/1598157250514014208",
    "Date": "01/12/2022",
    "Text": "\"Issa Amro is a brilliant Palestinian human rights defender who has established the most effective grass roots org in Palestine. The settlers who live next to him, these Kahana types,they want him dead.\"-\n@MikoPeled\n on \n@IssaAmro\n  #MikoPeled #IssaAmro \n\nfull\nhttps://youtube.com/watch?v=dNbpdFmjb6w…",
    "Weight": 8,
    "Id": 246
},
{
    "URL": "https://x.com/Issaamro/status/1685896340503400449",
    "Date": "31/07/2023",
    "Text": "Israeli settlers in Hebron threw empty beer bottles toward Palestinian houses .",
    "Weight": 12,
    "Id": 247
},
{
    "URL": "https://x.com/LaraFriedmanDC/status/1684965807007182850",
    "Date": "28/07/2023",
    "Text": "I Was Attacked for My Speech About Palestine. I Stand by Every Word. - Fatima Mohammed\n\n\"My CUNY Law speech led to a torrent of abuse and vitriol, but I have no regrets.\"",
    "Weight": 4,
    "Id": 248
},
{
    "URL": "https://x.com/theIMEU/status/1682071742947430400",
    "Date": "20/07/2023",
    "Text": "NEW: Medical Aid for Palestinians has announced it will be supplying Palestinian paramedics with bulletproof vests and helmets.\n\nWhy? Because the Israeli military has been shooting at paramedics who try to help Palestinians injured by Israeli soldiers.",
    "Weight": 36,
    "Id": 249
},
{
    "URL": "https://x.com/caliactivist/status/1682066791798026240",
    "Date": "20/07/2023",
    "Text": "UN experts condemn forced eviction of east Jerusalem families by Israeli gov 'It is deeply shocking and heartbreaking to see Nora & Mustafa Sub Laban,  evicted from their family home where they have lived all their lives and raised their children,' https://shar.es/afPWx8",
    "Weight": 8,
    "Id": 250
},
{
    "URL": "https://x.com/Issaamro/status/1680146678169456640",
    "Date": "15/07/2023",
    "Text": "The Palestinian authority arrested the journalist Aqil Awawda for criticising the PA leadership .",
    "Weight": 4,
    "Id": 251
},
{
    "URL": "https://x.com/Issaamro/status/1678727117121417217",
    "Date": "11/07/2023",
    "Text": "I saw this coming Lara, I told many Israeli delegations in the past, everything happening in the occupied territories will be in Israel soon , Hebron model will be implemented from the river to the sea.",
    "Weight": 12,
    "Id": 252
},
{
    "URL": "https://x.com/Issaamro/status/1677422406833520645",
    "Date": "07/07/2023",
    "Text": "I am not whitewashing anyone, I write my opinion according to my experience with people.\nyou can come to Palestine now, I want to see you facing the soldiers and the settlers on the ground.\nYou do nothing to help our Summod, you only care about yourself, you are ignorant.",
    "Weight": 4,
    "Id": 253
},
{
    "URL": "https://x.com/BenzionSanders/status/1677307191135444992",
    "Date": "07/07/2023",
    "Text": "Apparently the \n@IDF\n is capable of using force against Israelis, as they did today when 400 Israelis marched against the Homesh outpost built on Palestinian land.\n\nWhere were they in Huwara?\nWhere were they in Umm Safa?\nWhere were they in Turmus Aya?\nWhere were they in Urif?",
    "Weight": 26,
    "Id": 254
},
{
    "URL": "https://x.com/Issaamro/status/1676980337237172226",
    "Date": "06/07/2023",
    "Text": "Dear Elizabeth , I hope that you are safe and come back to fight the occupation and apartheid with us. \n\nYou volunteered many times in Hebron to expose the occupation. \n Kidnapping her is very wrong and will not help any cause.",
    "Weight": 10,
    "Id": 255
},
{
    "URL": "https://x.com/DalalIRIQAT/status/1676958158869372930",
    "Date": "06/07/2023",
    "Text": "The accused is innocent until proven guilty, when it comes to the Israeli occupation at trails of Israeli officers, they r innocent &will definitely be proven innocent!Today, policeman who murdered in cold blood child #Iyad_alHallaq 3 yrs ago #Jerusalem was declared innocent!",
    "Weight": 21,
    "Id": 256
},
{
    "URL": "https://x.com/Issaamro/status/1676939322493157378",
    "Date": "06/07/2023",
    "Text": "Today, I was threatened to be arrested for trying to prevent the Israeli settlers \nFrom building an illegal outpost in a private Palestinian land in Hebron, the soldiers escorted the  settlers.\nIt is #nahal brigade army unit who are from leftest background in Israel.",
    "Weight": 16,
    "Id": 257
},
{
    "URL": "https://x.com/Issaamro/status/1676609210165895170",
    "Date": "05/07/2023",
    "Text": "Happening now, I am detained with my 11 years old son“Watan”at the main checkpoint in Hebron ,We were going home. they want Watan to pass via the metal detector, the army commander was trying to Harass him. \nIt Is #nahal army brigade . They are from leftest background in Israel.",
    "Weight": 4,
    "Id": 258
},
{
    "URL": "https://x.com/Issaamro/status/1676605587465945091",
    "Date": "05/07/2023",
    "Text": "Israeli soldiers from the racist army unit #Nahal detained my 11 years old child when we were passing to go home. \nNahal soldiers usually from Israeli leftest families.",
    "Weight": 16,
    "Id": 259
},
{
    "URL": "https://x.com/nour_odeh/status/1676368709542084608",
    "Date": "04/07/2023",
    "Text": "WARNING: GRAPHIC video from inside the Jenin refugee camp has emerged showing an unsuspecting unarmed Palestinian youth shot in the neck. He stumbles, tries to get to safety then falls to the ground. A cold-blooded execution. Video was shared by residents/music from the source",
    "Weight": 4,
    "Id": 260
},
{
    "URL": "https://x.com/Issaamro/status/1676179567491567624",
    "Date": "04/07/2023",
    "Text": "Thanks to \n@washingtonpost\n for the covering the truth from Palestine.",
    "Weight": 4,
    "Id": 261
},
{
    "URL": "https://x.com/Issaamro/status/1675951778792108032",
    "Date": "03/07/2023",
    "Text": "Palestinian refugees from 1948, became refugees again in 2023. \nThe families had to leave their homes again to escape the the Israel military raid in Jenin camp. \nStop the war on #Jenin civilians.",
    "Weight": 8,
    "Id": 262
},
{
    "URL": "https://x.com/Issaamro/status/1673778395962900480",
    "Date": "27/06/2023",
    "Text": "Occupation and apartheid are making everything dirty, even the minds of many humans from the river to the sea . \nThis is my answer to the advisor of \n@itamarbengvir\n , who claims that he is making the land looks nicer .",
    "Weight": 5,
    "Id": 263
},
{
    "URL": "https://x.com/Issaamro/status/1673701847863836673",
    "Date": "27/06/2023",
    "Text": "And I offer him a Palestinian meal in lot house in Tal Rummieda  and a tour .",
    "Weight": 4,
    "Id": 264
},
{
    "URL": "https://x.com/Issaamro/status/1673628864885448705",
    "Date": "27/06/2023",
    "Text": "American volunteers came to help Israeli settlers steal our land in Hebron, they claim that they are making it nicer, it is going to much nicer without Israeli occupation and apartheid.",
    "Weight": 21,
    "Id": 265
},
{
    "URL": "https://x.com/Issaamro/status/1673627417733214209",
    "Date": "27/06/2023",
    "Text": "#American volunteers came to my city Hebron to help the Israeli settlers take over my land.\nThey started working in private Palestinian land to clean the path for the Israeli settler.",
    "Weight": 20,
    "Id": 266
},
{
    "URL": "https://x.com/BtSIsrael/status/1673615592413069315",
    "Date": "27/06/2023",
    "Text": "From @OriNir_APN in the \n@nytimes\n: \n\n\"In some recent attacks, Israeli military and police officers have even been documented standing idly by as settlers stormed and burned Palestinian villages.\"\n\nRead the whole article\nhttps://nytimes.com/2023/06/26/opinion/international-world/west-bank-israel-palestine.html…?",
    "Weight": 20,
    "Id": 267
},
{
    "URL": "https://x.com/Issaamro/status/1672856333962420225",
    "Date": "25/06/2023",
    "Text": "Very scary dark future , the Jewish terrorists militia appears in West Bank streets, they were working under cover in the past, now they work during the light and don’t care to be filmed, they have \n@itamarbengvir\n backing them up from the government.",
    "Weight": 14,
    "Id": 268
},
{
    "URL": "https://x.com/Issaamro/status/1671883698491506689",
    "Date": "22/06/2023",
    "Text": "Israeli settlers violence against Palestinians with full impunity.",
    "Weight": 16,
    "Id": 269
},
{
    "URL": "https://x.com/Issaamro/status/1670920273929838596",
    "Date": "19/06/2023",
    "Text": "'Silent transfer': How Israeli settlers are launching a second Nakba | Middle East Eye",
    "Weight": 8,
    "Id": 270
},
{
    "URL": "https://x.com/btselem/status/1669281739401830400",
    "Date": "15/06/2023",
    "Text": "CNN: \"Israel’s military called the settler attack on this Palestinian town a ‘pogrom.’ Videos show soldiers did little to stop it\"\n\nSettler violence is state violence.",
    "Weight": 8,
    "Id": 271
},
{
    "URL": "https://x.com/PalMissionUK/status/1669238237976489984",
    "Date": "15/06/2023",
    "Text": "The Israeli justice system isn’t morally or practically fit for anything other than legitimising the killing of Palestinian civilians.",
    "Weight": 12,
    "Id": 272
},
{
    "URL": "https://x.com/caliactivist/status/1667229088405409793",
    "Date": "09/06/2023",
    "Text": "Today is a great day to ask all members of the Progressive Caucus to co-sponsor H.R. 3103 — Defending the Human Rights of Palestinian Children and Families Living Under Israeli Military Occupation Act. \n@JVPBayArea\n \n@JVPSanDiego\n \n@JVPSeattle\n \n@jvpliveNY",
    "Weight": 17,
    "Id": 273
},
{
    "URL": "https://x.com/Issaamro/status/1666902285165772801",
    "Date": "08/06/2023",
    "Text": "When they started the planning, they told the court that Palestinians will use the elevator , now they don’t want Palestinians to use it. One side elevator . It is apartheid.",
    "Weight": 16,
    "Id": 274
},
{
    "URL": "https://x.com/Issaamro/status/1666866506943037457",
    "Date": "08/06/2023",
    "Text": "The Palestinian Intelligence forces headed by Majid Faraj refused to implement the Palestinian court decision to release the Pal anti corruption activist Fajar Alrantesi. Who is working in Aman NGO. \nMajid Faraj is responsible about restricting our free speeches.\n \n@GermanRepRama",
    "Weight": 8,
    "Id": 275
},
{
    "URL": "https://x.com/Issaamro/status/1665997533351407616",
    "Date": "06/06/2023",
    "Text": "The Israeli occupation make the life of the Palestinians in Hebron very hard by closing the main streets, we do help the families to walk via the fields to reach their homes safe, today we organise an action to clean the path.\nWe work the land because we are the owners.",
    "Weight": 21,
    "Id": 276
},
{
    "URL": "https://x.com/Issaamro/status/1665725449752780803",
    "Date": "05/06/2023",
    "Text": "The Israeli military killed  Mohammed Tamimi (2 years old ) near the town of Nabi Saleh, Ramallah\n\nThe Israeli military first accused Palestinians, but hours later backtracked and admitted that they killed him.\n\nWe are facing ethnic cleansing.",
    "Weight": 24,
    "Id": 277
},
{
    "URL": "https://x.com/Issaamro/status/1665593717221212160",
    "Date": "05/06/2023",
    "Text": "It is very hard to live normal life under Israeli occupation & apartheid,your  morning walk is disturbed, you see Israeli flags,racist soldiers, checkpoints,closed & segregated  streets,closed shops, empty Pal houses.We have to do a lot to make it costly for the Israeli occupier.",
    "Weight": 29,
    "Id": 278
},
{
    "URL": "https://x.com/Issaamro/status/1664923040679854081",
    "Date": "03/06/2023",
    "Text": "Imagine that someone is walking around your house with Machine rifle,to  intimidate you so you leave your house.\nHe is under the civilian law with full rights, you are under military law without basic human rights. \nIt is only happening under the Israeli occupation of Palestine.",
    "Weight": 17,
    "Id": 279
},
{
    "URL": "https://x.com/Issaamro/status/1664344978347139098",
    "Date": "01/06/2023",
    "Text": "The Israeli soldiers were conducting a training at the entrance of inhabited house in Hebron, the house has 5 children their age is less than 12 years old. \nIt is apartheid .",
    "Weight": 8,
    "Id": 280
},
{
    "URL": "https://x.com/PeaceNowUS/status/1663978275725557784",
    "Date": "31/05/2023",
    "Text": "Settlement Spotlight: Evyatar. Let's be clear-- emboldening settlers through military support and government cooperation threatens the safety of Israelis, Palestinians, and any prospect of peace.  1/6",
    "Weight": 19,
    "Id": 281
},
{
    "URL": "https://x.com/drill_josh/status/1663481719813550080",
    "Date": "30/05/2023",
    "Text": "Students will go on state mandated \neducation tours to the settlement Homesh. The US State Department has declared this settlement illegal and although Israel promised to evacuate the settlement the Israeli government has continued building. \n@POTUS\n \n@SecBlinken",
    "Weight": 12,
    "Id": 282
},
{
    "URL": "https://x.com/Issaamro/status/1662074645388951560",
    "Date": "26/05/2023",
    "Text": "More war crimes by Israel, Israeli agents conducted targeted killings in civilian area, killing a child",
    "Weight": 24,
    "Id": 283
},
{
    "URL": "https://x.com/Issaamro/status/1661803206853230596",
    "Date": "25/05/2023",
    "Text": "Estimates of how many were killed during the massacre exceed 200 people, with one Israeli soldier saying of the death toll: \"I didn't count. I can't really know. I had a machine gun with 250 bullets.\"\nhttps://middleeasteye.net/discover/palestine-israel-tantura-movie-nakba-massacre-premiere-bafta…",
    "Weight": 16,
    "Id": 284
},
{
    "URL": "https://x.com/Issaamro/status/1661646285198221313",
    "Date": "25/05/2023",
    "Text": "Palestinian women never give up . They continue the struggle to the end. \n\nThe Palestinian footballer Natali Shaheen Won the  ‘Sport and Human Rights’ award. . \n\nhttps://amnesty.org.uk/press-releases/italy-gary-lineker-flattered-he-receives-award-human-rights-work…",
    "Weight": 8,
    "Id": 285
},
{
    "URL": "https://x.com/Issaamro/status/1661340350911315968",
    "Date": "24/05/2023",
    "Text": "Will they apply in \n@TheHebronFund\n and other racist Israeli NGOs.",
    "Weight": 8,
    "Id": 286
},
{
    "URL": "https://x.com/Issaamro/status/1661335239656894467",
    "Date": "24/05/2023",
    "Text": "I agree, We are  longing for Freedom as well in Palestine.\nThe time will come when Palestine will be free and we live in peace and prosperity.\nI invite you to visit me in Hebron to see how I live as a human rights defender suffering frumpy the Israeli occupation and apartheid.",
    "Weight": 21,
    "Id": 287
},
{
    "URL": "https://x.com/Issaamro/status/1661242036635455488",
    "Date": "24/05/2023",
    "Text": "I explained to 3 Italian Parliament members the Israeli apartheid and occupation, and I updated them about the Israeli settlers violence and new settlements projects. \nI told them that Hebron apartheid model is the future.",
    "Weight": 21,
    "Id": 288
},
{
    "URL": "https://x.com/Issaamro/status/1660758125849325571",
    "Date": "22/05/2023",
    "Text": "If you are in Italy  Roma . \nCome to listen to me directly , I will talk about occupation and apartheid in Palestine.",
    "Weight": 9,
    "Id": 289
},
{
    "URL": "https://x.com/Issaamro/status/1660190885273894913",
    "Date": "21/05/2023",
    "Text": "PEACE means to fight all types of racism and supremacy, we should fight Islamophobia, antisemitism, we should expose the HR offenders. \nPeace means to support the Palestinians to get freedom , justice and equality. \nThis is what I said to the people during peace match today.",
    "Weight": 11,
    "Id": 290
},
{
    "URL": "https://x.com/_dirittiumani/status/1659505020935585795",
    "Date": "19/05/2023",
    "Text": "Thanks to Issa Amro, Andrea De Domenico, Chen Alon, Osama Eliwat for the important insight into the challenge of human rights in Palestine, to all the associations that contributed to the day and to all the participants who enriched the debate",
    "Weight": 4,
    "Id": 291
},
{
    "URL": "https://x.com/Issaamro/status/1659231079948079105",
    "Date": "18/05/2023",
    "Text": "Jewish #supremacy with impunity in Jerusalem during the Israeli terrorists #FlagMarch ,They chant racist&hate slogans & attack Palestinian civilians.\nThe leaders are ministers&law makers in Israel,This kind of attacks give us more determination to continue our nonviolent struggle",
    "Weight": 30,
    "Id": 292
},
{
    "URL": "https://x.com/RichardHardigan/status/1657859861382680576",
    "Date": "14/05/2023",
    "Text": "RT \n@PalestineChron\n \"Palestinian activist \n@Issaamro\n is on the Handala Ship, which will try to break the #Gaza siege next year. \n\n\"We will not let the Israeli Occupation separate Gaza from Palestine. #Palestine and #Gaza are together and will be freed\"… \"",
    "Weight": 41,
    "Id": 293
},
{
    "URL": "https://x.com/Issaamro/status/1657664171960418305",
    "Date": "14/05/2023",
    "Text": "Palestinians and solidarity groups in #Oslo commemorate the 75th anniversary of Nakba.",
    "Weight": 8,
    "Id": 294
},
{
    "URL": "https://x.com/Issaamro/status/1657341869943136257",
    "Date": "13/05/2023",
    "Text": "Israel  is making #GazaStrip bloom \n@vonderleyen\n \n@EUpalestinians\n \n@EuroMedHRAr",
    "Weight": 16,
    "Id": 295
},
{
    "URL": "https://x.com/Issaamro/status/1656992993528668162",
    "Date": "12/05/2023",
    "Text": "Israel distorts international law to justify its executions  https://newarab.com/opinion/israel-distorts-international-law-justify-its-executions… via \n@the_newarab",
    "Weight": 8,
    "Id": 296
},
{
    "URL": "https://x.com/nour_odeh/status/1656312501842182145",
    "Date": "10/05/2023",
    "Text": "Tamim Daoud (5) was literally scared to death today from Israeli bombardment on Gaza. The child went into a panic while in his home then his heart stopped and could not be resuscitated. Also killed by Israeli strikes today in Gaza is Lean Mudawekh (10).",
    "Weight": 24,
    "Id": 297
},
{
    "URL": "https://x.com/Issaamro/status/1718575232716271671",
    "Date": "29/10/2023",
    "Text": "According to ministry of education, at least  2000 Palestinian students were killed by the Israeli occupation since October 7th. \nNo words can describe what is going on now in Gaza and West Bank .\nI underhand now why Palestinians left their homes , towns, villages in 1948",
    "Weight": 34,
    "Id": 298
},
{
    "URL": "https://x.com/Issaamro/status/1718306113966235789",
    "Date": "28/10/2023",
    "Text": "The anti war protesters are giving us hope, energy and we will not give up. \n\nPlease keep showing your solidarity with the Palestinian victims .",
    "Weight": 4,
    "Id": 299
},
{
    "URL": "https://x.com/YehudaShaul/status/1718189023594680745",
    "Date": "28/10/2023",
    "Text": "As the world's eyes are on Gaza, settlers in the West Bank continue to use the opportunity by escalating their terror attacks against Palestinians & their property.\n\nHere are just 3 settler attacks from yesterday in the South Hebron Hills. As usual, no arrests were made.",
    "Weight": 12,
    "Id": 300
},
{
    "URL": "https://x.com/Issaamro/status/1717973712446566436",
    "Date": "27/10/2023",
    "Text": "A total blackout...\nGaza had been cut off all internet & communications now...\nLord have Mercy ",
    "Weight": 4,
    "Id": 301
},
{
    "URL": "https://x.com/Issaamro/status/1717970353501167933",
    "Date": "27/10/2023",
    "Text": "We are very proud of our Jewish friends who are acting according to their Jewish values and Morals .",
    "Weight": 8,
    "Id": 302
},
{
    "URL": "https://x.com/Issaamro/status/1717887313022210465",
    "Date": "27/10/2023",
    "Text": "What Israel is doing against Pal civilians in Gaza is called Self REVENGE Not self defense.\nThe Israeli army is killing civilians,destroying  houses & buildings to revenge from Gaza.\nThey are using the Israeli settler terrorists Militia strategy of Price Tag.\nMake peace not War.",
    "Weight": 38,
    "Id": 303
},
{
    "URL": "https://x.com/Issaamro/status/1717843581564580034",
    "Date": "27/10/2023",
    "Text": "The Israeli military destroyed The site of journalist \n@ShireenAbuAkleh\n murder at the entrance to #Jenin refugee camp which has turned into a memorial. \n \nIts war on #Palestinians rights\n Israel  is defending its occupation, apartheid and supremacy.",
    "Weight": 25,
    "Id": 304
},
{
    "URL": "https://x.com/Issaamro/status/1717833454484590787",
    "Date": "27/10/2023",
    "Text": "The Israeli occupation forces removed the Palestinian flag from the flagpole of the public plaza at the town of Sebastia village near Nablus in West Bank .\n\nIt is another evidence that Israeli is not defending it self , Israel is defending its occupation and apartheid .",
    "Weight": 34,
    "Id": 305
},
{
    "URL": "https://x.com/catebrown12/status/1717633546947379213",
    "Date": "26/10/2023",
    "Text": "The \n@PalestineRCS\n has announced that it will be forced to shut down its ambulance services in #Gaza within 24 hours due to a lack of fuel. \n\n“We are packing ambulances with tens of people now, trying to save as many as we can,” says spox Nebal Farsakh.",
    "Weight": 8,
    "Id": 306
},
{
    "URL": "https://x.com/Issaamro/status/1717256166407913882",
    "Date": "25/10/2023",
    "Text": "The son and the daughter of Al-Jazeera’s chief correspondent in Gaza , they were trying to report about the situation in Gaza , both of them were killed with their mother . \nIt is war on civilians .",
    "Weight": 8,
    "Id": 307
},
{
    "URL": "https://x.com/Issaamro/status/1716672201665978385",
    "Date": "24/10/2023",
    "Text": "Since October 7th , Israel has killed at least 5,087 Palestinians in Gaza, including:\n2,055 children,\n18 journalists,\n49 medical workers,\n61 teachers,\nand 29 UN employees.\nSource \n@theIMEU",
    "Weight": 21,
    "Id": 308
},
{
    "URL": "https://x.com/Issaamro/status/1715971675735699522",
    "Date": "22/10/2023",
    "Text": "It is exactly what happened to me on October 7th when I was beaten and tortured by the Israeli soldiers and settlers.",
    "Weight": 13,
    "Id": 309
},
{
    "URL": "https://x.com/Issaamro/status/1715314963403751532",
    "Date": "20/10/2023",
    "Text": "Settlers violence in West Bank using the war on Gaza .",
    "Weight": 4,
    "Id": 310
},
{
    "URL": "https://x.com/MairavZ/status/1715061704474644659",
    "Date": "19/10/2023",
    "Text": "Think about the fact that before this war, dozens of top former Israeli security officials who worked with  Netanyahu, among them former head of Mossad, came out publicly saying he cannot be trusted. And now he is running the most fateful war Israel has faced in decades",
    "Weight": 12,
    "Id": 311
},
{
    "URL": "https://x.com/Issaamro/status/1715051897634140297",
    "Date": "19/10/2023",
    "Text": "Happening now : \nWe are in lockdown and curfew in Hebron, Palestinian families don’t have enough food and terrified , in the other hand Israeli soldiers are dancing with very loud music. \nStop the war \nStop displacing Palestinian from their land.",
    "Weight": 16,
    "Id": 312
},
{
    "URL": "https://x.com/democracynow/status/1714996997998903566",
    "Date": "19/10/2023",
    "Text": "Veteran Haaretz journalist Amira Hass has reported from the Occupied Palestinian Territories for decades and says the Israeli public is \"drunk with the will to take revenge\" on Palestinians, spurred on by a far-right government dominated by \"extreme fascist settlers.\"",
    "Weight": 20,
    "Id": 313
},
{
    "URL": "https://x.com/alextomo/status/1714670858914894046",
    "Date": "18/10/2023",
    "Text": "Several experts confirm Hamas’ view to \n@Channel4News\n that the audio tape of “Hamas” operatives talking about the missile malfunction is a fake . They say the tone, syntax, accent and idiom are absurd.",
    "Weight": 8,
    "Id": 314
},
{
    "URL": "https://x.com/Issaamro/status/1714594091273433137",
    "Date": "18/10/2023",
    "Text": "Israeli military is dehumanizing & TORTURING Palestinian detainees in the West Bank,they are using the war to practice their supremacy\nIt is exactly what happened to me on Oct 7th when I was tortured by the soldiers& settlers for 10h.\nEnd the War\nEnd the occupation and apartheid.",
    "Weight": 17,
    "Id": 315
},
{
    "URL": "https://x.com/Issaamro/status/1714337807919911129",
    "Date": "17/10/2023",
    "Text": "They just bombed a hospital in Gaza , around 500 civilians lost their lives. \nIt is a war crime to justify killing the civilians in hospitals.\nStop the war now .",
    "Weight": 9,
    "Id": 316
},
{
    "URL": "https://x.com/Issaamro/status/1714167062526939242",
    "Date": "17/10/2023",
    "Text": "Israel is asking United States for 10 Billion dollars as emergency Aid,to use it to strengthen the occupation & apartheid, to kill as many Palestinian civilians as possible.\n\nWhy Israel needs the West only during the wars?,but doesn’t listen when  they ask to end the occupation.",
    "Weight": 22,
    "Id": 317
},
{
    "URL": "https://x.com/Issaamro/status/1713883001602416868",
    "Date": "16/10/2023",
    "Text": "It is not only me, all the families are suffering locked in their homes, it is curfew in Hebron/H2, settlers are using the war to terrify Palestinians civilians.",
    "Weight": 8,
    "Id": 318
},
{
    "URL": "https://x.com/Issaamro/status/1713882731594055882",
    "Date": "16/10/2023",
    "Text": "Israeli settlers in an army uniform raided my houses yard two times in the last 48 hours, they damaged my free Palestine sign, and other staff, they tried to break in to the house, I refused to open.\nYesterday I was detained and attacked, I am not allowed to leave the house now.",
    "Weight": 12,
    "Id": 319
},
{
    "URL": "https://x.com/Issaamro/status/1713536992183529905",
    "Date": "15/10/2023",
    "Text": "Happening now in Hebron:\nThe Israeli settlers are taking over a Palestinian private property in Tal Rumieda in Hebron.\nIt was used by the Palestinian owners as a metal factory, it was closed by the Israeli military after the Ibrahimi mosque massacre on 1994.",
    "Weight": 24,
    "Id": 320
},
{
    "URL": "https://x.com/Issaamro/status/1713199209090887983",
    "Date": "14/10/2023",
    "Text": "5 years old Jenna talks about life in Gaza now. She is Palestinian Indian, with British citizenship. \ndog land.'* Jenna is talking about the place where dogs live,\nDemand the bombing of Gaza stop, \nmovement of medical supplies, food and water and civilians.*",
    "Weight": 12,
    "Id": 321
},
{
    "URL": "https://x.com/FranceskAlbs/status/1713183214674518228",
    "Date": "14/10/2023",
    "Text": "URGENT- Mass forced displacement of Palestinians has occurred in 1947/49 and 1967, and continued ever since, in less visible but not less painful forms. This time it risks to be as cruel as ever, under our watch, with some member states even risking to enable it. #CeasefireNow.",
    "Weight": 8,
    "Id": 322
},
{
    "URL": "https://x.com/Issaamro/status/1713169133427175598",
    "Date": "14/10/2023",
    "Text": "The Israeli military is bombing the hostages in Gaza , another 9 were killed. \nStop the war and save the lives of the civilians.\n\nIt is a war crime not defense .",
    "Weight": 17,
    "Id": 323
},
{
    "URL": "https://x.com/Issaamro/status/1713157858085257533",
    "Date": "14/10/2023",
    "Text": "Israel has been explicit about what it’s carrying out in Gaza. Why isn’t the world listening?",
    "Weight": 8,
    "Id": 324
},
{
    "URL": "https://x.com/nour_odeh/status/1712860530694561946",
    "Date": "13/10/2023",
    "Text": " Health ministry in Gaza confirms: 40 people were killed, 150 injured by an Israeli airstrike that targeted Palestinians attempting to evacuate from Gaza, as ordered by the Israeli army. Israel had ordered 1.2 million Palestinians to leave their homes in Gaza and head south.",
    "Weight": 48,
    "Id": 325
},
{
    "URL": "https://x.com/Issaamro/status/1712827547975655652",
    "Date": "13/10/2023",
    "Text": "Today Friday October 13th: \n\n9 Palestinian civilians were killed in West bank by the Israeli military .",
    "Weight": 12,
    "Id": 326
},
{
    "URL": "https://x.com/LaraFriedmanDC/status/1712805583324127693",
    "Date": "13/10/2023",
    "Text": "We are watching Israel commit large scale genocide/ethnic cleansing in real time, with the US govt and much of the organized Jewish community justifying it, defending it, materially supporting it, celebrating it and quite literally cheering it on.",
    "Weight": 13,
    "Id": 327
},
{
    "URL": "https://x.com/Issaamro/status/1712796883121254910",
    "Date": "13/10/2023",
    "Text": "Israeli Settler terrorist in the A-Tuwani -Hebron just shot a Palestinian civilian  in his own village. The settler was escorted by Israeli soldiers. \n\nWho protects the Palestinian civilians from Israeli Jewish supremacy ???!!\n\n\n@SecBlinken\n \n@USAbilAraby\n \n@amnestyusa",
    "Weight": 41,
    "Id": 328
},
{
    "URL": "https://x.com/Issaamro/status/1712771003791626370",
    "Date": "13/10/2023",
    "Text": "Israel is not defending it self nor its existence, in the contrary  Palestinian people are losing their land & identity.\nWe are losing our existence & our dream of freedom. \nIsraeli government is using the opportunity to do another NAKBA.\n\nDon’t let them do that. Show solidarity.",
    "Weight": 16,
    "Id": 329
},
{
    "URL": "https://x.com/Issaamro/status/1712742122061725912",
    "Date": "13/10/2023",
    "Text": "The crazy Israeli extremists government is killing the Israeli hostages in Gaza. \n\nIt is crazy army in a crazy world.",
    "Weight": 20,
    "Id": 330
},
{
    "URL": "https://x.com/Issaamro/status/1712719464431575097",
    "Date": "13/10/2023",
    "Text": "The Israeli military announced  a curfew in H2 in Hebron, the Palestinian families can’t leave their homes to get food, the checkpoints are closed since Saturday. \n\nCollective punishments and war crimes .",
    "Weight": 24,
    "Id": 331
},
{
    "URL": "https://x.com/Issaamro/status/1712696821519188190",
    "Date": "13/10/2023",
    "Text": "The Israeli occupation is targeting Palestinian civilians  in #Gaza especially children to revenge and to get back their ego. \n\n447 children and 248 women among 1,417 killed in Israeli strikes in Gaza. Reuters.",
    "Weight": 33,
    "Id": 332
},
{
    "URL": "https://x.com/Issaamro/status/1712499555080499415",
    "Date": "12/10/2023",
    "Text": "GAZA UPDATE 12-10-2023 : \n\n447 Palestinian children have been killed by Israeli airstrikes in Gaza, \n\nTargeting any civilian is a war crime. \n\nStop the war, make peace by ending the occupation and apartheid . \n \nPeace is always possible and it guarantees  sustainable security.",
    "Weight": 30,
    "Id": 333
},
{
    "URL": "https://x.com/Issaamro/status/1712199886203167077",
    "Date": "11/10/2023",
    "Text": "This is why we still have occupation and apartheid  and violence .",
    "Weight": 5,
    "Id": 334
},
{
    "URL": "https://x.com/Issaamro/status/1712162570537185488",
    "Date": "11/10/2023",
    "Text": "1100 killed in Gaza \n27 killed in West Bank",
    "Weight": 4,
    "Id": 335
},
{
    "URL": "https://x.com/Issaamro/status/1712162545027440853",
    "Date": "11/10/2023",
    "Text": "My interview with the Sky news , it was very hard to explain what is happening to us . It is very hard to describe the fairly life under the Israeli occupation and apartheid .",
    "Weight": 13,
    "Id": 336
},
{
    "URL": "https://x.com/Issaamro/status/1712142174765166666",
    "Date": "11/10/2023",
    "Text": "Ministry of Health in Gaza: \n4 paramedics were killed in an Israeli air strike that targeted an ambulance in Gaza today. 11.10.23",
    "Weight": 16,
    "Id": 337
},
{
    "URL": "https://x.com/Issaamro/status/1712129718554652977",
    "Date": "11/10/2023",
    "Text": "They are denying the occupation ???",
    "Weight": 5,
    "Id": 338
},
{
    "URL": "https://x.com/RamAbdu/status/1711324660636209372",
    "Date": "09/10/2023",
    "Text": "Literally dozens of dead bodies are being evacuated from Jabalia refugee camp's central market bombed by Israel shortly ago. Those are people who Israel instructed to move to the UNRWA schools located there. \n@Belalmd12",
    "Weight": 8,
    "Id": 339
},
{
    "URL": "https://x.com/Issaamro/status/1711983375886561772",
    "Date": "11/10/2023",
    "Text": "The Israeli (moral) army is destroying Gaza Strip, The army is killing palestinian civilians in purpose to revenge of the massacre Hamas did.\n2.3M people who are living without basic rights are facing fear and death because the Israeli army was defeated and they want to revenge.",
    "Weight": 28,
    "Id": 340
},
{
    "URL": "https://x.com/Issaamro/status/1711809114236461418",
    "Date": "10/10/2023",
    "Text": "Why they destroy business in Gaza ???!!!",
    "Weight": 4,
    "Id": 341
},
{
    "URL": "https://x.com/Issaamro/status/1711803789257191854",
    "Date": "10/10/2023",
    "Text": "GAZA UPDATE: Israeli airstrikes have killed at least 140 Palestinian children in Gaza since October 7. \n@DCIPalestine\n has documented the killings of 74 Palestinian children so far. Among the dead: 10-year-old Yazan Shamlakh and his baby brothers. http://dci-palestine.org/israeli_airstr…",
    "Weight": 40,
    "Id": 342
},
{
    "URL": "https://x.com/Issaamro/status/1711777373912285516",
    "Date": "10/10/2023",
    "Text": "They were killed with their mom in Gaza , their mom was a famous journalist , the father was killed too \n\nIsraeli leaders are war criminals, what they are doing now is to revenge from civilians and it is collective punishment. \n\nThey are very strong only against civilians.",
    "Weight": 12,
    "Id": 343
},
{
    "URL": "https://x.com/Lowkey0nline/status/1711752898151899499",
    "Date": "10/10/2023",
    "Text": "Netanyahu told people to leave Gaza then bombed the only possible crossing they could leave from...\n\nSadistic.",
    "Weight": 4,
    "Id": 344
},
{
    "URL": "https://x.com/Issaamro/status/1711654189300875595",
    "Date": "10/10/2023",
    "Text": "War crimes are announced by the Israeli military spokes person.",
    "Weight": 20,
    "Id": 345
},
{
    "URL": "https://x.com/Issaamro/status/1711417418868748783",
    "Date": "09/10/2023",
    "Text": "They are children too, Palestinian children deserve protection. \nTargeting civilians is a war crime, Israel is trying to revenge by killing as many Palestinian civilians as possible. \nIt is genocide .",
    "Weight": 22,
    "Id": 346
},
{
    "URL": "https://x.com/SaulStaniforth/status/1711366712396841016",
    "Date": "09/10/2023",
    "Text": "Sky presenter: \"In terms of achieving an end to the occupation, as you call it...\"\n\nwhat?\n\n\n@Issaamro\n has to explain its not him calling it an occupation, its international law! Amro goes on to call out the media for its double standards",
    "Weight": 10,
    "Id": 347
},
{
    "URL": "https://x.com/Issaamro/status/1711412084016066893",
    "Date": "09/10/2023",
    "Text": "Israeli Minister of Defense Yoav Gallant says he has given an order for Gaza’s “complete siege.” No electricity, No food, No fuel or water will be delivered to the enclave, 2.3 million Palestinians with nowhere to go. Facing death.\nIsrael is revenging by targeting Pal civilians.",
    "Weight": 24,
    "Id": 348
},
{
    "URL": "https://x.com/Issaamro/status/1711276267490725993",
    "Date": "09/10/2023",
    "Text": "Ministry of Health: \n436 Palestinians killed, including \n91 children\n 61 women\n2271 others injured in the lsraeli aggression on Gaza Strip. \nStop the war, end the occupation.",
    "Weight": 17,
    "Id": 349
},
{
    "URL": "https://x.com/Issaamro/status/1711270792443372020",
    "Date": "09/10/2023",
    "Text": "They are civilians too, watch the photos very well to remember that we are all born equal and deserve the same rights . \nStop you blindfolded coverage.\nThe Israel weak  army can only kill Palestinian civilians. Especially children.",
    "Weight": 8,
    "Id": 350
},
{
    "URL": "https://x.com/Issaamro/status/1711266811352617386",
    "Date": "09/10/2023",
    "Text": "We are civilians too, do you count Palestinians as civilians????. Do you recognize Palestinians as human beings who deserve security, human rights, freedom , justice, equality and homeland.\nJust peace with full equality will give all of us safety and we can build a better future",
    "Weight": 16,
    "Id": 351
},
{
    "URL": "https://x.com/Issaamro/status/1711227091918733563",
    "Date": "09/10/2023",
    "Text": "They are suppose to die ? The Israeli revenge army can target only civilians",
    "Weight": 8,
    "Id": 352
},
{
    "URL": "https://x.com/DrRoundglasses/status/1710984945714303053",
    "Date": "08/10/2023",
    "Text": "Israel's longest running paper blames its Prime Minister for violence by 'establishing a government of annexation & dispossession..while embracing a foreign policy that openly ignored the existence & rights of Palestinians'\n\nSuch views censored in UK media",
    "Weight": 12,
    "Id": 353
},
{
    "URL": "https://x.com/Issaamro/status/1711083541197459758",
    "Date": "08/10/2023",
    "Text": "Israel is targeting civilians in Gaza as a revenge .\nThe Israeli army can kill civilians only. They show their power on them . \nFor sure no one should target civilians, all civilians should be protected during wars. \nAnd Israel must end its occupation and apartheid very soon.",
    "Weight": 25,
    "Id": 354
},
{
    "URL": "https://x.com/Issaamro/status/1710972483174543468",
    "Date": "08/10/2023",
    "Text": "Yesterday during my detention by the Israeli soldiers & settlers in Tal Rumieda, I experienced high level of hate&supremacy , I experienced what it means no mercy & no accountability. \nI experienced the real torture.\nI experienced the real face of Israeli occupation and apartheid",
    "Weight": 21,
    "Id": 355
},
{
    "URL": "https://x.com/Issaamro/status/1707446516032401595",
    "Date": "28/09/2023",
    "Text": "Happy Jewish holidays for my Jewish friends who believe in ending the Israeli occupation and apartheid .",
    "Weight": 21,
    "Id": 356
},
{
    "URL": "https://x.com/btselem/status/1706939041919189184",
    "Date": "27/09/2023",
    "Text": "\"In their latest publication, human rights group B’Tselem says Israel is using settler pogroms to carry out the forcible transfer of Palestinians in the occupied West Bank - a war crime under international law.\"",
    "Weight": 17,
    "Id": 357
},
{
    "URL": "https://x.com/Issaamro/status/1700174931281981843",
    "Date": "08/09/2023",
    "Text": "The majority of Palestinians are asking him to resign, because of corruption, dictatorship and human rights violations. \nNo one raised these things before his history denial . \nPlease take us in consideration when you create your opinion about any leader.",
    "Weight": 8,
    "Id": 358
},
{
    "URL": "https://x.com/Issaamro/status/1700104707371352499",
    "Date": "08/09/2023",
    "Text": "Happening now, Israeli settler threw stones at me today in front of the soldiers. \nWatch the video clip .",
    "Weight": 8,
    "Id": 359
},
{
    "URL": "https://x.com/mehdirhasan/status/1698502962270679343",
    "Date": "04/09/2023",
    "Text": "Forget Israel's critics: Israel's own far-right government ministers keep admitting, again and again, that their country is guilty of apartheid and racism.\n\nI brought receipts from just the past couple of weeks, on tonight's \n@MehdiHasanShow\n.\n\nWatch/share:",
    "Weight": 8,
    "Id": 360
},
{
    "URL": "https://x.com/Issaamro/status/1697975439862440374",
    "Date": "02/09/2023",
    "Text": "You are welcome to join our olive harvest campaign in Hebron, give Palestinian farmers your hands and your protection.  your solidarity with Palestinians will make the Israeli occupation and apartheid end soon.",
    "Weight": 25,
    "Id": 361
},
{
    "URL": "https://x.com/Issaamro/status/1697494232078881132",
    "Date": "01/09/2023",
    "Text": "645 movement obstacles are spread across the West Bank\n-49 constantly staffed\n-139 intermittently staffed\n-304 roadblocks,road gates\n-73 earth walls, road barriers & trenches.\n\n80 additional obstacles of various types within the Israeli-controlled area of Hebron (H2).\n\nOCHA",
    "Weight": 8,
    "Id": 362
},
{
    "URL": "https://x.com/Issaamro/status/1695855171253817486",
    "Date": "27/08/2023",
    "Text": "Today while I was showing the Australian tv the situation in Hebron, we got a bear bottle which was thrown by the  Israeli settlers, I was hit slightly . And then we were harassed and detained at the checkpoint by an Israeli fanatic soldier.",
    "Weight": 16,
    "Id": 363
},
{
    "URL": "https://x.com/Issaamro/status/1695853006153982411",
    "Date": "27/08/2023",
    "Text": "Israeli settlers hate graphite in shuhada street in Hebron, “kill the Arabs , “Revenge”, David star on Palestinian houses .",
    "Weight": 12,
    "Id": 364
},
{
    "URL": "https://x.com/Issaamro/status/1695409002358710616",
    "Date": "26/08/2023",
    "Text": "We want to get equal rights as everyone else even as \n@itamarbengvir\n . We don’t want more than anyone else.\nHe was honest with his racism, he exposed the Israeli Jewish supremacy from the river to the sea.",
    "Weight": 12,
    "Id": 365
},
{
    "URL": "https://x.com/BtSIsrael/status/1693193629227962700",
    "Date": "20/08/2023",
    "Text": "Proud of our friend and partner \n@Issaamro\n \n\nhttps://thenation.com/article/activism/issa-amro-hebron-palestine-tour-youth-against-settlements/…",
    "Weight": 4,
    "Id": 366
},
{
    "URL": "https://x.com/IfNotNowOrg/status/1692585819465306463",
    "Date": "18/08/2023",
    "Text": "Yesterday, IfNotNow and \n@JvpAction\n members confronted Rep. Dan Goldman about his participation in an AIPAC-sponsored trip to Israel last week. \n\nGoldman repeatedly refused to disavow AIPAC, claiming that AIPAC is a “force for good”, as it continues to back far-right extremists.",
    "Weight": 4,
    "Id": 367
},
{
    "URL": "https://x.com/ochaopt/status/1692241178551312616",
    "Date": "17/08/2023",
    "Text": "The #WestBank elementary school of Ein Samiya was demolished today by the Israeli authorities.\n\nListen to this press briefing by \n@UN_Spokesperson\n.\n\nMore information: http://ochaopt.org/content/elementary-school-ein-samiya-demolished…",
    "Weight": 8,
    "Id": 368
},
{
    "URL": "https://x.com/theiachatelle/status/1692240041752330425",
    "Date": "17/08/2023",
    "Text": "Latest in \n@thenation\n, thank you to \n@Julian_Epp\n for all your help with the piece. \n\nSpoke with \n@Issaamro\n about all things Hebron, the Israeli occupation, and nonviolent resistance. \n\nhttps://thenation.com/article/activism/issa-amro-hebron-palestine-tour-youth-against-settlements/…",
    "Weight": 17,
    "Id": 369
},
{
    "URL": "https://x.com/Issaamro/status/1691746525192327229",
    "Date": "16/08/2023",
    "Text": "Israeli bus driver orders girls to 'cover up' and sit at the back of the bus",
    "Weight": 8,
    "Id": 370
},
{
    "URL": "https://x.com/Issaamro/status/1691746328009728361",
    "Date": "16/08/2023",
    "Text": "Israeli bus driver orders girls to 'cover up' and sit at the back of the bus",
    "Weight": 8,
    "Id": 371
},
{
    "URL": "https://x.com/Issaamro/status/1691148013484257303",
    "Date": "14/08/2023",
    "Text": "Today, the Israeli military tried to stop us from bringing in construction materials to do maintenance to our houses. But they help settlers to build illegal settlements. \nBut we never give up our rights.",
    "Weight": 8,
    "Id": 372
},
{
    "URL": "https://x.com/btselem/status/1689573830807715842",
    "Date": "10/08/2023",
    "Text": "This is an emergency! Forcible transfer is happening right now in the West Bank. Israel successfully expels more and more Palestinians from their homes using settler violence. In three months, four communities have been expelled. >",
    "Weight": 12,
    "Id": 373
},
{
    "URL": "https://x.com/Issaamro/status/1689155780304322560",
    "Date": "09/08/2023",
    "Text": "The Israeli settler who killed a Palestinian was released from jail, it is apartheid and Jewish supremacy.",
    "Weight": 16,
    "Id": 374
},
{
    "URL": "https://x.com/Issaamro/status/1688942134064209920",
    "Date": "08/08/2023",
    "Text": "'Heroes': Ben Gvir defends settlers suspected of killing Palestinian https://middleeasteye.net/news/israel-palestine-ben-gvir-defends-settlers-suspected-killing…",
    "Weight": 12,
    "Id": 375
},
{
    "URL": "https://x.com/IfNotNowOrg/status/1687559488033738752",
    "Date": "04/08/2023",
    "Text": "Our hearts are with the family of Qosai Jammal Mi’tan, who was murdered by settlers in the West Bank, and we’re wishing a speedy and full recovery to the four people injured in the attack. This state-backed settler violence against Palestinians must end.",
    "Weight": 8,
    "Id": 376
},
{
    "URL": "https://x.com/JessicaMontell/status/1686317817010798592",
    "Date": "01/08/2023",
    "Text": "The most important article you can read today: \n@aboxerman1\n & \n@adamrasgon\n's deep dive profile of Palestinian Minister Hussein al-Sheikh & the role he, and the PA more broadly, play in maintaining the Israeli occupation.",
    "Weight": 17,
    "Id": 377
},
{
    "URL": "https://x.com/KatieHalperShow/status/1598157250514014208",
    "Date": "01/12/2022",
    "Text": "\"Issa Amro is a brilliant Palestinian human rights defender who has established the most effective grass roots org in Palestine. The settlers who live next to him, these Kahana types,they want him dead.\"-\n@MikoPeled\n on \n@IssaAmro\n  #MikoPeled #IssaAmro \n\nfull\nhttps://youtube.com/watch?v=dNbpdFmjb6w…",
    "Weight": 8,
    "Id": 378
},
{
    "URL": "https://x.com/Issaamro/status/1685896340503400449",
    "Date": "31/07/2023",
    "Text": "Israeli settlers in Hebron threw empty beer bottles toward Palestinian houses .",
    "Weight": 12,
    "Id": 379
},
{
    "URL": "https://x.com/LaraFriedmanDC/status/1684965807007182850",
    "Date": "28/07/2023",
    "Text": "I Was Attacked for My Speech About Palestine. I Stand by Every Word. - Fatima Mohammed\n\n\"My CUNY Law speech led to a torrent of abuse and vitriol, but I have no regrets.\"",
    "Weight": 4,
    "Id": 380
},
{
    "URL": "https://x.com/theIMEU/status/1682071742947430400",
    "Date": "20/07/2023",
    "Text": "NEW: Medical Aid for Palestinians has announced it will be supplying Palestinian paramedics with bulletproof vests and helmets.\n\nWhy? Because the Israeli military has been shooting at paramedics who try to help Palestinians injured by Israeli soldiers.",
    "Weight": 36,
    "Id": 381
},
{
    "URL": "https://x.com/caliactivist/status/1682066791798026240",
    "Date": "20/07/2023",
    "Text": "UN experts condemn forced eviction of east Jerusalem families by Israeli gov 'It is deeply shocking and heartbreaking to see Nora & Mustafa Sub Laban,  evicted from their family home where they have lived all their lives and raised their children,' https://shar.es/afPWx8",
    "Weight": 8,
    "Id": 382
},
{
    "URL": "https://x.com/Issaamro/status/1680146678169456640",
    "Date": "15/07/2023",
    "Text": "The Palestinian authority arrested the journalist Aqil Awawda for criticising the PA leadership .",
    "Weight": 4,
    "Id": 383
},
{
    "URL": "https://x.com/Issaamro/status/1678727117121417217",
    "Date": "11/07/2023",
    "Text": "I saw this coming Lara, I told many Israeli delegations in the past, everything happening in the occupied territories will be in Israel soon , Hebron model will be implemented from the river to the sea.",
    "Weight": 12,
    "Id": 384
},
{
    "URL": "https://x.com/Issaamro/status/1677422406833520645",
    "Date": "07/07/2023",
    "Text": "I am not whitewashing anyone, I write my opinion according to my experience with people.\nyou can come to Palestine now, I want to see you facing the soldiers and the settlers on the ground.\nYou do nothing to help our Summod, you only care about yourself, you are ignorant.",
    "Weight": 4,
    "Id": 385
},
{
    "URL": "https://x.com/BenzionSanders/status/1677307191135444992",
    "Date": "07/07/2023",
    "Text": "Apparently the \n@IDF\n is capable of using force against Israelis, as they did today when 400 Israelis marched against the Homesh outpost built on Palestinian land.\n\nWhere were they in Huwara?\nWhere were they in Umm Safa?\nWhere were they in Turmus Aya?\nWhere were they in Urif?",
    "Weight": 26,
    "Id": 386
},
{
    "URL": "https://x.com/Issaamro/status/1676980337237172226",
    "Date": "06/07/2023",
    "Text": "Dear Elizabeth , I hope that you are safe and come back to fight the occupation and apartheid with us. \n\nYou volunteered many times in Hebron to expose the occupation. \n Kidnapping her is very wrong and will not help any cause.",
    "Weight": 10,
    "Id": 387
},
{
    "URL": "https://x.com/DalalIRIQAT/status/1676958158869372930",
    "Date": "06/07/2023",
    "Text": "The accused is innocent until proven guilty, when it comes to the Israeli occupation at trails of Israeli officers, they r innocent &will definitely be proven innocent!Today, policeman who murdered in cold blood child #Iyad_alHallaq 3 yrs ago #Jerusalem was declared innocent!",
    "Weight": 21,
    "Id": 388
},
{
    "URL": "https://x.com/Issaamro/status/1676939322493157378",
    "Date": "06/07/2023",
    "Text": "Today, I was threatened to be arrested for trying to prevent the Israeli settlers \nFrom building an illegal outpost in a private Palestinian land in Hebron, the soldiers escorted the  settlers.\nIt is #nahal brigade army unit who are from leftest background in Israel.",
    "Weight": 16,
    "Id": 389
},
{
    "URL": "https://x.com/Issaamro/status/1676609210165895170",
    "Date": "05/07/2023",
    "Text": "Happening now, I am detained with my 11 years old son“Watan”at the main checkpoint in Hebron ,We were going home. they want Watan to pass via the metal detector, the army commander was trying to Harass him. \nIt Is #nahal army brigade . They are from leftest background in Israel.",
    "Weight": 4,
    "Id": 390
},
{
    "URL": "https://x.com/Issaamro/status/1676605587465945091",
    "Date": "05/07/2023",
    "Text": "Israeli soldiers from the racist army unit #Nahal detained my 11 years old child when we were passing to go home. \nNahal soldiers usually from Israeli leftest families.",
    "Weight": 16,
    "Id": 391
},
{
    "URL": "https://x.com/nour_odeh/status/1676368709542084608",
    "Date": "04/07/2023",
    "Text": "WARNING: GRAPHIC video from inside the Jenin refugee camp has emerged showing an unsuspecting unarmed Palestinian youth shot in the neck. He stumbles, tries to get to safety then falls to the ground. A cold-blooded execution. Video was shared by residents/music from the source",
    "Weight": 4,
    "Id": 392
},
{
    "URL": "https://x.com/Issaamro/status/1676179567491567624",
    "Date": "04/07/2023",
    "Text": "Thanks to \n@washingtonpost\n for the covering the truth from Palestine.",
    "Weight": 4,
    "Id": 393
},
{
    "URL": "https://x.com/Issaamro/status/1675951778792108032",
    "Date": "03/07/2023",
    "Text": "Palestinian refugees from 1948, became refugees again in 2023. \nThe families had to leave their homes again to escape the the Israel military raid in Jenin camp. \nStop the war on #Jenin civilians.",
    "Weight": 8,
    "Id": 394
},
{
    "URL": "https://x.com/Issaamro/status/1673778395962900480",
    "Date": "27/06/2023",
    "Text": "Occupation and apartheid are making everything dirty, even the minds of many humans from the river to the sea . \nThis is my answer to the advisor of \n@itamarbengvir\n , who claims that he is making the land looks nicer .",
    "Weight": 5,
    "Id": 395
},
{
    "URL": "https://x.com/Issaamro/status/1673701847863836673",
    "Date": "27/06/2023",
    "Text": "And I offer him a Palestinian meal in lot house in Tal Rummieda  and a tour .",
    "Weight": 4,
    "Id": 396
},
{
    "URL": "https://x.com/Issaamro/status/1673628864885448705",
    "Date": "27/06/2023",
    "Text": "American volunteers came to help Israeli settlers steal our land in Hebron, they claim that they are making it nicer, it is going to much nicer without Israeli occupation and apartheid.",
    "Weight": 21,
    "Id": 397
},
{
    "URL": "https://x.com/Issaamro/status/1673627417733214209",
    "Date": "27/06/2023",
    "Text": "#American volunteers came to my city Hebron to help the Israeli settlers take over my land.\nThey started working in private Palestinian land to clean the path for the Israeli settler.",
    "Weight": 20,
    "Id": 398
},
{
    "URL": "https://x.com/BtSIsrael/status/1673615592413069315",
    "Date": "27/06/2023",
    "Text": "From @OriNir_APN in the \n@nytimes\n: \n\n\"In some recent attacks, Israeli military and police officers have even been documented standing idly by as settlers stormed and burned Palestinian villages.\"\n\nRead the whole article\nhttps://nytimes.com/2023/06/26/opinion/international-world/west-bank-israel-palestine.html…?",
    "Weight": 20,
    "Id": 399
},
{
    "URL": "https://x.com/Issaamro/status/1672856333962420225",
    "Date": "25/06/2023",
    "Text": "Very scary dark future , the Jewish terrorists militia appears in West Bank streets, they were working under cover in the past, now they work during the light and don’t care to be filmed, they have \n@itamarbengvir\n backing them up from the government.",
    "Weight": 14,
    "Id": 400
},
{
    "URL": "https://x.com/Issaamro/status/1671883698491506689",
    "Date": "22/06/2023",
    "Text": "Israeli settlers violence against Palestinians with full impunity.",
    "Weight": 16,
    "Id": 401
},
{
    "URL": "https://x.com/Issaamro/status/1670920273929838596",
    "Date": "19/06/2023",
    "Text": "'Silent transfer': How Israeli settlers are launching a second Nakba | Middle East Eye",
    "Weight": 8,
    "Id": 402
},
{
    "URL": "https://x.com/btselem/status/1669281739401830400",
    "Date": "15/06/2023",
    "Text": "CNN: \"Israel’s military called the settler attack on this Palestinian town a ‘pogrom.’ Videos show soldiers did little to stop it\"\n\nSettler violence is state violence.",
    "Weight": 8,
    "Id": 403
},
{
    "URL": "https://x.com/PalMissionUK/status/1669238237976489984",
    "Date": "15/06/2023",
    "Text": "The Israeli justice system isn’t morally or practically fit for anything other than legitimising the killing of Palestinian civilians.",
    "Weight": 12,
    "Id": 404
},
{
    "URL": "https://x.com/caliactivist/status/1667229088405409793",
    "Date": "09/06/2023",
    "Text": "Today is a great day to ask all members of the Progressive Caucus to co-sponsor H.R. 3103 — Defending the Human Rights of Palestinian Children and Families Living Under Israeli Military Occupation Act. \n@JVPBayArea\n \n@JVPSanDiego\n \n@JVPSeattle\n \n@jvpliveNY",
    "Weight": 17,
    "Id": 405
},
{
    "URL": "https://x.com/Issaamro/status/1666902285165772801",
    "Date": "08/06/2023",
    "Text": "When they started the planning, they told the court that Palestinians will use the elevator , now they don’t want Palestinians to use it. One side elevator . It is apartheid.",
    "Weight": 16,
    "Id": 406
},
{
    "URL": "https://x.com/Issaamro/status/1666866506943037457",
    "Date": "08/06/2023",
    "Text": "The Palestinian Intelligence forces headed by Majid Faraj refused to implement the Palestinian court decision to release the Pal anti corruption activist Fajar Alrantesi. Who is working in Aman NGO. \nMajid Faraj is responsible about restricting our free speeches.\n \n@GermanRepRama",
    "Weight": 8,
    "Id": 407
},
{
    "URL": "https://x.com/Issaamro/status/1665997533351407616",
    "Date": "06/06/2023",
    "Text": "The Israeli occupation make the life of the Palestinians in Hebron very hard by closing the main streets, we do help the families to walk via the fields to reach their homes safe, today we organise an action to clean the path.\nWe work the land because we are the owners.",
    "Weight": 21,
    "Id": 408
},
{
    "URL": "https://x.com/Issaamro/status/1665725449752780803",
    "Date": "05/06/2023",
    "Text": "The Israeli military killed  Mohammed Tamimi (2 years old ) near the town of Nabi Saleh, Ramallah\n\nThe Israeli military first accused Palestinians, but hours later backtracked and admitted that they killed him.\n\nWe are facing ethnic cleansing.",
    "Weight": 24,
    "Id": 409
},
{
    "URL": "https://x.com/Issaamro/status/1665593717221212160",
    "Date": "05/06/2023",
    "Text": "It is very hard to live normal life under Israeli occupation & apartheid,your  morning walk is disturbed, you see Israeli flags,racist soldiers, checkpoints,closed & segregated  streets,closed shops, empty Pal houses.We have to do a lot to make it costly for the Israeli occupier.",
    "Weight": 29,
    "Id": 410
},
{
    "URL": "https://x.com/Issaamro/status/1664923040679854081",
    "Date": "03/06/2023",
    "Text": "Imagine that someone is walking around your house with Machine rifle,to  intimidate you so you leave your house.\nHe is under the civilian law with full rights, you are under military law without basic human rights. \nIt is only happening under the Israeli occupation of Palestine.",
    "Weight": 17,
    "Id": 411
},
{
    "URL": "https://x.com/Issaamro/status/1664344978347139098",
    "Date": "01/06/2023",
    "Text": "The Israeli soldiers were conducting a training at the entrance of inhabited house in Hebron, the house has 5 children their age is less than 12 years old. \nIt is apartheid .",
    "Weight": 8,
    "Id": 412
},
{
    "URL": "https://x.com/PeaceNowUS/status/1663978275725557784",
    "Date": "31/05/2023",
    "Text": "Settlement Spotlight: Evyatar. Let's be clear-- emboldening settlers through military support and government cooperation threatens the safety of Israelis, Palestinians, and any prospect of peace.  1/6",
    "Weight": 19,
    "Id": 413
},
{
    "URL": "https://x.com/drill_josh/status/1663481719813550080",
    "Date": "30/05/2023",
    "Text": "Students will go on state mandated \neducation tours to the settlement Homesh. The US State Department has declared this settlement illegal and although Israel promised to evacuate the settlement the Israeli government has continued building. \n@POTUS\n \n@SecBlinken",
    "Weight": 12,
    "Id": 414
},
{
    "URL": "https://x.com/Issaamro/status/1662074645388951560",
    "Date": "26/05/2023",
    "Text": "More war crimes by Israel, Israeli agents conducted targeted killings in civilian area, killing a child",
    "Weight": 24,
    "Id": 415
},
{
    "URL": "https://x.com/Issaamro/status/1661803206853230596",
    "Date": "25/05/2023",
    "Text": "Estimates of how many were killed during the massacre exceed 200 people, with one Israeli soldier saying of the death toll: \"I didn't count. I can't really know. I had a machine gun with 250 bullets.\"\nhttps://middleeasteye.net/discover/palestine-israel-tantura-movie-nakba-massacre-premiere-bafta…",
    "Weight": 16,
    "Id": 416
},
{
    "URL": "https://x.com/Issaamro/status/1661646285198221313",
    "Date": "25/05/2023",
    "Text": "Palestinian women never give up . They continue the struggle to the end. \n\nThe Palestinian footballer Natali Shaheen Won the  ‘Sport and Human Rights’ award. . \n\nhttps://amnesty.org.uk/press-releases/italy-gary-lineker-flattered-he-receives-award-human-rights-work…",
    "Weight": 8,
    "Id": 417
},
{
    "URL": "https://x.com/Issaamro/status/1661340350911315968",
    "Date": "24/05/2023",
    "Text": "Will they apply in \n@TheHebronFund\n and other racist Israeli NGOs.",
    "Weight": 8,
    "Id": 418
},
{
    "URL": "https://x.com/Issaamro/status/1661335239656894467",
    "Date": "24/05/2023",
    "Text": "I agree, We are  longing for Freedom as well in Palestine.\nThe time will come when Palestine will be free and we live in peace and prosperity.\nI invite you to visit me in Hebron to see how I live as a human rights defender suffering frumpy the Israeli occupation and apartheid.",
    "Weight": 21,
    "Id": 419
},
{
    "URL": "https://x.com/Issaamro/status/1661242036635455488",
    "Date": "24/05/2023",
    "Text": "I explained to 3 Italian Parliament members the Israeli apartheid and occupation, and I updated them about the Israeli settlers violence and new settlements projects. \nI told them that Hebron apartheid model is the future.",
    "Weight": 21,
    "Id": 420
},
{
    "URL": "https://x.com/Issaamro/status/1660758125849325571",
    "Date": "22/05/2023",
    "Text": "If you are in Italy  Roma . \nCome to listen to me directly , I will talk about occupation and apartheid in Palestine.",
    "Weight": 9,
    "Id": 421
},
{
    "URL": "https://x.com/Issaamro/status/1660190885273894913",
    "Date": "21/05/2023",
    "Text": "PEACE means to fight all types of racism and supremacy, we should fight Islamophobia, antisemitism, we should expose the HR offenders. \nPeace means to support the Palestinians to get freedom , justice and equality. \nThis is what I said to the people during peace match today.",
    "Weight": 11,
    "Id": 422
},
{
    "URL": "https://x.com/_dirittiumani/status/1659505020935585795",
    "Date": "19/05/2023",
    "Text": "Thanks to Issa Amro, Andrea De Domenico, Chen Alon, Osama Eliwat for the important insight into the challenge of human rights in Palestine, to all the associations that contributed to the day and to all the participants who enriched the debate",
    "Weight": 4,
    "Id": 423
},
{
    "URL": "https://x.com/Issaamro/status/1659231079948079105",
    "Date": "18/05/2023",
    "Text": "Jewish #supremacy with impunity in Jerusalem during the Israeli terrorists #FlagMarch ,They chant racist&hate slogans & attack Palestinian civilians.\nThe leaders are ministers&law makers in Israel,This kind of attacks give us more determination to continue our nonviolent struggle",
    "Weight": 30,
    "Id": 424
},
{
    "URL": "https://x.com/RichardHardigan/status/1657859861382680576",
    "Date": "14/05/2023",
    "Text": "RT \n@PalestineChron\n \"Palestinian activist \n@Issaamro\n is on the Handala Ship, which will try to break the #Gaza siege next year. \n\n\"We will not let the Israeli Occupation separate Gaza from Palestine. #Palestine and #Gaza are together and will be freed\"… \"",
    "Weight": 41,
    "Id": 425
},
{
    "URL": "https://x.com/Issaamro/status/1657664171960418305",
    "Date": "14/05/2023",
    "Text": "Palestinians and solidarity groups in #Oslo commemorate the 75th anniversary of Nakba.",
    "Weight": 8,
    "Id": 426
},
{
    "URL": "https://x.com/Issaamro/status/1657341869943136257",
    "Date": "13/05/2023",
    "Text": "Israel  is making #GazaStrip bloom \n@vonderleyen\n \n@EUpalestinians\n \n@EuroMedHRAr",
    "Weight": 16,
    "Id": 427
},
{
    "URL": "https://x.com/Issaamro/status/1656992993528668162",
    "Date": "12/05/2023",
    "Text": "Israel distorts international law to justify its executions  https://newarab.com/opinion/israel-distorts-international-law-justify-its-executions… via \n@the_newarab",
    "Weight": 8,
    "Id": 428
},
{
    "URL": "https://x.com/nour_odeh/status/1656312501842182145",
    "Date": "10/05/2023",
    "Text": "Tamim Daoud (5) was literally scared to death today from Israeli bombardment on Gaza. The child went into a panic while in his home then his heart stopped and could not be resuscitated. Also killed by Israeli strikes today in Gaza is Lean Mudawekh (10).",
    "Weight": 24,
    "Id": 429
},
{
    "URL": "https://x.com/DalalIRIQAT/status/1656152210395344896",
    "Date": "10/05/2023",
    "Text": "A year on the martyrdom of #Shireen\n#Saeb_Erekat taught me that ideas are stronger than all bullets, do not die, ideas cross borders &live without permission, Shireen a fine journalist murdered because she told truth of #israeli_occupation  #Justice 4 #ShireenAbuAkleh",
    "Weight": 13,
    "Id": 430
},
{
    "URL": "https://x.com/DalalIRIQAT/status/1655777479817084930",
    "Date": "09/05/2023",
    "Text": "Miral, traumatized as she lost her parents & brother. She survived alone. Dr Khashan, former head Dentists Syndicate,wife & son, Dr. Youssef were all murdered during the Israeli bombing of #Gaza this dawn. Holding #Russian citizenship, all Palestinians are target to Israeli fire",
    "Weight": 28,
    "Id": 431
},
{
    "URL": "https://x.com/Issaamro/status/1655162183473414151",
    "Date": "07/05/2023",
    "Text": "The only democracy in the Middle East “Israel ”!!! demolished today a Palestinian primary school funded by the European money in order to make the desert bloom. \nThe school before and after.",
    "Weight": 8,
    "Id": 432
},
{
    "URL": "https://x.com/Issaamro/status/1655161156208558082",
    "Date": "07/05/2023",
    "Text": "‘Chilling effect’: Israel’s ongoing surveillance of Palestinians | News | Al Jazeera",
    "Weight": 12,
    "Id": 433
},
{
    "URL": "https://x.com/Issaamro/status/1655098879170293760",
    "Date": "07/05/2023",
    "Text": "Palestinians in Hebron are some of the most heavily monitored and controlled people on the planet..\nhttps://youtu.be/B1RNj8FXKqY",
    "Weight": 8,
    "Id": 434
},
{
    "URL": "https://x.com/Issaamro/status/1654957289776791555",
    "Date": "06/05/2023",
    "Text": "Cambridge Union criticised over Israel-Palestine debate name change",
    "Weight": 8,
    "Id": 435
},
{
    "URL": "https://x.com/Issaamro/status/1654921170754449408",
    "Date": "06/05/2023",
    "Text": "Israeli settlers attacked Palestinian houses in Hebron today by spraying water and throwing stones at the windows. Soldiers did nothing to stop them.",
    "Weight": 12,
    "Id": 436
},
{
    "URL": "https://x.com/Issaamro/status/1654919241986977793",
    "Date": "06/05/2023",
    "Text": "Red wolf Israeli racist technology which is used to spy on Palestinians, it is used without any limits nor ethics .",
    "Weight": 16,
    "Id": 437
},
{
    "URL": "https://x.com/Issaamro/status/1654914379568099330",
    "Date": "06/05/2023",
    "Text": "Israeli Jewish Settlers in Hebron stole Palestinian shops wooded  decoration  to use them during  #LagBaomer  bone-fire Jewish holiday  in the city.\n\nIsraeli settlers break into closed Palestinian shops & strip them down.\nPalestinians are not allowed to walk on these streets",
    "Weight": 40,
    "Id": 438
},
{
    "URL": "https://x.com/btselem/status/1653677225940602881",
    "Date": "03/05/2023",
    "Text": "Every day, the average Israeli consumes three (!) times more water than the average Palestinian – 247 liters as opposed to 82.4 liters. This is less than the minimum consumption of 100 liters per person, per day, recommended by the World Health Organization. >",
    "Weight": 12,
    "Id": 439
},
{
    "URL": "https://x.com/Issaamro/status/1653445492510949391",
    "Date": "02/05/2023",
    "Text": "Mr. Amro said Palestinians are angry that the surveillance tools never seem to be used to identify crimes by Israeli settlers against Palestinians.",
    "Weight": 26,
    "Id": 440
},
{
    "URL": "https://x.com/Issaamro/status/1653291491110821888",
    "Date": "02/05/2023",
    "Text": "1000 Palestinians are still in administrative detention in Israeli military jails .",
    "Weight": 16,
    "Id": 441
},
{
    "URL": "https://x.com/mikopeled/status/1651340261346234368",
    "Date": "26/04/2023",
    "Text": "People should not be punished for telling the truth about Palestine\n\n\n@TinaMarinari\n from Amnesty International and \n@FranceskAlbs\n at the UN are being accused of antisemitism. There are calls for Albanese to be kicked out of the UN. \n\nSign this petition:",
    "Weight": 7,
    "Id": 442
},
{
    "URL": "https://x.com/xabueid/status/1651263718720692225",
    "Date": "26/04/2023",
    "Text": "Occupation, Colonial-settlement policies, ethnic cleansing, annexation, the negation of the inalienable rights of the Palestinian people, racist and colonialist discourse have very good friends in Europe. \nThe “desert” used to feed Europe with oranges before the Nakba.",
    "Weight": 9,
    "Id": 443
},
{
    "URL": "https://x.com/OrenZiv_/status/1651173216008667136",
    "Date": "26/04/2023",
    "Text": "Now: thousands of Palestinians take part in the March of Return at the village of Al Lajoun that was destroyed during the 1948 Nakba",
    "Weight": 8,
    "Id": 444
},
{
    "URL": "https://x.com/Issaamro/status/1651140911047270400",
    "Date": "26/04/2023",
    "Text": "Can you ask Israel to define its borders??!!, do you know the boarders of the state of Israel ??!!!",
    "Weight": 8,
    "Id": 445
},
{
    "URL": "https://x.com/muhammadshehad2/status/1651131246305583105",
    "Date": "26/04/2023",
    "Text": "#Israeli settlers went on a rampage yesterday, burning a Palestinian house south of Nablus; closing roads near Ramallah; marching through Batn Al-Hawa neighborhood in Silwan; destroying farms in the Jordanian valley; raising the Israeli flag at al-Aqsa... with virtual impunity!",
    "Weight": 20,
    "Id": 446
},
{
    "URL": "https://x.com/_ZachFoster/status/1650112987317895171",
    "Date": "23/04/2023",
    "Text": "Here’s how Israeli apartheid works:\n\nIf you are Palestinian and get convicted of a crime, you go to jail.\n\nIf you are Israeli, and a commit a crime against Palestinians, you don’t.\n\nIt’s not that complicated after all.\n\nhttps://carnegieendowment.org/specialprojects/breakingtheisraelpalestinestatusquo/payments…",
    "Weight": 36,
    "Id": 447
},
{
    "URL": "https://x.com/Issaamro/status/1649418968912863236",
    "Date": "21/04/2023",
    "Text": "Eid Mubarak from #Hebron, #Palestine! \nكل عام وانتم بحير\nMay we soon spend the holidays in freedom and equality, and may oppression and apartheid be no more.",
    "Weight": 4,
    "Id": 448
},
{
    "URL": "https://x.com/Issaamro/status/1648622415256141824",
    "Date": "19/04/2023",
    "Text": "Last night Israeli settlers demolished 5 Pal shops in the closed vegetable market in #Hebron. The shops are closed by Israeli military orders since Ibrahimi mosque massacre in 1994, then reopened and closed again in 2000,It is even illegal in the Israeli law to demolish the shops",
    "Weight": 24,
    "Id": 449
},
{
    "URL": "https://x.com/Issaamro/status/1648622420985561090",
    "Date": "19/04/2023",
    "Text": "The shops are demolished to build a new Israeli settlements in the area, \nThe Israeli military is closing more than 500 Palestinian shops in the same area for security fake excuses, and more than 1000 other shops are closed because of Israeli military  closure policy.",
    "Weight": 28,
    "Id": 450
},
{
    "URL": "https://x.com/Issaamro/status/1648077560608092162",
    "Date": "17/04/2023",
    "Text": "250k worshipers reached Al- Aqsa mosque tonight, in spite of the 100 Israeli checkpoints +350 movement barriers.\nPalestinians will never give up their rights & will keep asking for freedom, justice & equality.\nPraying peacefully is one of the best forms of non-violence resistance",
    "Weight": 16,
    "Id": 451
},
{
    "URL": "https://x.com/nour_odeh/status/1647199799471493121",
    "Date": "15/04/2023",
    "Text": "Scenes from Jerusalem today. Israeli occupation soldiers attack Palestinian Christians and visitors pilgrims trying to get to the Church of Holy Sepulcher for the Holy Light ceremony.",
    "Weight": 17,
    "Id": 452
},
{
    "URL": "https://x.com/nour_odeh/status/1646836589253754880",
    "Date": "14/04/2023",
    "Text": "When you see AlAqsa full of worshippers, kindly remember that 10s of thousands of Palestinians braved long hours under the sun & humiliation by soldiers & risked brutalization to get there. Israel has no right to impose ANY restrictions on worshippers heading to Jerusalem",
    "Weight": 12,
    "Id": 453
},
{
    "URL": "https://x.com/Issaamro/status/1646658781227483136",
    "Date": "13/04/2023",
    "Text": "Today it was my birthday, my birthday  gift from the soldiers at the checkpoint was to force me to take of my cloth and my choose on the muddy Floor, the. The soldier said I am a suspect, his surveillance smart system gave him that impression. \nIt is Occupation and apartheid.",
    "Weight": 5,
    "Id": 454
},
{
    "URL": "https://x.com/Issaamro/status/1646607402739945492",
    "Date": "13/04/2023",
    "Text": "Palestinian Authority Blocks Registration of Rights Group | Human Rights Watch https://bit.ly/3o7dkrg",
    "Weight": 4,
    "Id": 455
},
{
    "URL": "https://x.com/Issaamro/status/1645988780627709952",
    "Date": "12/04/2023",
    "Text": "Can you allow me to pray at Alaqsa mosque too??!!. I  am from Hebron city 30Km far from Jerusalem , but I am not allowed to enter Jerusalem to pray, me and the majority of the Palestinians from West Bank and Gaza are denied because of your military occupation laws.#factchecking",
    "Weight": 17,
    "Id": 456
},
{
    "URL": "https://x.com/YehudaShaul/status/1645730202155114496",
    "Date": "11/04/2023",
    "Text": "Jewish sovereignty river to the sea. Arabs [there are no Palestinian people] will remain as subjects, or leave, or die if they resist. This is the vision of \n@bezalelsm\n for IL-Pal.\n\nHere is a short guide/long thread to Smotrich’s Decisive Plan, 2017.\n1/25",
    "Weight": 8,
    "Id": 457
},
{
    "URL": "https://x.com/Issaamro/status/1645776463323447299",
    "Date": "11/04/2023",
    "Text": "Happy Ramadan and Free Palestine.",
    "Weight": 4,
    "Id": 458
}]