[
{
    "URL": "https://x.com/LailaAlarian/status/1864047053476663467",
    "Date": "03/12/2024",
    "Text": "The Israeli military is repeatedly attacking Kamal Adwan Hospital in Gaza, killing staff and patients and destroying its infrastructure and medical supply. \n\nIt’s weird how all the experts who  popped up during the Ahli Hospital attack of Oct 2023 are completely silent about this",
    "Weight": 12,
    "Id": 0
},
{
    "URL": "https://x.com/JehadAbusalim/status/1864076333409538312",
    "Date": "03/12/2024",
    "Text": "and Benjamin Krusling’s free-access review of The Tent Generations: Palestinian Poems, edited and translated by Mohammed Sawaie.",
    "Weight": 4,
    "Id": 1
},
{
    "URL": "https://x.com/JehadAbusalim/status/1864076295304253778",
    "Date": "03/12/2024",
    "Text": "The issue includes two book reviews: Hanna Salmon’s review of Louis Brehony’s Palestinian Music in Exile: Voices of Resistance.",
    "Weight": 4,
    "Id": 2
},
{
    "URL": "https://x.com/JehadAbusalim/status/1864076241373938045",
    "Date": "03/12/2024",
    "Text": "The special issue ends with \n@LinaAbuAkleh\n's moving tribute to her aunt Shireen, forever remembered by her adoring listeners as the voice of Palestine.",
    "Weight": 4,
    "Id": 3
},
{
    "URL": "https://x.com/JehadAbusalim/status/1864076141373391049",
    "Date": "03/12/2024",
    "Text": "This roundtable, cofacilitated by Bishara and Allan, presents firsthand accounts from Palestinian journalists & free speech activists - \n@Ghousoon\n, \n@MushtahaW\n, and \n@Sherifmnsour\n -  of their experiences covering the genocide in Gaza.",
    "Weight": 13,
    "Id": 4
},
{
    "URL": "https://x.com/JehadAbusalim/status/1864075973072765397",
    "Date": "03/12/2024",
    "Text": "Codirectors  \n@RamiYounisPS\n & Sarah Ema Friedland describe the creative process behind making the award-winning, speculative sci-fi documentary, 'Lyd,' which imagines a Palestine never colonized by the British or Zionists.",
    "Weight": 14,
    "Id": 5
},
{
    "URL": "https://x.com/JehadAbusalim/status/1864071545104056427",
    "Date": "03/12/2024",
    "Text": "A group of artist-activists have developed a multimedia archive of the Palestinian refugee camp of Burj al-Shamali in Lebanon. The project, “Frictional Conversations,” combines research, conversational practice, and performative interventions.",
    "Weight": 4,
    "Id": 6
},
{
    "URL": "https://x.com/JehadAbusalim/status/1864071281848488380",
    "Date": "03/12/2024",
    "Text": "Nayrouz Abu Hatoum and Anna Shah Hoque examine themes of archival praxis, visual storytelling, and care through two Palestinian short films screened at the Palestine Film Festival in Toronto.",
    "Weight": 8,
    "Id": 7
},
{
    "URL": "https://x.com/JehadAbusalim/status/1864071219340796375",
    "Date": "03/12/2024",
    "Text": "“Palestinians practice media…to defy the media stereotypes that seek to reduce them to perpetrators or victims, and to mobilize imagination for liberation,” write Guest Editors \n@AmahlBishara\n and Diana Allan.",
    "Weight": 8,
    "Id": 8
},
{
    "URL": "https://x.com/JehadAbusalim/status/1864071097542434967",
    "Date": "03/12/2024",
    "Text": "In the editorial for the new special issue of the Journal of Palestine Studies, \n@shereneseikaly\n writes: “Elders know better than anyone that the expulsion of Palestinians has consistently been born of design,” contending on what it means to age during a genocide.",
    "Weight": 17,
    "Id": 9
},
{
    "URL": "https://x.com/mayamikdashi/status/1864034096025862287",
    "Date": "03/12/2024",
    "Text": "Can't emphasize enough to colleagues that Palestine Studies is a thriving, diverse & established academic field. Please read this special issue of JPS edited by \n@AmahlBishara\n & Diana Allen, anchored by another editors note from \n@shereneseikaly\n on elders & aging through a genocide",
    "Weight": 9,
    "Id": 10
},
{
    "URL": "https://x.com/PalStudies/status/1864044006235127904",
    "Date": "03/12/2024",
    "Text": "You read testimonies from Gaza. You explored our daily summaries during the genocide. You reposted our coverage & cited our scholarship. Our knowledge production has been crucial for your work in the movement for Palestine. Help us maintain it, donate: https://tinyurl.com/Donate2IPS",
    "Weight": 13,
    "Id": 11
},
{
    "URL": "https://x.com/alijla2021/status/1864058554002391265",
    "Date": "03/12/2024",
    "Text": "Beit Lahya in northern Gaza is being ethnically cleansed. Israel is planing a mass murder in the area….",
    "Weight": 8,
    "Id": 12
},
{
    "URL": "https://x.com/JehadAbusalim/status/1864025523854119134",
    "Date": "03/12/2024",
    "Text": "The ongoing genocide in Gaza has resulted in nearly 100,000 individuals sustaining life-altering injuries and disabilities. \n\nOne. Hundred. Thousand.",
    "Weight": 9,
    "Id": 13
},
{
    "URL": "https://x.com/JehadAbusalim/status/1863964908540285091",
    "Date": "03/12/2024",
    "Text": "Gaza now has the world’s highest rate of child amputees per capita.",
    "Weight": 4,
    "Id": 14
},
{
    "URL": "https://x.com/elgindy_/status/1863794404206489721",
    "Date": "03/12/2024",
    "Text": "“Many of the Gazans who have been arrested by the army and brought to Israel Defense Forces jails have disappeared without a trace. Their families don't know where they are, whether they are alive or dead and, if they are dead, how they died.”",
    "Weight": 8,
    "Id": 15
},
{
    "URL": "https://x.com/palstudies_ar/status/1863700670198460822",
    "Date": "02/12/2024",
    "Text": "نود تذكيركم بورشة عمل \"الاحتلال الإسرائيلي للأراضي الفلسطينية في ميزان العدالة الدولية: قراءة في الرأي الاستشاري لمحكمة العدل الدولية\" التي تدعوكم اليها مؤسسة الدراسات الفلسطينية يوم غد الثلاثاء 3 كانون الأول 2024، عند الساعة 12 ظهراً، عبر زوم.\nhttps://palestine-studies.org/ar/node/1656494",
    "Weight": 4,
    "Id": 16
},
{
    "URL": "https://x.com/PDeepdive/status/1863632355115585734",
    "Date": "02/12/2024",
    "Text": "NEW | “Zionism Must Be Defeated.” \n\nRe-reading Ghassan Kanafani in the Struggle Against Genocide | Hazem Jamjoum \n@fightapartheid",
    "Weight": 5,
    "Id": 17
},
{
    "URL": "https://x.com/JehadAbusalim/status/1863633743308550311",
    "Date": "02/12/2024",
    "Text": "Of course Kevin Spacey is in Israel. كل واحد يخلي باله من لغاليغه",
    "Weight": 4,
    "Id": 18
},
{
    "URL": "https://x.com/PalStudies/status/1863614517948887530",
    "Date": "02/12/2024",
    "Text": "Raz Segal and Sherene Seikaly on Settler Antisemitism, Israeli Mass Violence, and the Crisis of Holocaust and Genocide Studies https://x.com/i/broadcasts/1lPKqOoWBRMJb…",
    "Weight": 19,
    "Id": 19
},
{
    "URL": "https://x.com/JehadAbusalim/status/1863547638173376835",
    "Date": "02/12/2024",
    "Text": "I think this will expose the role of Israeli \"civilian\" individuals and companies in the ongoing genocide.",
    "Weight": 13,
    "Id": 20
},
{
    "URL": "https://x.com/JehadAbusalim/status/1863466261658673415",
    "Date": "02/12/2024",
    "Text": "Ceasefire in Gaza is within reach: Egypt has a new proposal, Palestinians have a vision for rebuilding and day after, Trump and the world want the war to end. But Netanyahu clings to endless war to save his career while pushing goals of settlement, annexation, & ethnic cleansing.",
    "Weight": 12,
    "Id": 21
},
{
    "URL": "https://x.com/JehadAbusalim/status/1863434511549186224",
    "Date": "02/12/2024",
    "Text": "We need a grassroots push for a Gaza ceasefire.",
    "Weight": 4,
    "Id": 22
},
{
    "URL": "https://x.com/romeramrem/status/1863026013204095329",
    "Date": "01/12/2024",
    "Text": "Free ebooks! I would recommend Light in Gaza. Lots of excellent essays.",
    "Weight": 4,
    "Id": 23
},
{
    "URL": "https://x.com/JehadAbusalim/status/1863023794824085548",
    "Date": "01/12/2024",
    "Text": "Israel killed 100 people in Gaza today. I listened to NPR this evening, and this wasn’t even reported in passing. There was even a report about an initiative to save endangered wolves somewhere, but no mention of the 100 people who were killed in less than 24 hours.",
    "Weight": 8,
    "Id": 24
},
{
    "URL": "https://x.com/JehadAbusalim/status/1862938193890279543",
    "Date": "30/11/2024",
    "Text": "Israel killed more than 51 Palestinians in Gaza today, and just now there are reports of a massacre in Jabalia, where more than 40 people were killed in an attack on a building where people were sheltering. Today’s toll alone will likely surpass 100 dead and more injured.",
    "Weight": 16,
    "Id": 25
},
{
    "URL": "https://x.com/JehadAbusalim/status/1862912768891904481",
    "Date": "30/11/2024",
    "Text": "Israel has employed every deranged method of brutality imaginable against the people of Gaza. Officials and civilians are reporting the use of weapons they have never experienced before. Gaza has become a testing ground for new weapons and tools of murder and destruction.",
    "Weight": 12,
    "Id": 26
},
{
    "URL": "https://x.com/JehadAbusalim",
    "Date": "03/06/2020",
    "Text": "هل تعلم أن مدينة غزة إحتضنت أحد أهم المعاهد العلمية في عهد الإمبراطورية البيزنطية؟ بين نهاية القرن الخامس الميلادي وبداية القرن السادس، كانت \"مدرسة غزة للخطابة\" (The Rhetorical School of Gaza) من أهم المعاهد التي درست علوم الخطابة، والأدب، والثقافة والفكر الإغريقيين.",
    "Weight": 4,
    "Id": 27
},
{
    "URL": "https://x.com/JehadAbusalim/status/1862609737650524238",
    "Date": "29/11/2024",
    "Text": "If you pay attention to the sticking point in the Gaza ceasefire talks, you can clearly see who is genuinely interested in ending the killing and destruction, and who seeks to perpetuate an endless war and bloodshed.",
    "Weight": 4,
    "Id": 28
},
{
    "URL": "https://x.com/thaqafatalhind/status/1862575778547847251",
    "Date": "29/11/2024",
    "Text": "The Post-October 7th Case of Toufic Haddad, former Director of the Council for British Research in the Levant Jerusalem Office, the Kenyon Institute.",
    "Weight": 5,
    "Id": 29
},
{
    "URL": "https://x.com/romeramrem/status/1862391016583516307",
    "Date": "29/11/2024",
    "Text": "Read Palestine Week? Here are some recommendations",
    "Weight": 4,
    "Id": 30
},
{
    "URL": "https://x.com/NourNaim88/status/1862319287958216760",
    "Date": "29/11/2024",
    "Text": "Heartbreaking: Harith Naim, a bright 12 year old, excelled in his studies, spoke eloquently, and had memorized the Quran. My cousin, was killed by an Israeli airstrike in central #Gaza.",
    "Weight": 12,
    "Id": 31
},
{
    "URL": "https://x.com/YousefMunayyer/status/1862133262262435953",
    "Date": "28/11/2024",
    "Text": "This is what happens when they get to the point that they realize they simply can not make a persuasive normative argument for Zionism. It is like a brat child taking their ball and going home, except to defend war crimes.",
    "Weight": 12,
    "Id": 32
},
{
    "URL": "https://x.com/PalStudies/status/1860003415121928226",
    "Date": "22/11/2024",
    "Text": "Shaimaa writes from Gaza.\n\"When your house is completely demolished, your belongings burned, your loved ones brutally killed, you are forcibly displaced, & all the schools you attended house others who are displaced, what do you have left but memories?\"",
    "Weight": 4,
    "Id": 33
},
{
    "URL": "https://x.com/PalStudies/status/1861132604315181428",
    "Date": "25/11/2024",
    "Text": "Join us on Monday Dec. 2 at 11am ET/6pm Palestine with \n@shereneseikaly\n and Raz Segal to discuss his recent article published in the Journal of Palestine Studies. Register: https://palestine-studies.org/en/node/1656467",
    "Weight": 12,
    "Id": 34
},
{
    "URL": "https://x.com/PalStudies/status/1861769873036021882",
    "Date": "27/11/2024",
    "Text": "“One incident can sometimes make you lose hope in life... A clothesline, a letter, a smashed finger — fragments through which a whole life takes shape in a reality where the norm has been suspended,” Reem Sleem, displaced from Gaza to Egypt, writes.",
    "Weight": 4,
    "Id": 35
},
{
    "URL": "https://x.com/PalStudies/status/1861558776043839622",
    "Date": "26/11/2024",
    "Text": "Geoffrey P. Levin reviews \n@azadessa\n's book for the Journal of Palestine Studies, writing: “Upon completing the book, one understands that the current India-Israel alignment has much deeper roots than the current Modi-Netanyahu synthesis.”",
    "Weight": 8,
    "Id": 36
},
{
    "URL": "https://x.com/JehadAbusalim/status/1861514560617730125",
    "Date": "26/11/2024",
    "Text": "Senator Benjamin Netanyahu (R-Israel)",
    "Weight": 4,
    "Id": 37
},
{
    "URL": "https://x.com/PalStudies/status/1861512009465860557",
    "Date": "26/11/2024",
    "Text": "We have published a special issue of the Journal of Palestine Studies co-edited by \n@AmahlBishara\n and Diana Keown Allan.  Contributions to this volume address how diverse media forms shape and express Palestinian lifeworlds and politics. https://tandfonline.com/toc/rpal20/53/3",
    "Weight": 8,
    "Id": 38
},
{
    "URL": "https://x.com/JehadAbusalim/status/1861504600324407569",
    "Date": "26/11/2024",
    "Text": "1/  Now more than ever, our team at \n@PalStudies\n needs your support. Since the genocide unfolded, IPS has launched key documentation projects and ensure facts and stories are not erased. Here’s what we’ve been working on: ",
    "Weight": 5,
    "Id": 39
},
{
    "URL": "https://x.com/JehadAbusalim/status/1861504610394861784",
    "Date": "26/11/2024",
    "Text": "7/ These efforts amplify Palestinian voices, preserve history, and hold the occupation accountable. But to continue and expand this vital work, we need your support. Every contribution helps.\n\n Donate Today:\n",
    "Weight": 9,
    "Id": 40
},
{
    "URL": "https://x.com/JehadAbusalim/status/1861504611787350426",
    "Date": "26/11/2024",
    "Text": "8/ Your support enables us to document the genocidal war on Palestinians and ensure these facts and stories are not lost. Please consider donating and sharing these resources with your community.",
    "Weight": 8,
    "Id": 41
},
{
    "URL": "https://x.com/JehadAbusalim/status/1861504608889380922",
    "Date": "26/11/2024",
    "Text": "6/ Exposing Conditions for Palestinian Prisoners\nWe’re analyzing systemic violence, legal changes, and the shifting realities for prisoners since Oct. 7, supported by research and media archives.\n …http://documentprisoners.palestine-studies.org/ar",
    "Weight": 8,
    "Id": 42
},
{
    "URL": "https://x.com/fadiquran/status/1861089771851747662",
    "Date": "25/11/2024",
    "Text": "When even \n@TheEconomist\n denounces Israel’s cynical weaponization of the accusation of anti-Semitism to silence critique, saying Israel’s leaders are “cheapening” the term, it is a signal  lies can no longer sustain themselves.\n\nTheir narrative is fracturing, even amidst allies.",
    "Weight": 11,
    "Id": 43
},
{
    "URL": "https://x.com/Hind_Gaza/status/1861367505010188704",
    "Date": "26/11/2024",
    "Text": "I did not choose reporting - reporting chose me. \n\nGaza | 416 Days",
    "Weight": 4,
    "Id": 44
},
{
    "URL": "https://x.com/itranslate123/status/1719701312990830934",
    "Date": "01/11/2023",
    "Text": "If I must die, let it be a tale. \n\n#FreePalestine \n#Gaza",
    "Weight": 8,
    "Id": 45
},
{
    "URL": "https://x.com/JehadAbusalim/status/1861184496030134629",
    "Date": "25/11/2024",
    "Text": "Israel killed 190 journalists in Gaza.",
    "Weight": 8,
    "Id": 46
},
{
    "URL": "https://x.com/Hind_Gaza/status/1861157640027447325",
    "Date": "25/11/2024",
    "Text": "Gaza | November 2024",
    "Weight": 4,
    "Id": 47
},
{
    "URL": "https://x.com/dandoon_danya/status/1861067422138028034",
    "Date": "25/11/2024",
    "Text": "What a disgusting headline from the paper of genocide the New York Times. \"Surviving Gaza\"? As if Gaza is itself the genocidal force that is maiming children and not the zionist settler state that is hellbent on erasing and disabling Palestinians inside and outside of Gaza.",
    "Weight": 30,
    "Id": 48
},
{
    "URL": "https://x.com/SometimesPooh/status/1860817010361540900",
    "Date": "24/11/2024",
    "Text": "Gazans are cold, and my timeline is filled with voices seeking creative ways to stay warm or whispering wishes for the rain to cease.",
    "Weight": 4,
    "Id": 49
},
{
    "URL": "https://x.com/JehadAbusalim/status/1860732093715677299",
    "Date": "24/11/2024",
    "Text": "German atonement for WWII crimes follows this logic: Jews can be considered European, but only outside Europe. To gain European acceptance and empathy, they must live somewhere else, and they’ve been handed a scapegoat—the Palestinians—to bear the brunt of their rage and trauma.",
    "Weight": 14,
    "Id": 50
},
{
    "URL": "https://x.com/JehadAbusalim/status/1860741332576186483",
    "Date": "24/11/2024",
    "Text": "None of this, of course, absolves Zionists of their agency in willingly participating in this equation.",
    "Weight": 10,
    "Id": 51
},
{
    "URL": "https://x.com/Hind_Gaza/status/1860604030646374557",
    "Date": "24/11/2024",
    "Text": "Forced Starvation \nMass Killing\nForced Displacement \n\nGaza | 414",
    "Weight": 4,
    "Id": 52
},
{
    "URL": "https://x.com/JehadAbusalim/status/1860046764541378800",
    "Date": "22/11/2024",
    "Text": "The significance of the ICC arrest warrants isn’t in the likelihood of their enforcement but in how they’ll hasten Israel and its allies’ efforts to dismantle the international order—one that was never just to us. Its collapse may give way to something better, or perhaps not.",
    "Weight": 4,
    "Id": 53
},
{
    "URL": "https://x.com/JehadAbusalim/status/1859729149876895915",
    "Date": "21/11/2024",
    "Text": "While Israelis and their supporters are having the meltdown of the century over the ICC arrest warrant, Israel tonight continues to besiege, bomb, and attack hospitals in northern Gaza. They want to commit a genocide in silence without consequences.",
    "Weight": 24,
    "Id": 54
},
{
    "URL": "https://x.com/PalStudies/status/1859719883233296413",
    "Date": "21/11/2024",
    "Text": ".\n@flstniya\n reports on the \n@IntlCrimCourt\n's decision today. Israel's Netanyahu & Gallant can now be arrested in 124 countries that are signatories to the Rome Statute as obliged to be prosecuted for war crimes and crimes against humanity committed in Gaza.",
    "Weight": 22,
    "Id": 55
},
{
    "URL": "https://x.com/AbujomaaGaza/status/1859584112811446500",
    "Date": "21/11/2024",
    "Text": "The luxurious clean water in #Gaza. 250ml per one USD",
    "Weight": 4,
    "Id": 56
},
{
    "URL": "https://x.com/Rola_seedo/status/1859582270501253484",
    "Date": "21/11/2024",
    "Text": "The medicine and disease crisis in Gaza will be a “butterfly effect” that will sweep the entire world.. E.coli bacteria that infects the digestive system & urinary tract, in Gaza, a new strain has been produced that infects bone tissues was recorded for the first time!",
    "Weight": 8,
    "Id": 57
},
{
    "URL": "https://x.com/JehadAbusalim/status/1859582876766949855",
    "Date": "21/11/2024",
    "Text": "I just read a comment by an Israeli journalist saying this is the first time the ICC issues arrest warrants against leaders of a Western state. Can these people make up their minds about what they are? Western? European? Middle Eastern? Native Judeans? Indigenous? Pick one!",
    "Weight": 8,
    "Id": 58
},
{
    "URL": "https://x.com/GhassanAbuSitt1/status/1859577394161410069",
    "Date": "21/11/2024",
    "Text": "ICC issues arrest warrant for Benjamin Netanyahu for alleged Gaza war crimes",
    "Weight": 16,
    "Id": 59
},
{
    "URL": "https://x.com/ShahdAbusalama/status/1859280236866650129",
    "Date": "20/11/2024",
    "Text": "ّI spoke to my uncle Abu Osama who miraculously emerged from the rubble of his home yesterday for the 2nd time during #GazaGenocide. Israel used AI robots to flatten their residential square in Beit-Lahia. Our conversation was devastating but serves as an account to a crime",
    "Weight": 13,
    "Id": 60
},
{
    "URL": "https://x.com/LailaAlarian/status/1859384190858408121",
    "Date": "20/11/2024",
    "Text": "Israel is committing nonstop massacres in Gaza as I type this. So much for the Biden-Harris administration lifting a finger to stop the slaughter. I don’t know how many more videos we can see of parents cradling their murdered children or children hugging their dead parents.",
    "Weight": 8,
    "Id": 61
},
{
    "URL": "https://x.com/JehadAbusalim/status/1859376675349274899",
    "Date": "20/11/2024",
    "Text": "Imagine losing 50 to 100 members of your community every day for over a year. How can one grasp the scale of killing and loss of life in Gaza? Beyond the murdered are the injured, missing, amputated, disabled, elderly, children, and pregnant. Imagine their unimaginable suffering.",
    "Weight": 4,
    "Id": 62
},
{
    "URL": "https://x.com/JehadAbusalim/status/1859374836255957345",
    "Date": "20/11/2024",
    "Text": "Israel, along with its allies and supporters in the West, rejects the accusation of genocide. Fine. But what do we call the daily killing of hundreds of people for over a year and the destruction and annihilation of entire communities, families, and towns?",
    "Weight": 9,
    "Id": 63
},
{
    "URL": "https://x.com/JehadAbusalim/status/1859372316649537717",
    "Date": "20/11/2024",
    "Text": "Seventy Palestinians, the majority of them women and children, were killed by Israel in a single airstrike on a neighborhood near a hospital in northern Gaza.",
    "Weight": 16,
    "Id": 64
},
{
    "URL": "https://x.com/JehadAbusalim/status/1858901642906661243",
    "Date": "19/11/2024",
    "Text": "“the Palestine guy”",
    "Weight": 4,
    "Id": 65
},
{
    "URL": "https://x.com/JehadAbusalim/status/1858577764049449225",
    "Date": "18/11/2024",
    "Text": "Download your free copy of the anthology Light in Gaza: Writings Born of Fire, which I had the honor of co-editing in 2022. Light in Gaza explores the critical role of Gaza in Palestinian identity, history, and the struggle for liberation. \n\nhttps://haymarketbooks.org/books/1861-light-in-gaza…",
    "Weight": 20,
    "Id": 66
},
{
    "URL": "https://x.com/JehadAbusalim/status/1858526031558131814",
    "Date": "18/11/2024",
    "Text": "Israel murdered 46 people in Gaza today.",
    "Weight": 8,
    "Id": 67
},
{
    "URL": "https://x.com/UssamaMakdisi/status/1858340315415142481",
    "Date": "18/11/2024",
    "Text": "I will be teaching my history of modern Palestine and the Palestinians this Spring semester at UC Berkeley.",
    "Weight": 12,
    "Id": 68
},
{
    "URL": "https://x.com/JehadAbusalim/status/1858155848347881941",
    "Date": "17/11/2024",
    "Text": "Israel has murdered 111 people in Gaza since today’s dawn. Don’t normalize this genocide; don’t normalize the daily slaughter of more than a hundred people. Don’t normalize the killing and incineration of women, men, and children. Ceasefire now!",
    "Weight": 13,
    "Id": 69
},
{
    "URL": "https://x.com/JehadAbusalim/status/1858046769273212954",
    "Date": "17/11/2024",
    "Text": "Israel has just committed a horrific massacre in northern Gaza, bombing a building in Beit Lahia where more than 70 people were sheltering, killing 50 of them, with the read injured or missing.",
    "Weight": 8,
    "Id": 70
},
{
    "URL": "https://x.com/JehadAbusalim/status/1857955649436467285",
    "Date": "17/11/2024",
    "Text": "Israel murdered 38 Palestinians in Gaza in less than 24 hours.",
    "Weight": 16,
    "Id": 71
},
{
    "URL": "https://x.com/YousefAljamal/status/1857429292470153580",
    "Date": "15/11/2024",
    "Text": "This copy of Gaza Writes Back was with Refaat Alareer when he was assassinated.",
    "Weight": 4,
    "Id": 72
},
{
    "URL": "https://x.com/JehadAbusalim/status/1857409851963429194",
    "Date": "15/11/2024",
    "Text": "Gaza before the Israeli occupation in 1967:",
    "Weight": 17,
    "Id": 73
},
{
    "URL": "https://x.com/palstudies_ar/status/1856834434038641127",
    "Date": "13/11/2024",
    "Text": "أباهر السقا: \"كيف نقرأ الحالة الاستعمارية/المستعمرية 1948 و 1967\"\nنُشرت هذه الدراسة في مجلة الدراسات الفلسطينية ضمن (العدد 140/خريف 2024) \"تحية إلى الياس خوري\".\nلقراءة الدراسة:\nhttps://palestine-studies.org/ar/node/1656247\nوالإطلاع العدد 140:\nhttps://palestine-studies.org/ar/node/1656229",
    "Weight": 8,
    "Id": 74
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1856731179552026686",
    "Date": "13/11/2024",
    "Text": "Honored to have contributed to \n@AlShabaka\n’s latest roundtable: Trump’s Return: Implications for the Palestinian Struggle. \n\nI shared some thoughts on what Trump’s return could mean for US engagement with Palestinian leadership. Read more here:",
    "Weight": 8,
    "Id": 75
},
{
    "URL": "https://x.com/MahaGaza/status/1855869595732640081",
    "Date": "11/11/2024",
    "Text": "If you no longer see reports about Israeli massacres in northern Gaza, it’s not because they have stopped, but because the Israeli occupation has killed most of the journalists there for this exact reason: to keep you from knowing about them.\n\nMassacres are being committed 24/7",
    "Weight": 25,
    "Id": 76
},
{
    "URL": "https://x.com/NoamPeleg/status/1855716376301998535",
    "Date": "10/11/2024",
    "Text": "Tel Aviv University invites students and staff to prepare food packages for Israeli soldiers. The University will provide buses to an army base where packing will take place. Explicit complicity in war crimes. Time for academic boycott",
    "Weight": 21,
    "Id": 77
},
{
    "URL": "https://x.com/JehadAbusalim/status/1854711815432802791",
    "Date": "08/11/2024",
    "Text": "Israel killed 80 Palestinians in Gaza today. 80 people.",
    "Weight": 16,
    "Id": 78
},
{
    "URL": "https://x.com/JehadAbusalim/status/1852479520214790553",
    "Date": "01/11/2024",
    "Text": "Israel just committed a horrific massacre in northern Gaza, killing 84 people, including 50 children, after Israeli forces bombed residential buildings. \n\n84 people, 50 children. \n\n84 people, 50 children. \n\n84 people, 50 children. \n\n84 people, 50 children.",
    "Weight": 16,
    "Id": 79
},
{
    "URL": "https://x.com/JehadAbusalim/status/1852108912134066567",
    "Date": "31/10/2024",
    "Text": "Tonight, many of Israel’s supporters in the American suburbs will sleep better knowing more of our women, children, and men were massacred today.",
    "Weight": 4,
    "Id": 80
},
{
    "URL": "https://x.com/JehadAbusalim/status/1852081864523079801",
    "Date": "31/10/2024",
    "Text": "If Israel’s supporters in the West, who advocate for criminalizing speech that compares Israel to the Nazis, don’t want these comparisons, perhaps they should call up their Israeli friends and ask them to stop marking detainees by writing numbers on their foreheads.",
    "Weight": 20,
    "Id": 81
},
{
    "URL": "https://x.com/JehadAbusalim/status/1852032753945976997",
    "Date": "31/10/2024",
    "Text": "Israel’s list of targets is pretty consistent: ancient old city (they don’t understand its value because they’re yet to prove “theirs” ever existed), hospital, school, mosque, church, shelter, factory, university, clinic, market",
    "Weight": 4,
    "Id": 82
},
{
    "URL": "https://x.com/ThisIsBeirut_/status/1851520329564233987",
    "Date": "30/10/2024",
    "Text": "#WORLD \n\nExpecting a permanent ceasefire in Gaza or Lebanon just days before the end of President Joe Biden’s term is overly optimistic, if not entirely unrealistic. \n\nBy \n@RamiRayess\n \nhttps://thisisbeirut.com.lb/articles/1300024/israel-us-approaching-washingtons-presidential-transition…",
    "Weight": 8,
    "Id": 83
},
{
    "URL": "https://x.com/JehadAbusalim/status/1851232724951961759",
    "Date": "29/10/2024",
    "Text": "Israel murdered ONE HUNDRED Palestinians in Gaza in less than 24 hours, 94 were killed in northern Gaza.",
    "Weight": 20,
    "Id": 84
},
{
    "URL": "https://x.com/galpalpheebs/status/1851327619683533137",
    "Date": "29/10/2024",
    "Text": "Israel committed a second massacre against civilians in a matter of hours in Saida!!",
    "Weight": 4,
    "Id": 85
},
{
    "URL": "https://x.com/JehadAbusalim/status/1851327713476497426",
    "Date": "29/10/2024",
    "Text": "Many people in the West are emotionally, ideologically, and spiritually invested in the Zionist project. These people go to bed each night fully aware of the harm, death, and destruction Zionism inflicts on its victims—and they accept this reality without any moral reservations.",
    "Weight": 5,
    "Id": 86
},
{
    "URL": "https://x.com/JehadAbusalim/status/1851271568787185678",
    "Date": "29/10/2024",
    "Text": "Israel has just carried out another massacre, bombing a market in Gaza City. This comes on the same day that Israel killed over 115 Palestinians in Gaza.",
    "Weight": 24,
    "Id": 87
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1851270985325977907",
    "Date": "29/10/2024",
    "Text": "In 24 days, Israel killed over 1000 Palestinians in northern Gaza. \n\nIn 24 hours, Israel killed almost 100 Palestinians in a single air strike on a multistory home in Beit Lahia.",
    "Weight": 28,
    "Id": 88
},
{
    "URL": "https://x.com/MouinRabbani/status/1851238903044313530",
    "Date": "29/10/2024",
    "Text": "Palestinians are killing Israeli soldiers and the Israeli military is massacring entire Palestinian families on a daily basis in territory the ICJ has ruled Israel illegally occupies. But Palestinians are terrorists and Israel is engaged in self-defense...",
    "Weight": 54,
    "Id": 89
},
{
    "URL": "https://x.com/JehadAbusalim/status/1851239612670201885",
    "Date": "29/10/2024",
    "Text": "It’s clear why Israel is killing more than 100 Palestinians daily in Gaza: not for the hostages, not to reach a political settlement, not to engage Hamas. It’s a deliberate campaign of ethnic cleansing, and an intensified attempt to eliminate and uproot an entire population.",
    "Weight": 20,
    "Id": 90
},
{
    "URL": "https://x.com/JehadAbusalim/status/1851239616600285636",
    "Date": "29/10/2024",
    "Text": "Israel’s state and non-state allies appear content with its actions in Gaza, offering no pushback against the mass killing of an entire population. For them, Palestinian lives seem not to matter. They are normalizing a 21st-century model for population uprooting and elimination.",
    "Weight": 12,
    "Id": 91
},
{
    "URL": "https://x.com/JehadAbusalim/status/1851239618152161669",
    "Date": "29/10/2024",
    "Text": "Why should this matter to you? What’s happening in Gaza sets a dangerous precedent for the fascist elimination of “unwanted” populations, now backed by the major institutions and of the “liberal” and “democratic” West. You will be next.",
    "Weight": 4,
    "Id": 92
},
{
    "URL": "https://x.com/JehadAbusalim/status/1851234435305275633",
    "Date": "29/10/2024",
    "Text": "The Zionist idea is based on the premise that Palestinian and Arab lives don’t matter. The Zionist project maintains its existence by constantly trying to prove that our lives are disposable and don’t matter. This is an insane fascist project that needs to be stopped now.",
    "Weight": 14,
    "Id": 93
},
{
    "URL": "https://x.com/JehadAbusalim/status/1851168741913997498",
    "Date": "29/10/2024",
    "Text": "Israel just murdered more than 77 Palestinians in northern Gaza. \n\nIf you choose to remain silent on these atrocities, then you’re complicit.",
    "Weight": 16,
    "Id": 94
},
{
    "URL": "https://x.com/JehadAbusalim/status/1851167505080824289",
    "Date": "29/10/2024",
    "Text": "Horrific massacre in northern Gaza: Israel killed over 77 people in a single airstrike on a building in Beit Lahia. Dozens remain missing or unaccounted for.",
    "Weight": 8,
    "Id": 95
},
{
    "URL": "https://x.com/JehadAbusalim/status/1851165531912515818",
    "Date": "29/10/2024",
    "Text": "Horrific massacre in northern Gaza. Israel murdered more than 65 people, including 17 children, in just one airstrike on a building in Beit Lahia.",
    "Weight": 8,
    "Id": 96
},
{
    "URL": "https://x.com/JehadAbusalim/status/1850914676218982867",
    "Date": "28/10/2024",
    "Text": "The ease with which Zionists destroy historical and heritage sites and neighborhoods in our region further proves that how \"indigenous\" they are in the region! They are literally destroying thousands of years of history while fantasizing about expanding their ugly settlements.",
    "Weight": 10,
    "Id": 97
},
{
    "URL": "https://x.com/forresttdweller/status/1850558370828194122",
    "Date": "27/10/2024",
    "Text": "There is a small girl in this photo. Detained by Israeli occupation forces amongst hundreds of half undressed men.",
    "Weight": 13,
    "Id": 98
},
{
    "URL": "https://x.com/JehadAbusalim/status/1850614317626069135",
    "Date": "27/10/2024",
    "Text": "The men in al-Ramleh, confined behind barbed wire, endured hunger & thirst in July's scorching heat, sleeping on the ground without blankets. The Zionist militias occasionally provided water rations, which were distributed by the younger children & siblings of the imprisoned men.",
    "Weight": 5,
    "Id": 99
},
{
    "URL": "https://x.com/JehadAbusalim/status/1850530852091945312",
    "Date": "27/10/2024",
    "Text": "Israel murdered 47 Palestinians in Gaza today. 43 were killed in northern Gaza.",
    "Weight": 20,
    "Id": 100
},
{
    "URL": "https://x.com/JehadAbusalim/status/1850180042845725155",
    "Date": "26/10/2024",
    "Text": "Another major Israeli military victory against a hospital.",
    "Weight": 8,
    "Id": 101
},
{
    "URL": "https://x.com/JehadAbusalim/status/1850178742477259008",
    "Date": "26/10/2024",
    "Text": "We’re dealing with Nazis.",
    "Weight": 4,
    "Id": 102
},
{
    "URL": "https://x.com/PalStudies/status/1850151647013478557",
    "Date": "26/10/2024",
    "Text": "The First Palestine Arab Women's Congress was held 95 years ago in Jerusalem. Indicating the impact and political organization of women, the Congress established a 14-member Executive Committee and recommended the establishment of women societies in Palestinian cities. ",
    "Weight": 8,
    "Id": 103
},
{
    "URL": "https://x.com/JehadAbusalim/status/1850146979185111058",
    "Date": "26/10/2024",
    "Text": "The Israeli attack on Iran has not fully met the expectations of the Israeli public, as it did not include:\n\n- Bombing or raiding of hospitals, schools, and shelters\n- Israeli soldiers wearing lingerie \n- Photos of Iranian civilian casualties shared for mockery on telegram",
    "Weight": 30,
    "Id": 104
},
{
    "URL": "https://x.com/ytirawi/status/1850122317331853627",
    "Date": "26/10/2024",
    "Text": "Tel Hawwa, Gaza City, December 2023, 202 paratroopers battalion |",
    "Weight": 4,
    "Id": 105
},
{
    "URL": "https://x.com/LailaAlarian/status/1849866478033699305",
    "Date": "25/10/2024",
    "Text": "Journalists around the world silent about the killing of their Palestinian colleagues don’t seem to realize that Israel’s continuous killing and maiming of journalists is setting a dangerous precedent that could imperil media workers everywhere.",
    "Weight": 8,
    "Id": 106
},
{
    "URL": "https://x.com/palstudies_ar/status/1849832791522824641",
    "Date": "25/10/2024",
    "Text": "يوميات الحرب على غزة ولبنان، 25 تشرين الأول/أكتوبر 2024\n\nللاطلاع على كامل الأخبار :\nhttps://digitalprojects.palestine-studies.org/ar/daily/chronology/2024-10-25…",
    "Weight": 4,
    "Id": 107
},
{
    "URL": "https://x.com/JehadAbusalim/status/1849833002508935321",
    "Date": "25/10/2024",
    "Text": "Settler-terrorist Shuvael Ben-Natan went to Gaza to murder “as many women, children,” according to his brother Uriyah, who is seen whimpering in this clip. Shuvael’s career of murdering women and children ended in Lebanon, where he recently found out:",
    "Weight": 9,
    "Id": 108
},
{
    "URL": "https://x.com/JehadAbusalim/status/1849793782042026009",
    "Date": "25/10/2024",
    "Text": "Since this morning, Israel has killed 81 Palestinians in Gaza. Eighty-one human beings with names, lives, stories, and dreams. EIGHTY-ONE.",
    "Weight": 16,
    "Id": 109
},
{
    "URL": "https://x.com/mhdksafa/status/1849756396176171502",
    "Date": "25/10/2024",
    "Text": "NO FOOD HAS ENTERED GAZA SINCE OCTOBER 1ST.\n\nGaza is not starving. Gaza is being starved by Israel.",
    "Weight": 16,
    "Id": 110
},
{
    "URL": "https://x.com/hamzattar/status/1849743371134259524",
    "Date": "25/10/2024",
    "Text": "Since the 7th of October, Israel has killed more than 186 journalists in Gaza & Lebanon (175 and 11, respectively).",
    "Weight": 8,
    "Id": 111
},
{
    "URL": "https://x.com/Teebi_MD/status/1849535142487826723",
    "Date": "24/10/2024",
    "Text": "This is the first war in history where hospitals are systematically targeted. 900+ healthcare workers killed.\n…\nIsraeli tanks surrounded Kamal Adwan Hospital & demand on loudspeakers everyone inside evacuate.\n\n5 newborns in incubators & multiple children on ventilators inside.",
    "Weight": 8,
    "Id": 112
},
{
    "URL": "https://x.com/JehadAbusalim/status/1849501383977841077",
    "Date": "24/10/2024",
    "Text": "Daniella Weiss is a Nazi who views Gaza as Lebensraum. She and her settler friends have no issue settling in a place that has become a literal mass grave, where thousands lie buried under rubble—on every street corner, in hospital grounds, and schoolyards.",
    "Weight": 6,
    "Id": 113
},
{
    "URL": "https://x.com/JehadAbusalim/status/1849460721194557574",
    "Date": "24/10/2024",
    "Text": "Good morning. We cannot afford to fall into despair or pessimism. If Gaza’s doctors, nurses, journalists, and first responders are working tirelessly, day and night, despite losing loved ones, then we have no excuse not to work, organize, protest, and keep pushing forward.",
    "Weight": 4,
    "Id": 114
},
{
    "URL": "https://x.com/JehadAbusalim/status/1849459093255172114",
    "Date": "24/10/2024",
    "Text": "The idea behind the trap set for Israel was never about defeating it militarily—no reasonable person would believe that. The goal was to drag Israel into a deep moral and ethical downfall, from which there would be no return, no healing, and no recovery—and it fell for it.",
    "Weight": 8,
    "Id": 115
},
{
    "URL": "https://x.com/JehadAbusalim/status/1849448680555716753",
    "Date": "24/10/2024",
    "Text": "Why do you think Israel hires spokespersons from Western countries who aren’t Israeli citizens or weren’t raised in Israel?",
    "Weight": 16,
    "Id": 116
},
{
    "URL": "https://x.com/AbirKopty/status/1849189205953392730",
    "Date": "23/10/2024",
    "Text": "Important thread  on who really stands behind the “Generals’ Plan” to ethnically cleanse North Gaza.\nIt turns out that retired Gen. Giora Eiland & the other generals signed on it are only the “presenters” of a plan that was put together by pro settlement organizations: \n1/6",
    "Weight": 4,
    "Id": 117
},
{
    "URL": "https://x.com/JehadAbusalim/status/1849434324040380822",
    "Date": "24/10/2024",
    "Text": "Societies don’t turn genocidal overnight. Genocide and annihilation began when, from the Israeli perspective, it became normal to live on stolen land and homes, keeping the rightful owners and their descendants trapped in camps indefinitely to maintain the status quo.",
    "Weight": 13,
    "Id": 118
},
{
    "URL": "https://x.com/JehadAbusalim/status/1849244923985264672",
    "Date": "24/10/2024",
    "Text": "Nazis.",
    "Weight": 4,
    "Id": 119
},
{
    "URL": "https://x.com/JehadAbusalim/status/1848874196706988342",
    "Date": "22/10/2024",
    "Text": "How does hollowing out the fragile head and skull of a child in Gaza make Israel and Zionists feel safe? What does this brutality have to do with any of Israel’s arguments for this carnage? How many dead children will it take for Zionists to achieve their revenge and be done?",
    "Weight": 32,
    "Id": 120
},
{
    "URL": "https://x.com/JehadAbusalim",
    "Date": "10/05/2021",
    "Text": "Two years ago, Israel killed 60 Palestinian protestors and injured 1700 at the separation fence in one day. The following day, this was one of the main headlines of the NYT’s coverage of the death of 60 people with names, stories, and dreams.",
    "Weight": 8,
    "Id": 121
},
{
    "URL": "https://x.com/JehadAbusalim/status/1848739595992666303",
    "Date": "22/10/2024",
    "Text": "According to \n@CNN\n, the issue here isn’t that Israeli soldiers ran over hundreds of people, dead and alive, with their Caterpillar D9 bulldozers, until their bodies “squirted out.” No, the takeaway is that the soldier now can’t eat meat and has trouble sleeping at night. SO SAD.",
    "Weight": 8,
    "Id": 122
},
{
    "URL": "https://x.com/JehadAbusalim/status/1848741486919045378",
    "Date": "22/10/2024",
    "Text": "Also, take note of the editor’s disclaimer. It highlights “suicide” specifically, and “violence” in vague, general, & abstract terms as things the reader might find upsetting. The suffering of Israeli soldiers is clearly mentioned & defined, while their atrocities are obscured.",
    "Weight": 8,
    "Id": 123
},
{
    "URL": "https://x.com/RamiRayess/status/1848726242083704984",
    "Date": "22/10/2024",
    "Text": "Within few seconds, a whole building was shattered in #Beirut, in a highly populated neighborhood, during daylight… Who will stop those uninterrupted crimes?",
    "Weight": 2,
    "Id": 124
},
{
    "URL": "https://x.com/Lau_Bast/status/1848698880008823052",
    "Date": "22/10/2024",
    "Text": "A few weeks ago, at the persistence of some journalists I work with, I sat down and finally wrote something - what it’s like, a year into the genocide and counting, working with writers in Gaza on their testimonies while contending with loss myself.",
    "Weight": 9,
    "Id": 125
},
{
    "URL": "https://x.com/GhassanAbuSitt1/status/1848673599189660058",
    "Date": "22/10/2024",
    "Text": "In Gaza Israel was able to normalize savergery in war and raise the bar in brutality so high everything it does elsewhere appears restrained.",
    "Weight": 8,
    "Id": 126
},
{
    "URL": "https://x.com/emanabdelhadi/status/1848343261556899982",
    "Date": "21/10/2024",
    "Text": "Israel has killed 670 Palestinians in the last 17 days.",
    "Weight": 12,
    "Id": 127
},
{
    "URL": "https://x.com/weizman_eyal/status/1848456565507911758",
    "Date": "21/10/2024",
    "Text": "The Israeli army put in a system of spatial control by reshaping the area they call the ‘north’ through acts of both destruction and construction. The destruction of buildings and fields lays the ground for the construction of new roads that act as wedges to force people out.",
    "Weight": 8,
    "Id": 128
},
{
    "URL": "https://x.com/JehadAbusalim/status/1848502251427438788",
    "Date": "21/10/2024",
    "Text": "When Israel sees a hospital",
    "Weight": 4,
    "Id": 129
},
{
    "URL": "https://x.com/JehadAbusalim/status/1848446930202071239",
    "Date": "21/10/2024",
    "Text": "Israel banned several medical missions from Gaza. Nurse Abeerah Muhammad & Dr. Abdullah Ghali both served on missions : “We cannot stand by as Gaza’s health sector crumbles under the weight of military aggression and widespread political indifference.”",
    "Weight": 12,
    "Id": 130
},
{
    "URL": "https://x.com/AnasAlSharif0/status/1847761160814416215",
    "Date": "19/10/2024",
    "Text": "One of the children who survived the devastating Israeli airstrikes in northern Gaza.",
    "Weight": 12,
    "Id": 131
},
{
    "URL": "https://x.com/JehadAbusalim/status/1847760082203005273",
    "Date": "19/10/2024",
    "Text": "Israel is carrying out extermination in northern Gaza. This isn’t a term coined by me or other Palestinians to describe what’s happening. It was Israeli academics and generals who used the term extermination to describe plans for ending the Palestinian presence in northern Gaza.",
    "Weight": 32,
    "Id": 132
},
{
    "URL": "https://x.com/ShaimaZiara/status/1847741034593185971",
    "Date": "19/10/2024",
    "Text": "Northern Gaza is being wiped out neighborhood by neighborhood while the world continues to watch. We’ve seen the worst of what humanity has to offer, and the world just looks the other way and keeps going.",
    "Weight": 4,
    "Id": 133
},
{
    "URL": "https://x.com/AnasAlSharif0/status/1847740051721245072",
    "Date": "19/10/2024",
    "Text": "The Israeli occupation army has committed a horrific massacre in the Beit Lahia project in northern Gaza, resulting in 73 martyrs so far and dozens of injured and missing, most of whom are women and children, following the bombardment of densely populated residential blocks.",
    "Weight": 17,
    "Id": 134
},
{
    "URL": "https://x.com/JehadAbusalim/status/1847741160766198176",
    "Date": "19/10/2024",
    "Text": "The Beit Lahia massacre Israel just committed is even worse than initially thought. The death toll has now surpassed 70, mostly women and children, all from a single airstrike. Dozens more are injured or missing, and the numbers are rising as many are still unaccounted for.",
    "Weight": 4,
    "Id": 135
},
{
    "URL": "https://x.com/JehadAbusalim/status/1847738380798304542",
    "Date": "19/10/2024",
    "Text": "Israel has just killed over 50 people in a single airstrike, and since this morning, more than 50 Palestinians have also been killed in Gaza. What do you call a situation where every single day, for months, 50 to 100 members of your community or nation are killed?",
    "Weight": 16,
    "Id": 136
},
{
    "URL": "https://x.com/AnasAlSharif0/status/1847496956173537729",
    "Date": "19/10/2024",
    "Text": "A Gaza Ministry of Health official to Al Jazeera: A number of civilians have died of hunger and thirst inside their homes in Jabalia due to the ongoing siege.",
    "Weight": 4,
    "Id": 137
},
{
    "URL": "https://x.com/JehadAbusalim/status/1847595947288609240",
    "Date": "19/10/2024",
    "Text": "When will Google Maps update its satellite imagery of Gaza to reflect the changes from the past year?",
    "Weight": 4,
    "Id": 138
},
{
    "URL": "https://x.com/Dotty_dot_dot/status/1847360295179571379",
    "Date": "18/10/2024",
    "Text": "Israel has arbitrarily denied 7 international aid organizations access to the Gaza Strip, which means they can no longer send in healthcare workers. This is an alarming decision that will cause significant loss of life. A ",
    "Weight": 8,
    "Id": 139
},
{
    "URL": "https://x.com/JehadAbusalim/status/1847393120452739146",
    "Date": "18/10/2024",
    "Text": "Israel is committing extermination in Jabalia—massacre after massacre. I have nothing more to add. I’ve been writing, talking, and screaming, but there are no words left, not in the way the cliché suggests, but literally. Entire families are being wiped out. Shame on all of us.",
    "Weight": 4,
    "Id": 140
},
{
    "URL": "https://x.com/AnasAlSharif0/status/1847337894869913696",
    "Date": "18/10/2024",
    "Text": "In northern Gaza, thousands of families are trapped between tanks, their gunfire, and heavy artillery shelling.\nMany of the dead and wounded remain under the rubble after Israeli occupation forces destroyed their homes over their heads.",
    "Weight": 17,
    "Id": 141
},
{
    "URL": "https://x.com/JehadAbusalim/status/1847354511809269826",
    "Date": "18/10/2024",
    "Text": "As Israel’s aggression expands to engulf Lebanon, it’s important to understand the broader context. The following reading list, presented by the Journal of Palestine Studies, delves into Israel’s history of invasions and destabilization in the region.",
    "Weight": 12,
    "Id": 142
},
{
    "URL": "https://x.com/LibyanIntegrity/status/1847079549604946290",
    "Date": "18/10/2024",
    "Text": "I just don’t get why Western journalists couldn’t come together and issue a statement demanding Israel allow their fallen colleague to get the treatment he needs!\nBizarre.",
    "Weight": 4,
    "Id": 143
},
{
    "URL": "https://x.com/JehadAbusalim/status/1846884122054082779",
    "Date": "17/10/2024",
    "Text": "Israel has just massacred over 22 Palestinians who were seeking shelter in a school in northern Gaza, leaving dozens more injured. Some of the victims were burned alive.",
    "Weight": 16,
    "Id": 144
},
{
    "URL": "https://x.com/RamiRayess/status/1846837465509695573",
    "Date": "17/10/2024",
    "Text": "Assuming the US will stand for its position this time, what about the 30 coming days? Starvation continues? Keep on sending weapons to Israel? Calling for something and its opposite simultaneously!\n\n#GazaUnderSiege",
    "Weight": 8,
    "Id": 145
},
{
    "URL": "https://x.com/brendancbrowne/status/1846820399247479175",
    "Date": "17/10/2024",
    "Text": "Proud to share an intellectual platform with incredible scholars in this \n@PalStudies\n volume.\n\nHaving a piece in this journal alongside an in memoriam for \n@itranslate123\n is beyond humbling. \n\nWe learn from his example everyday. Forever missed, but never forgotten.\n\nFree Palestine.",
    "Weight": 4,
    "Id": 146
},
{
    "URL": "https://x.com/PalStudies/status/1846558887039717676",
    "Date": "16/10/2024",
    "Text": "The newest issue of the Journal of Palestine Studies is out now. Read powerful analysis addressing the different fronts of Israel’s genocide against the people of Palestine, along with compelling narratives of steadfastness and survival: https://tandfonline.com/toc/rpal20/53/2",
    "Weight": 17,
    "Id": 147
},
{
    "URL": "https://x.com/JehadAbusalim/status/1846232536076505343",
    "Date": "15/10/2024",
    "Text": "Again: Zionists’ FEELINGS about the situation matter more than those affected by it—the main victims, the ones who are being killed, burned alive, tortured, raped, displaced, expelled, ethnically cleansed, orphaned, impoverished, dislimbed, separated from their families, etc.",
    "Weight": 10,
    "Id": 148
},
{
    "URL": "https://x.com/LailaAlarian/status/1845999181996913129",
    "Date": "15/10/2024",
    "Text": "There’s plenty of open source information about the 19 year old young man, Shaban Al-Dalou that journalists can use to paint a textured, human portrait of him and his life. But because Palestinians are so dehumanized I won’t hold my breath about that happening.",
    "Weight": 8,
    "Id": 149
},
{
    "URL": "https://x.com/AJEnglish/status/1845456958889001498",
    "Date": "13/10/2024",
    "Text": "\"I thought those fighting hard for peace in Gaza would deserve it.\" \n\nToshiyuki Mimaki, the Japanese anti-nuclear campaigner whose group, Nihon Hidankyo, won the Nobel Peace Prize, says he was surprised they won the award instead of people working to stop Israel’s war on Gaza.",
    "Weight": 12,
    "Id": 150
},
{
    "URL": "https://x.com/NourNaim88/status/1845930508112240981",
    "Date": "14/10/2024",
    "Text": "This gentle young man, Shaaban, was burned alive by Israel on live broadcast. \n\nWe will never forget you, Shaaban. \nNo matter how much time passes, we will never forget or forgive what Israel has done. \n\nJustice will be served\n#GazaGenocide",
    "Weight": 17,
    "Id": 151
},
{
    "URL": "https://x.com/JehadAbusalim/status/1845611124181340661",
    "Date": "13/10/2024",
    "Text": "Remember, for many, the feelings and emotions of privileged upper class Zionists matter more than the fact that Israel is burning people, including children, alive, while sleeping in their tents. What do you call this ideology?",
    "Weight": 14,
    "Id": 152
},
{
    "URL": "https://x.com/JehadAbusalim/status/1845610203942715877",
    "Date": "13/10/2024",
    "Text": "Israel is burning people alive in Gaza.\n\nIsrael is burning people alive in Gaza.\n\nIsrael is burning people alive in Gaza.\n\nIsrael is burning people alive in Gaza.\n\nIsrael is burning people alive in Gaza.\n\nIsrael is burning people alive in Gaza.",
    "Weight": 48,
    "Id": 153
},
{
    "URL": "https://x.com/JehadAbusalim/status/1845607430450725346",
    "Date": "13/10/2024",
    "Text": "Israel is an extermination regime. \n\nExtermination regimes must be dismantled.",
    "Weight": 4,
    "Id": 154
},
{
    "URL": "https://x.com/JehadAbusalim/status/1845603769955836346",
    "Date": "13/10/2024",
    "Text": "Israel is burning Palestinian civilians alive in Gaza. The Israeli regime has become a modern-day extermination force. It must be dismantled, and its leaders and military commanders should face an international tribunal for their crimes.",
    "Weight": 22,
    "Id": 155
},
{
    "URL": "https://x.com/JehadAbusalim/status/1845603771952640370",
    "Date": "13/10/2024",
    "Text": "The Palestinian people deserve repatriation, justice, and compensation for the devastation they’ve endured for a more than a century.",
    "Weight": 4,
    "Id": 156
},
{
    "URL": "https://x.com/JehadAbusalim/status/1845595218806227083",
    "Date": "13/10/2024",
    "Text": "Israel bombed the tents of displaced people inside the Al-Aqsa Martyrs Hospital in Deir el-Balah, burning families inside while they were sleeping.",
    "Weight": 4,
    "Id": 157
},
{
    "URL": "https://x.com/JehadAbusalim/status/1845595043484086415",
    "Date": "13/10/2024",
    "Text": "Israel bombed the tents of displaced people inside the Al-Aqsa Martyrs Hospital in Deir el-Balah, burning families inside while they were sleeping.",
    "Weight": 4,
    "Id": 158
},
{
    "URL": "https://x.com/JehadAbusalim/status/1845477898704011324",
    "Date": "13/10/2024",
    "Text": "\"Netanyahu mulls plan to empty northern Gaza of civilians and cut off aid to those left inside\"\n\nhttps://abcnews.go.com/International/wireStory/netanyahu-mulls-plan-empty-northern-gaza-civilians-cut-114759912…",
    "Weight": 8,
    "Id": 159
},
{
    "URL": "https://x.com/JehadAbusalim/status/1845475749744017813",
    "Date": "13/10/2024",
    "Text": "Like Ben Gurion once said: \"Since I invoke Torah so often, let me state that I don't personally believe in the God it postulates. I am not religious, nor were the majority of the early builders of Israel believers. Yet their passion for this land stemmed from the Book of Books.\"",
    "Weight": 4,
    "Id": 160
},
{
    "URL": "https://x.com/JehadAbusalim/status/1845474223042568459",
    "Date": "13/10/2024",
    "Text": "Israel just massacred a group of children who were playing in Al-Shati’ camp in Gaza. But no need for concern on your end, it’s just our children’s lives ending far too soon.",
    "Weight": 8,
    "Id": 161
},
{
    "URL": "https://x.com/LailaAlarian/status/1845454240908705904",
    "Date": "13/10/2024",
    "Text": "There is a near total US media blackout of Israel’s killing in northern Gaza. You would never know that Jabalia has been turned into an extermination camp.",
    "Weight": 8,
    "Id": 162
},
{
    "URL": "https://x.com/MahaGaza/status/1845195484593287645",
    "Date": "12/10/2024",
    "Text": "Israel hasn't stopped genocide in Gaza since 7 October 2023, but somehow it's now repeating it.",
    "Weight": 13,
    "Id": 163
},
{
    "URL": "https://x.com/palinfoen/status/1845212956763570307",
    "Date": "12/10/2024",
    "Text": "Genocidal #Israel bombed a house in #Nusairat refugee camp, and murdered at least 8 Palestinians!!!\n\n#PalestineWillBeFree \n#GazaGenocide",
    "Weight": 25,
    "Id": 164
},
{
    "URL": "https://x.com/LailaAlarian/status/1845202519376658453",
    "Date": "12/10/2024",
    "Text": "Everyone in north Gaza is posting goodbyes because Israel has been permitted to carry out a war of annihilation",
    "Weight": 8,
    "Id": 165
},
{
    "URL": "https://x.com/aburtema/status/1845063669152976946",
    "Date": "12/10/2024",
    "Text": "My piece on the Time magazine\n#Gaza\n#لبنان\n#اليمن\n#Lebnon\n#Palestine",
    "Weight": 8,
    "Id": 166
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1844855919240261791",
    "Date": "11/10/2024",
    "Text": "A top Jordanian pediatric specialist, Dr. Ammar Al Hmood, is trapped alongside patients and colleagues in the besieged Kamal Adwan Hospital in north Gaza.\n\nHe said: “These are orphans who have nobody else. These people are stranded. The situation is very, very, very difficult\"",
    "Weight": 4,
    "Id": 167
},
{
    "URL": "https://x.com/ReutersPitchbot/status/1844831407132336139",
    "Date": "11/10/2024",
    "Text": "The Weather Channel apologizes for depicting Palestinian as human being",
    "Weight": 4,
    "Id": 168
},
{
    "URL": "https://x.com/AnasAlSharif0/status/1844834879181345250",
    "Date": "11/10/2024",
    "Text": "Without exaggeration, these are the most difficult days of the Israeli war on Gaza.",
    "Weight": 12,
    "Id": 169
},
{
    "URL": "https://x.com/NourNaim88/status/1844821213438460163",
    "Date": "11/10/2024",
    "Text": "My father, Dr. Fadel Naim \n@fnaim65\n , Director of Al-Ahli Baptist Hospital in Gaza, warns of an impending health disaster if the Israeli siege and military assault on northern #Gaza persist",
    "Weight": 16,
    "Id": 170
},
{
    "URL": "https://x.com/JehadAbusalim/status/1844831929885143135",
    "Date": "11/10/2024",
    "Text": "There are people who genuinely believe Palestinian lives are worthless, that Israel can kill as many Palestinians as they want for any reason and get away with it, and that it’s acceptable to steal land, seize property, and destroy our future. How is this acceptable?",
    "Weight": 16,
    "Id": 171
},
{
    "URL": "https://x.com/JehadAbusalim/status/1844830952637215007",
    "Date": "11/10/2024",
    "Text": "Israel just killed 22 people in Jabalia with a single airstrike, but apparently, that’s less outrageous than a Weather Channel ad featuring a woman in a keffiyeh.",
    "Weight": 4,
    "Id": 172
},
{
    "URL": "https://x.com/Dena/status/1844828067929477317",
    "Date": "11/10/2024",
    "Text": "Israel deliberately targets journalists",
    "Weight": 4,
    "Id": 173
},
{
    "URL": "https://x.com/YousefMunayyer/status/1844825018250956880",
    "Date": "11/10/2024",
    "Text": "To equate Palestinian symbols with antisemitism, as \n@weatherchannel\n does here, is to engage is blatant anti-Palestinian racism. This is a wholesale attempt to tar an entire people. It is trash.",
    "Weight": 11,
    "Id": 174
},
{
    "URL": "https://x.com/JehadAbusalim/status/1844826275069702235",
    "Date": "11/10/2024",
    "Text": "Everything is antisemitic.",
    "Weight": 3,
    "Id": 175
},
{
    "URL": "https://x.com/fadiquran/status/1844739725958987890",
    "Date": "11/10/2024",
    "Text": "Israel is literally attacking the United Nations - not just shutting down its institutions but shooting at its peacekeepers. \n\nYet we only hear condemnations and reprimands - the same ones we’ve heard about killing children. The same words that in 368 days haven’t saved one life.",
    "Weight": 4,
    "Id": 176
},
{
    "URL": "https://x.com/JehadAbusalim/status/1844719873102082329",
    "Date": "11/10/2024",
    "Text": "An Israeli soldier wrote on an artillery shell: ‘סליחה אם פגעתי כיפור 2024’ (‘Sorry if I hurt you. Yom Kippur 2024’).",
    "Weight": 8,
    "Id": 177
},
{
    "URL": "https://x.com/AnasAlSharif0/status/1844686227229851970",
    "Date": "11/10/2024",
    "Text": "Warning: Horrific Scenes\nThe Israeli occupation is committing massacres against civilians in northern Gaza. Ambulance and civil defense teams are continuing to recover bodies from besieged homes in Jabalia camp, despite being repeatedly targeted.",
    "Weight": 17,
    "Id": 178
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1844523180679188724",
    "Date": "10/10/2024",
    "Text": "Israeli air strikes are getting closer and closer to Beirut's airport. Its history of attacking Beirut's airport is longer than the history of Hezbollah, and it is part of a wider strategy for regional domination. A thread:",
    "Weight": 11,
    "Id": 179
},
{
    "URL": "https://x.com/LailaAlarian/status/1844492896558514676",
    "Date": "10/10/2024",
    "Text": "For \n@nytimes\n Israelis are “displaced” and Lebanese “flee their homes”",
    "Weight": 11,
    "Id": 180
},
{
    "URL": "https://x.com/JehadAbusalim/status/1844484193373520148",
    "Date": "10/10/2024",
    "Text": " Israel is deliberately targeting shelter centers across various areas of the Gaza Strip.\n Hospitals in the area lack the necessary resources to accommodate the large number of injured.\n Israel is using high-explosive missiles to target the shelters.",
    "Weight": 12,
    "Id": 181
},
{
    "URL": "https://x.com/galpalpheebs/status/1844475635084951763",
    "Date": "10/10/2024",
    "Text": "Israel killed Fatima and her whole family today in Beirut",
    "Weight": 4,
    "Id": 182
},
{
    "URL": "https://x.com/The_NewArab/status/1844027603838968247",
    "Date": "09/10/2024",
    "Text": "A 10-month investigation by \n@charlie__lawrie\n, \n@Juniperbevensee\n and Jennefer Harper into the international non-profits that are arming settler militias in the West Bank, with the goal of ethnically cleansing Palestine:",
    "Weight": 4,
    "Id": 183
},
{
    "URL": "https://x.com/MahaGaza/status/1844461020192047598",
    "Date": "10/10/2024",
    "Text": "At least 63 Palestinians have been killed by Israeli occupation forces in Gaza since the early morning.",
    "Weight": 25,
    "Id": 184
},
{
    "URL": "https://x.com/JehadAbusalim/status/1844367808819527824",
    "Date": "10/10/2024",
    "Text": "Israel has killed 54 people in Gaza since this morning, with the majority of the casualties resulting from an airstrike on a school sheltering displaced individuals in Deir el-Balah.",
    "Weight": 8,
    "Id": 185
},
{
    "URL": "https://x.com/JehadAbusalim/status/1844358535632900443",
    "Date": "10/10/2024",
    "Text": "Another horrific massacre took place in my hometown, Deir el-Balah, today. Israel bombed Rufaida Al-Aslamia School in Deir el-Balah, where hundreds of displaced people had taken shelter, killing and injuring 80 people. So far, the death toll has reached 28.",
    "Weight": 4,
    "Id": 186
},
{
    "URL": "https://x.com/liamcunningham1/status/1844349015829381578",
    "Date": "10/10/2024",
    "Text": "Israel has just attacked the United Nations in Lebanon. There are injuries. Still silent?",
    "Weight": 4,
    "Id": 187
},
{
    "URL": "https://x.com/itranslate123/status/1731508627465191680",
    "Date": "04/12/2023",
    "Text": "We could die this dawn. \n\nI wish I were a freedom fighter so I die fighting back those invading Israeli genocidal maniacs invading my neighborhood and city.",
    "Weight": 8,
    "Id": 188
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1844008661628391640",
    "Date": "09/10/2024",
    "Text": "The forced evacuation of NICU babies from a hospital in northern Gaza. \n\nIsrael is besieging hospitals in northern Gaza, ordering evacuation and then immediately trapping patients and staff inside, committing massacres throughout the north.",
    "Weight": 12,
    "Id": 189
},
{
    "URL": "https://x.com/JehadAbusalim/status/1844089386293669973",
    "Date": "09/10/2024",
    "Text": "This Israeli channel posted “The White House: We will not be prepared to see Lebanon become Gaza”\n\nIsraelis in the replies:",
    "Weight": 23,
    "Id": 190
},
{
    "URL": "https://x.com/Mondoweiss/status/1844082332279636223",
    "Date": "09/10/2024",
    "Text": "1 year of Gaza’s Genocide: \n@JehadAbusalim\n reflects—‘Gaza remains the compass in the fight for collective dignity across the region.’ \n\nhttps://mondoweiss.net/2024/10/gaza-remains-our-compass/… https://x.com/Mondoweiss/status/1843713858013438265/photo/1https://x.com/Mondoweiss/status/1843713858013438265/photo/1…",
    "Weight": 17,
    "Id": 191
},
{
    "URL": "https://x.com/JehadAbusalim/status/1844041956059676711",
    "Date": "09/10/2024",
    "Text": "We hear about the millions displaced in Gaza, but we rarely grasp the depth of their suffering and what survival demands. Families endure darkness, hunger, and the constant hum of warplanes. This powerful piece by \n@aburtema\n sheds light on their plight.",
    "Weight": 4,
    "Id": 192
},
{
    "URL": "https://x.com/AnasAlSharif0/status/1844002706312384946",
    "Date": "09/10/2024",
    "Text": "A horrific massacre as a result of Israeli airstrikes targeting displaced people’s tents in the yard of Al-Yemen Al-Saeed Hospital in the heart of Jabalia refugee camp, northern Gaza.",
    "Weight": 12,
    "Id": 193
},
{
    "URL": "https://x.com/JehadAbusalim/status/1843995996948484155",
    "Date": "09/10/2024",
    "Text": "Israel killed 50 Palestinians in Gaza this morning. In the past five days, 120 people have been killed in northern Gaza alone.",
    "Weight": 20,
    "Id": 194
},
{
    "URL": "https://x.com/JehadAbusalim/status/1843823527197323499",
    "Date": "09/10/2024",
    "Text": "Netanyahu thinks that after committing countless crimes against Palestinians and Lebanese, Israel will still be accepted and welcomed in the region. Delusional.",
    "Weight": 14,
    "Id": 195
},
{
    "URL": "https://x.com/gazamom/status/1843794912267149445",
    "Date": "08/10/2024",
    "Text": "Israel has just destroyed the last functioning bakery in the already starved north of Gaza.",
    "Weight": 8,
    "Id": 196
},
{
    "URL": "https://x.com/PalStudies/status/1843799985936351453",
    "Date": "08/10/2024",
    "Text": ".\n@flstniya\n follows up on one of the many horror stories that emerged during the genocide: Dubbed Israel’s Guantanamo, Sde Teiman is a torture camp for Palestinian prisoners abducted from Gaza. ",
    "Weight": 17,
    "Id": 197
},
{
    "URL": "https://x.com/Raja48/status/1843798103201329361",
    "Date": "08/10/2024",
    "Text": "Can someone tell Mohammed Hijab to have some shame and stop using the genocide of Palestinians for likes? Really despicable how the suffering of our people are being exploited for liberal debates and alpha male culture.",
    "Weight": 13,
    "Id": 198
},
{
    "URL": "https://x.com/abedtakriti/status/1843784541984657732",
    "Date": "08/10/2024",
    "Text": "As part of their policy of eradication through starvation, Israeli colonial forces have burnt the only bakery in northern Gaza and destroyed the largest flour storage facility there. #GazaGenocide‌",
    "Weight": 21,
    "Id": 199
},
{
    "URL": "https://x.com/GazasOwn/status/1843776199358898432",
    "Date": "08/10/2024",
    "Text": "Israel is erasing northern Gaza. It's literally smashing it. I can't wait for the day when Israel is erased and Palestine is free from these maniac zionists!",
    "Weight": 26,
    "Id": 200
},
{
    "URL": "https://x.com/LailaAlarian/status/1843639444907405616",
    "Date": "08/10/2024",
    "Text": "I don’t know how we continue to exist in a world in which we see piles of children Israel killed every day",
    "Weight": 4,
    "Id": 201
},
{
    "URL": "https://x.com/JehadAbusalim/status/1843774975821619583",
    "Date": "08/10/2024",
    "Text": "\"Help your brother, whether he is an oppressor or he is oppressed\". When asked how to help an oppressor, he replied, \"By preventing him from oppressing others.”",
    "Weight": 15,
    "Id": 202
},
{
    "URL": "https://x.com/NIACouncil/status/1843759846836908198",
    "Date": "08/10/2024",
    "Text": ".\n@NBCNews\n claims US officials have discussed joining Israel in offensive strikes against Iran, and passing them off as “defensive\" after the fact.\n\nThis should raise alarm bells - Congress has not declared war on Iran, which would be disastrous for the U.S. and the region.",
    "Weight": 8,
    "Id": 203
},
{
    "URL": "https://x.com/thaqafatalhind/status/1726946498985005290",
    "Date": "21/11/2023",
    "Text": "On April 5, 1956, the Israelis bombed Al-Shifa Hospital, precipitating a major, days-long campaign by commandos from the Gaza Strip. The bombing and its aftermath is recounted in a book by the Palestinian militant and historian, Subhi Yasin. I've translated an excerpt.",
    "Weight": 19,
    "Id": 204
},
{
    "URL": "https://x.com/JehadAbusalim/status/1843608645751149054",
    "Date": "08/10/2024",
    "Text": "Israel’s targets:",
    "Weight": 4,
    "Id": 205
},
{
    "URL": "https://x.com/JehadAbusalim/status/1843602200469315803",
    "Date": "08/10/2024",
    "Text": "Unbelievable.\n\nBabak Eshaghi, the “Iran International correspondent in Israel,” scrawled “women, life, freedom” on a shattered wall amid the ruins of destroyed Palestinian homes in Gaza.",
    "Weight": 14,
    "Id": 206
},
{
    "URL": "https://x.com/SMArikat/status/1843373158780612960",
    "Date": "07/10/2024",
    "Text": "US Intelligence Dilemma Over Gaza Continues One Year After October 7 Attack\nhttps://alquds.com/ar/posts/137753",
    "Weight": 4,
    "Id": 207
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1842985884058374519",
    "Date": "06/10/2024",
    "Text": "Hassan Hamad. Twenty years old. Threatened, targeted, and now among the 170+ journalists assassinated by Israel.\n\nThe Committee to Protect Journalists (CPJ) can only confirm that 5 of those cases were intentional murders. Don't worry, they're investigating 10 other cases.",
    "Weight": 4,
    "Id": 208
},
{
    "URL": "https://x.com/AAbumezied/status/1843357776707498360",
    "Date": "07/10/2024",
    "Text": "How can our bodies sense grief before the loss occurs???\nToday I lost my uncle, whose heart couldn’t handle all the nonstop bombardment in the Middle Area, so it just stopped. Leaving us all behind suffocating with grief and loss. \n\nIsrael killed him.",
    "Weight": 4,
    "Id": 209
},
{
    "URL": "https://x.com/TarekHamoud/status/1843354586234663095",
    "Date": "07/10/2024",
    "Text": "Over the past 365 days, Israel has killed an average of 115 individuals daily within a geographic area of approximately 360 square kilometers and a population of no more than 2.15 million. This tragic situation remains ongoing.\n#October7",
    "Weight": 4,
    "Id": 210
},
{
    "URL": "https://x.com/PalStudies/status/1843344251712839833",
    "Date": "07/10/2024",
    "Text": ".\n@flstniya\n documented the genocide in newsbriefs for our blog in the past year.\n\n“The easiest thing to do is to report the truth. To use a platform to justify Israel's crimes, just as legacy media outlets have been doing, is immoral & undignified.”",
    "Weight": 11,
    "Id": 211
},
{
    "URL": "https://x.com/ArabCenterWDC/status/1843334695867822490",
    "Date": "07/10/2024",
    "Text": "Read \n@YousefMunayyer\n's op-ed on the first anniversary of the war on #Gaza",
    "Weight": 4,
    "Id": 212
},
{
    "URL": "https://x.com/LailaAlarian/status/1843315120187097423",
    "Date": "07/10/2024",
    "Text": "This year has been the deadliest year for the Palestinian people since the Nakba in 1948.",
    "Weight": 4,
    "Id": 213
},
{
    "URL": "https://x.com/palstudies_ar/status/1843305281373245447",
    "Date": "07/10/2024",
    "Text": "ملخص أحداث اليوم الاثنين 7 تشرين الأول/ أكتوبر 2024\nيقدم موجزاً يومياً للأحداث بالاستناد إلى الصحافة الفلسطينية والعربية، ويوفر روابط لنصوص الوثائق المشار إليها في الحدث المعني، مع تغطية خاصة لحرب الإبادة في غزة.\nللاطلاع على كامل الأخبار:\nhttps://digitalprojects.palestine-studies.org/ar/daily/chronology/2024-10-07…",
    "Weight": 4,
    "Id": 214
},
{
    "URL": "https://x.com/JehadAbusalim/status/1843260666926514270",
    "Date": "07/10/2024",
    "Text": "A trap has been set for Israel, and Netanyahu, being Netanyahu, walked straight into it without a second thought.",
    "Weight": 4,
    "Id": 215
},
{
    "URL": "https://x.com/JehadAbusalim/status/1843095275176657144",
    "Date": "07/10/2024",
    "Text": "Israel bombed Al-Aqsa Martyrs Hospital in Deir el-Balah multiple times tonight, the only remaining public hospital in central Gaza Strip, serving over a million people, most of whom are displaced from the north and south, and many sheltering in the hospital yard.",
    "Weight": 8,
    "Id": 216
},
{
    "URL": "https://x.com/MosabAbuToha/status/1843023357861855484",
    "Date": "06/10/2024",
    "Text": "Just as I wrote that I lost 31 members of my extended family and three first cousins with their husbands and children, in addition to more than 200 friends and neighbors and students, some people send me messages absolving Israel of any responsibility. What do you call this?",
    "Weight": 4,
    "Id": 217
},
{
    "URL": "https://x.com/thaqafatalhind/status/1843011083856121968",
    "Date": "06/10/2024",
    "Text": "Ahdaf Soueif has translated Muin Bseiso and Mahmoud Darwish's joint poem \"A Letter to an Israeli Soldier\" written during the Israeli siege of Beirut in 1982. I wrote a short introduction.",
    "Weight": 16,
    "Id": 218
},
{
    "URL": "https://x.com/JehadAbusalim/status/1843003123146903835",
    "Date": "06/10/2024",
    "Text": "On this day two years ago, I joined Professor Refaat Alareer (\n@itranslate123\n) and Gaza's brilliant poet \n@MosabAbuToha\n for the launch of the anthology Light in Gaza, published by \n@Haymarket\n. We imagined Gaza's future beyond the cruelties of occupation.",
    "Weight": 17,
    "Id": 219
},
{
    "URL": "https://x.com/JehadAbusalim/status/1843004008014983633",
    "Date": "06/10/2024",
    "Text": "You can download Light in Gaza: Writings Born of Fire for free at the following link:",
    "Weight": 4,
    "Id": 220
},
{
    "URL": "https://x.com/roqchams/status/1842970252025659662",
    "Date": "06/10/2024",
    "Text": "A Southern Lebanese woman explains that while it is true they are displaced, they did not leave their villages out of fear, but for the sake of their children, because Israel shows no mercy to children.",
    "Weight": 4,
    "Id": 221
},
{
    "URL": "https://x.com/MosabAbuToha/status/1842874712310817038",
    "Date": "06/10/2024",
    "Text": "Israel assassinates UNRWA’s Jabalia operations manager.",
    "Weight": 4,
    "Id": 222
},
{
    "URL": "https://x.com/AssalRad/status/1842782270236815376",
    "Date": "06/10/2024",
    "Text": "An Iranian retaliation that kills no Israelis gets wall-to-wall coverage in the media, but if you only follow US media you would have little clue that Israel carried out another massacre in Gaza today and massive bombings in Lebanon.",
    "Weight": 23,
    "Id": 223
},
{
    "URL": "https://x.com/alihashem_tv/status/1842821054625960114",
    "Date": "06/10/2024",
    "Text": "A huge explosion amid an Israeli airstrike near the airport",
    "Weight": 8,
    "Id": 224
},
{
    "URL": "https://x.com/JehadAbusalim/status/1842821613005275158",
    "Date": "06/10/2024",
    "Text": "Israel is about to commit horrific massacres in Jabalia. My heart breaks for those who remain there, and for everyone in northern Gaza.",
    "Weight": 8,
    "Id": 225
},
{
    "URL": "https://x.com/RamAbdu/status/1842814418259747044",
    "Date": "06/10/2024",
    "Text": "This is what remains of the body of journalist Hassan Hamad after he was killed by Israel tonight. #GazaGenocide",
    "Weight": 13,
    "Id": 226
},
{
    "URL": "https://x.com/TheOnlySheikha/status/1842732117941162102",
    "Date": "06/10/2024",
    "Text": " UPDATE | Gaza\n\nIn one hours, US-lsraeli violent thugs bombed:\n\n-  Civilians in a school Gaza City\n\n- Civilians in a school in central Gaza\n\n- Civilians in a Masjid in Central Gaza\n\n- Sheltering center housing thousands civilians in North Gaza\n\nAnd civilian homes too!!",
    "Weight": 20,
    "Id": 227
},
{
    "URL": "https://x.com/JehadAbusalim/status/1842727460678365300",
    "Date": "06/10/2024",
    "Text": "Massacre in Deir el-Balah: An Israeli airstrike hit a mosque housing displaced people near Al-Aqsa Martyrs Hospital, resulting in the deaths of at least 15 people and leaving dozens wounded.",
    "Weight": 8,
    "Id": 228
},
{
    "URL": "https://x.com/JehadAbusalim/status/1842726168673263795",
    "Date": "06/10/2024",
    "Text": "Israel bombed a mosque sheltering displaced people near Al-Aqsa Martyrs Hospital in Deir el-Balah, resulting in the deaths of at least 15 people and leaving dozens injured.",
    "Weight": 4,
    "Id": 229
},
{
    "URL": "https://x.com/AnasAlSharif0/status/1842714402518392880",
    "Date": "05/10/2024",
    "Text": "A heartbreaking image:\nThis is the reality of the Israeli target list.\nA child’s head was shattered, and his intestines were exposed due to Israeli airstrikes targeting civilian homes in northern Gaza.",
    "Weight": 20,
    "Id": 230
},
{
    "URL": "https://x.com/JehadAbusalim/status/1842713314901524873",
    "Date": "05/10/2024",
    "Text": "Israel’s targets:",
    "Weight": 4,
    "Id": 231
},
{
    "URL": "https://x.com/JehadAbusalim/status/1842711366467019087",
    "Date": "05/10/2024",
    "Text": "Israel just bombed the entrance of Al-Aqsa Martyrs Hospital in Deir el-Balah. Reports of many deaths and injuries.",
    "Weight": 4,
    "Id": 232
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1842699441016565959",
    "Date": "05/10/2024",
    "Text": "What are Israel's calculations in Gaza and Lebanon? A thread:",
    "Weight": 8,
    "Id": 233
},
{
    "URL": "https://x.com/byPlestia/status/1842692316319953050",
    "Date": "05/10/2024",
    "Text": "Both Beirut and Northern Gaza are getting bombed  by the IOF in an insane way tonight!!!",
    "Weight": 4,
    "Id": 234
},
{
    "URL": "https://x.com/JehadAbusalim/status/1842680385169474022",
    "Date": "05/10/2024",
    "Text": "Israel’s targets:",
    "Weight": 4,
    "Id": 235
},
{
    "URL": "https://x.com/JehadAbusalim/status/1842672605469512089",
    "Date": "05/10/2024",
    "Text": "Beirut and Gaza are being bombed simultaneously.",
    "Weight": 4,
    "Id": 236
},
{
    "URL": "https://x.com/JehadAbusalim/status/1842658358597472484",
    "Date": "05/10/2024",
    "Text": "Israel is a \"state\" founded on massacres, sustained by committing massacres, and views its future and the well-being of its citizens as dependent on its capacity to continue committing massacres.",
    "Weight": 4,
    "Id": 237
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1842580468132348385",
    "Date": "05/10/2024",
    "Text": "Four Lebanese hospitals are out of service and two hospitals are operating at reduced capacity due to Israeli air strikes, intimidation and direct threats to hospital administration, shelling, and cutting off supply lines",
    "Weight": 8,
    "Id": 238
},
{
    "URL": "https://x.com/USCPR_/status/1842564692344287627",
    "Date": "05/10/2024",
    "Text": " ALL OUT FOR PALESTINE & LEBANON TODAY \n\nAs we cross one year of ongoing genocide, rise up in the streets to resist this U.S.-funded genocide and Israel's expanding colonial violence.\n\nJoin one of over 70 actions this weekend.\n\nFind a protest near you: http://uscpr.org/protest",
    "Weight": 18,
    "Id": 239
},
{
    "URL": "https://x.com/JehadAbusalim/status/1842457958002622956",
    "Date": "05/10/2024",
    "Text": "Israel seems to have plenty of ammo to bomb several Arab countries at once and even threaten Iran, potentially sparking a world war. But it’s still never enough, and they always want MORE.",
    "Weight": 6,
    "Id": 240
},
{
    "URL": "https://x.com/GhassanAbuSitt1/status/1842278477497581682",
    "Date": "04/10/2024",
    "Text": "Israel has shelled 2 hospitals in South Lebanon today. Earlie Marjouin Hospital and now Salah Ghandour hospital.",
    "Weight": 4,
    "Id": 241
},
{
    "URL": "https://x.com/USCPR_/status/1842274903879192861",
    "Date": "04/10/2024",
    "Text": "HANDS OFF PALESTINE AND LEBANON⁠\n⁠\nIsrael is trying to launch a regional war, massacring over 200,000 Palestinians and 2,000 Lebanese over the past year\n⁠\nFlood the streets and join an action in your city!⁠\n⁠\nJOIN A PROTEST NEAR YOU: https://l8r.it/2Qqi",
    "Weight": 16,
    "Id": 242
},
{
    "URL": "https://x.com/PalestineCenter/status/1842214826694545702",
    "Date": "04/10/2024",
    "Text": "This week we had a discussion with \n@AJFaultLines\n correspondent \n@joshrushing\n & producer \n@atwaheed\n on The Palestine Exception, a documentary investigating the suppression of Palestine advocacy on U.S. campuses and its impact on academic freedom.",
    "Weight": 8,
    "Id": 243
},
{
    "URL": "https://x.com/Mondoweiss/status/1842196945336439104",
    "Date": "04/10/2024",
    "Text": "Israel's colonization of Palestine was also a \"limited operation.\"",
    "Weight": 13,
    "Id": 244
},
{
    "URL": "https://x.com/AJIunit/status/1841885939791999043",
    "Date": "03/10/2024",
    "Text": "Our \n@AJIunit\n investigation exposes war crimes in Gaza through the medium of photos and videos posted online by Israeli soldiers themselves during the year-long conflict.\n\nWatch the full film here. #GazaCrimes",
    "Weight": 30,
    "Id": 245
},
{
    "URL": "https://x.com/dandoon_danya/status/1841926638592000360",
    "Date": "03/10/2024",
    "Text": "You all do not understand how enraging this is. We cannot even go to our homeland and they are renting out stolen Palestinian homes on \n@Airbnb\n.",
    "Weight": 4,
    "Id": 246
},
{
    "URL": "https://x.com/GhassanAbuSitt1/status/1842133904007827913",
    "Date": "04/10/2024",
    "Text": "In Lebanon Israel has so far killed 104 health wotkers (drs, nurses & paramedics), wounded a further 188, damaged or destroyed 45 health facilities and 128 ambulances.",
    "Weight": 4,
    "Id": 247
},
{
    "URL": "https://x.com/JehadAbusalim/status/1842016547864195505",
    "Date": "04/10/2024",
    "Text": "Israel just bombed a house in my hometown and killed three people. This is genocide from the sky, from Deir el-Balah, to Nuseirat, to Beirut, to Toulkarem.",
    "Weight": 9,
    "Id": 248
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1841996522113687882",
    "Date": "04/10/2024",
    "Text": "Al Jazeera reporters in southern Lebanon and the Dahiyeh have their blood types sewn on to the front of their press jackets. \n\nCowards in western newsrooms didn’t do their jobs. They didn’t challenge Israel’s propaganda and failed their colleagues. This isn’t normal",
    "Weight": 4,
    "Id": 249
},
{
    "URL": "https://x.com/samhaselby/status/1841806312134344794",
    "Date": "03/10/2024",
    "Text": "Make no mistake, if Ta-Nehisi Coates lived in the West Bank or Gaza, Israel would just kill him like they did Refat Alareer.",
    "Weight": 8,
    "Id": 250
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841930741984231690",
    "Date": "03/10/2024",
    "Text": "Massacre in Toulkarem. Israel bombed a coffee shop and killed at least 14 people.",
    "Weight": 4,
    "Id": 251
},
{
    "URL": "https://x.com/MahaGaza/status/1841926225700278688",
    "Date": "03/10/2024",
    "Text": "Israeli airstrikes now on Nuseirat heard in Deir al-Balah central Gaza Strip",
    "Weight": 12,
    "Id": 252
},
{
    "URL": "https://x.com/LailaAlarian/status/1841865754779451706",
    "Date": "03/10/2024",
    "Text": "Thank you \n@democracynow\n for having \n@HindHassanNews\n on to talk about our new \n@AJFaultLines\n film “Starving Gaza”",
    "Weight": 4,
    "Id": 253
},
{
    "URL": "https://x.com/YousefMunayyer/status/1841845035421069700",
    "Date": "03/10/2024",
    "Text": "He also infamously proclaimed in this hearing that it was not necessary to attack Iran to bring down the regime, all you had to do was beam Beverly Hills 90210 into TVs there. Seriously. This guy has always been  a snake oil salesman. A cowardly, murderous, conman.",
    "Weight": 2,
    "Id": 254
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1841848787083337742",
    "Date": "03/10/2024",
    "Text": "It’s unfathomable that this quiet city called Deir al-Balah—once home to 80,000—now hosts 1 million displaced Palestinians and that just one man buried 25,000 people there. \n\nThat equals 31% of the city’s original population.",
    "Weight": 8,
    "Id": 255
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1841833122205216793",
    "Date": "03/10/2024",
    "Text": "Yesterday, Israel killed 100 Palestinians in Gaza in less than 24 hours. As of this morning, Israel has killed 17 more Palestinians in Gaza, and the day isn’t over yet",
    "Weight": 32,
    "Id": 256
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841833015363715138",
    "Date": "03/10/2024",
    "Text": "Israel has killed 127 children and 97 medics in Lebanon since October 8th, according to the Lebanese Ministry of Health.",
    "Weight": 4,
    "Id": 257
},
{
    "URL": "https://x.com/palstudies_ar/status/1841825533904171225",
    "Date": "03/10/2024",
    "Text": "اقرأ في عدد الخميس، 3/10/2024 من \"مختارات من الصحف العبرية\":\n\n- دفنا ليئيل: صحيح أن نصر الله قد اغتيل، لكن تحدي نتنياهو الكبير يبدأ الآن\n\n- جيكي حوجي: إيران وصلت إلى اللحظة التي تتهرب منها منذ سنوات: المواجهة المباشرة مع إسرائيل\n\nلقراءة العدد كاملاً\nhttps://mukhtaraat.palestine-studies.org/ar/node/35366",
    "Weight": 4,
    "Id": 258
},
{
    "URL": "https://x.com/mattduss/status/1841822923222315298",
    "Date": "03/10/2024",
    "Text": "Can't remember anyone getting more liberals to out themselves as bigots more quickly and effectively than Ta-Nehisi has done simply by applying the same principles to Israel-Palestine that he does to America.",
    "Weight": 8,
    "Id": 259
},
{
    "URL": "https://x.com/mattlieb/status/1841586512384950391",
    "Date": "02/10/2024",
    "Text": "Bari Weiss literally began her career  trying to get Arab profs at her college fired for being critical of Israel, & making an Israel lobby-funded documentary about it. She spent the rest of her career doing the same thing on a national scale. So ya know, every accusation etc",
    "Weight": 8,
    "Id": 260
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1841634940330422273",
    "Date": "03/10/2024",
    "Text": "Israel killed more Lebanese in the last 2 weeks than they did in its 34-day war on Lebanon in 2006. It sparked outrage then, but nothing for the 1000+ killed now. \n\nWe warned that enabling Israel in Gaza has universal consequences. Israel knows it and won’t stop with Lebanon.",
    "Weight": 16,
    "Id": 261
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1841506165299040447",
    "Date": "02/10/2024",
    "Text": "Iran's April retaliatory strike tested capabilities. Iran's retaliatory strike yesterday demonstrated capabilities. \n\nIsrael has engineered a scenario in which the limits of restraint are being pushed on multiple fronts, and it only gets deadlier from here. Enough is enough.",
    "Weight": 8,
    "Id": 262
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1841535112078307696",
    "Date": "02/10/2024",
    "Text": "ISRAEL ERASED 902 PALESTINIAN FAMILIES FROM THE CIVIL REGISTRY IN GAZA\n\nISRAEL ERASED 902 PALESTINIAN FAMILIES FROM THE CIVIL REGISTRY IN GAZA\n\nISRAEL ERASED 902 PALESTINIAN FAMILIES FROM THE CIVIL REGISTRY IN GAZA",
    "Weight": 36,
    "Id": 263
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841503305232519400",
    "Date": "02/10/2024",
    "Text": "ISRAEL MURDERED 89 PALESTINIANS IN LESS THAN A DAY IN GAZA.",
    "Weight": 16,
    "Id": 264
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841490064024486097",
    "Date": "02/10/2024",
    "Text": "Final call for a ceasefire in Gaza.",
    "Weight": 4,
    "Id": 265
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841489079910723813",
    "Date": "02/10/2024",
    "Text": "The post I quote-tweeted, which has since been censored and removed by X, contained footage posted by Dr. \n@fnaim65\n showing innocent children who were murdered and incinerated by Israeli bombs yesterday at a shelter in Gaza. So much for free speech on this platform!",
    "Weight": 12,
    "Id": 266
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841477588260118891",
    "Date": "02/10/2024",
    "Text": "Israel’s targets in Gaza.",
    "Weight": 8,
    "Id": 267
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841444673312772373",
    "Date": "02/10/2024",
    "Text": "The world is conditioned to see the deaths of 80 Palestinians and dozens of Lebanese in a single day from Israeli aggression as a non-event, as if their lives are worth less than Westerners or Israelis. If this isn’t blatant racism and dehumanization, then what is?",
    "Weight": 27,
    "Id": 268
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841421582364717221",
    "Date": "02/10/2024",
    "Text": "The death toll from Israel's bombardment of the Gaza Strip has reached 80. Israel cold-bloodedly killed 80 Palestinians in Gaza in less than 24 hours.",
    "Weight": 24,
    "Id": 269
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841334240069157128",
    "Date": "02/10/2024",
    "Text": "Israel MURDERED 30 Palestinians in Khan Younis last night.",
    "Weight": 12,
    "Id": 270
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841326897524847006",
    "Date": "02/10/2024",
    "Text": "Here’s your daily reminder of why this regime must be dismantled, its leaders and generals brought before a tribunal, and why Palestinians urgently need protection from this monstrous government and its murderous, criminal military. https://x.com/fnaim65/status/fnaim65/status/1841309761272172587…",
    "Weight": 8,
    "Id": 271
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841244060134056355",
    "Date": "01/10/2024",
    "Text": "Tonight presents a great opportunity to reach a ceasefire and prisoner exchange agreement in Gaza, which could then lead to a ceasefire in the north and the Red Sea, and the prevention of a slide toward a devastating regional war. This is truly a historic opportunity.",
    "Weight": 4,
    "Id": 272
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841227923405074812",
    "Date": "01/10/2024",
    "Text": "Time and history will be the ultimate judges, but I can say with certainty that one of Israel’s most significant and foolish mistakes since its establishment was the assassination of Hassan Nasrallah.",
    "Weight": 4,
    "Id": 273
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841160036510306500",
    "Date": "01/10/2024",
    "Text": "What was wrong with a ceasefire in Gaza again?",
    "Weight": 4,
    "Id": 274
},
{
    "URL": "https://x.com/JehadAbusalim/status/1841059037745455173",
    "Date": "01/10/2024",
    "Text": "You may think you're in a democracy, but the moment you voice support for Palestinians rights, get ready for a censorship regime straight out of the inquisitions.",
    "Weight": 8,
    "Id": 275
},
{
    "URL": "https://x.com/warghetti/status/1840863795620585716",
    "Date": "30/09/2024",
    "Text": "It’s midnight in Beirut. The Israelis are pounding Dahyeh so hard the whole capital can hear the airstrikes. It’s like being in a prison and you can hear the screams of other prisoners being tortured down the hall and there’s nothing you can do about it",
    "Weight": 11,
    "Id": 276
},
{
    "URL": "https://x.com/JehadAbusalim/status/1840864243727679653",
    "Date": "30/09/2024",
    "Text": "Somehow Israel never runs out of bombs to kill Palestinian and Lebanese civilians. An endless supply of death and destruction.",
    "Weight": 8,
    "Id": 277
},
{
    "URL": "https://x.com/_Amarmustafa/status/1840587506913345547",
    "Date": "30/09/2024",
    "Text": "As my country is being carpet bombed and massacred the delulus that are the movement for settlement of south lebanon are advertising real estate sales for colonisers in southern Lebanon",
    "Weight": 5,
    "Id": 278
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1840815797737865218",
    "Date": "30/09/2024",
    "Text": "If it was really about hostages, there would be a Gaza ceasefire. If it was really about northern Israel’s security, there would be a Gaza ceasefire, not a Lebanon invasion and air strikes. \n\nA Gaza ceasefire was the only way to de-escalate.\n\nIsrael’s objective is endless war.",
    "Weight": 20,
    "Id": 279
},
{
    "URL": "https://x.com/hanna_alshaikh/status/1840773563634049453",
    "Date": "30/09/2024",
    "Text": "Netanyahu claims he's bombing Lebanon and launching a ground invasion so Israelis can return to the north. This could've been achieved through a Gaza ceasefire on Oct 8. Nasrallah repeated this point in every speech for a year.\n\nIt was ignored to enable Israel's endless war.",
    "Weight": 19,
    "Id": 280
},
{
    "URL": "https://x.com/GhassanAbuSitt1/status/1840453108347904135",
    "Date": "29/09/2024",
    "Text": "As it has been doing in Gaza, Israel bombed a building filled with displaced families from South Lebanon  east of Saida, in South Lebanon. The initial toll is 24 Martyrs & 29 injured (around 6 PM).",
    "Weight": 8,
    "Id": 281
},
{
    "URL": "https://x.com/LailaAlarian/status/1840399868843454532",
    "Date": "29/09/2024",
    "Text": "NEW: Israel and the US deny aid to Gaza is being blocked. But in \n@AJFaultLines\n “Starving Gaza,” we worked with Palestinian reporters and used open-source data to investigate how Israel has killed civilians seeking aid and attacked humanitarian networks.",
    "Weight": 20,
    "Id": 282
},
{
    "URL": "https://x.com/PalStudies/status/1840136848858820775",
    "Date": "28/09/2024",
    "Text": ".\n@marylinchahine\n covers the international response to Israel's attacks in Lebanon that have killed 700+ people & displaced thousands. Its latest carpet-bombing campaign targetted Beirut's suburb, Dahiya, assassinating Hezbollah's Hassan Nasrallah. ",
    "Weight": 7,
    "Id": 283
},
{
    "URL": "https://x.com/JehadAbusalim/status/1840317618533642599",
    "Date": "29/09/2024",
    "Text": "I don’t understand why people are so bothered by what Brianna Wu writes about Palestinians. We need to think on a grander scale—after all, we're at a point where people like her are becoming the voice of Israel. And honestly, that in itself is a victory for Palestinians.",
    "Weight": 20,
    "Id": 284
},
{
    "URL": "https://x.com/nsdoud/status/1840280905409069451",
    "Date": "29/09/2024",
    "Text": "When I say things like, what’s to come is the creation of dozens of Gazas…encircled, besieged, prepped for genocide….we are not exaggerating.",
    "Weight": 9,
    "Id": 285
},
{
    "URL": "https://x.com/JehadAbusalim/status/1840123637883412745",
    "Date": "28/09/2024",
    "Text": "Here’s the territory the World Zionist Organization initially claimed for the “Jewish state” they sought to establish in the Levant, which they submitted during the 1919 Paris Peace Conference. Their ambitions have always extended beyond what they have now.",
    "Weight": 9,
    "Id": 286
},
{
    "URL": "https://x.com/JehadAbusalim/status/1840126617504362918",
    "Date": "28/09/2024",
    "Text": "According to this map, God gave Zionists Sidon, Tyre, and Quneitra, but after Britain and France rejected the demands of the WZO, God changed his mind.",
    "Weight": 10,
    "Id": 287
},
{
    "URL": "https://x.com/GhassanAbuSitt1/status/1840033465288339597",
    "Date": "28/09/2024",
    "Text": "Israel has killed 41 health workers in Lebanon so far",
    "Weight": 4,
    "Id": 288
},
{
    "URL": "https://x.com/MahaGaza/status/1839912697703330252",
    "Date": "28/09/2024",
    "Text": "This isn't just about the 88 individuals buried without identification. There are around 10,000 missing Palestinians in Gaza now, and each of their families is now thinking, 'Our loved one could be in this container.' \n\nThey may never get an answer.",
    "Weight": 12,
    "Id": 289
},
{
    "URL": "https://x.com/roqchams/status/1838314769209610480",
    "Date": "23/09/2024",
    "Text": "Israel has killed almost 500 in one day across South Lebanon. Staggering barbarity.",
    "Weight": 4,
    "Id": 290
},
{
    "URL": "https://x.com/JehadAbusalim/status/1838314932506370191",
    "Date": "23/09/2024",
    "Text": "Israel murdered 492 people in Lebanon in less than 24 hours. 1645 were injured. \n\n492 people killed, in less than a day.",
    "Weight": 4,
    "Id": 291
},
{
    "URL": "https://x.com/JehadAbusalim/status/1838225239785849028",
    "Date": "23/09/2024",
    "Text": "Since this morning, Israel has killed 274 people in Lebanon, including 21 children.",
    "Weight": 4,
    "Id": 292
},
{
    "URL": "https://x.com/JehadAbusalim/status/1838199544493830643",
    "Date": "23/09/2024",
    "Text": "Israel killed 182 people in Lebanon in less than 24 hours.",
    "Weight": 4,
    "Id": 293
},
{
    "URL": "https://x.com/PalStudies/status/1836873451254206636",
    "Date": "19/09/2024",
    "Text": "This year marks 42 years since the Sabra and Shatila massacres that killed between 2,000 and 3,500 people. Immediately following the attacks in these Palestinian refugee camps, Leila Shahid recorded eyewitness testimonies from survivors (thread) ",
    "Weight": 4,
    "Id": 294
},
{
    "URL": "https://x.com/PalStudies/status/1837179405061251129",
    "Date": "20/09/2024",
    "Text": "Israel detonating explosives in devices isn’t entirely new. In 1996, Yahya Ayyash was killed in Gaza when a cell phone given to him by a Shin Bet informer exploded in his ear. Helga Tawil-Souri dissects Israel’s “digital enclosure” and tech warfare:",
    "Weight": 12,
    "Id": 295
},
{
    "URL": "https://x.com/PalStudies/status/1837233988756459945",
    "Date": "20/09/2024",
    "Text": "In 2006, Israel bombed the Dahiya neighborhood in Beirut. This strategy would later be publicly articulated as the Dahiya doctrine, a policy deliberately targeting civilians and civilian infrastructure to induce such suffering that it creates deterrence:",
    "Weight": 4,
    "Id": 296
},
{
    "URL": "https://x.com/PalStudies/status/1837493184160555082",
    "Date": "21/09/2024",
    "Text": "Join us on Thursday, Sept. 26 at 12pm ET/7pm Palestine with \n@FranceskAlbs\n, \n@luigidaniele10\n, & \n@PeruginiNic\n to discuss how Israel appropriates International Humanitarian Law to mask atrocities in Gaza. The event will be live-streamed. Register: https://palestine-studies.org/en/node/1656131",
    "Weight": 16,
    "Id": 297
},
{
    "URL": "https://x.com/JehadAbusalim/status/1837468757557408242",
    "Date": "21/09/2024",
    "Text": "Israel killed 119 Palestinians in Gaza in the past 72 hours.",
    "Weight": 16,
    "Id": 298
}]