[
    {
        "URL": "https://x.com/mohammed_hijab/status/1863526751889965442",
        "Date": "02/12/2024",
        "Text": "If, and it’s a significant \"if,\" HTS were to seize control of Syria, the prospect of a Syrian offensive against Israel would shift from a distant possibility to a probable reality.",
        "Weight": 4,
        "Id": 5
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1861200902931009891",
        "Date": "26/11/2024",
        "Text": "Being labelled anti-semitic by a Zionist is a badge of honour.",
        "Weight": 5,
        "Id": 14
    },
    {
        "URL": "https://x.com/richimedhurst/status/1860367006353989986",
        "Date": "23/11/2024",
        "Text": "This woman is a great example of how ignorant and racist many Germans and Europeans are on Palestine.",
        "Weight": 4,
        "Id": 15
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "19/11/2024",
        "Text": "Zeus is as fictitious as the State of Israel and your perceived semitic DNA.",
        "Weight": 4,
        "Id": 20
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "19/11/2024",
        "Text": "You shot yourself in the foot, this shows you how peaceful the Pro-Palestine protestors are.",
        "Weight": 9,
        "Id": 21
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1857127401706152417",
        "Date": "14/11/2024",
        "Text": "Challenge: Beyond historical origins and founding figures, identify five meaningful differences between Zionism and Nazism.",
        "Weight": 4,
        "Id": 23
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1857089236823863371",
        "Date": "14/11/2024",
        "Text": "Message to the Jewish community: Ignoring Palestine’s suffering while expecting sympathy for Hitler’s atrocities—compassion or narcissism?",
        "Weight": 9,
        "Id": 24
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1856731505730466156",
        "Date": "13/11/2024",
        "Text": "Message to Zionist Jews: If you don't want people to hate you, stop supporting a holocaust.",
        "Weight": 12,
        "Id": 25
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1856300326107611294",
        "Date": "12/11/2024",
        "Text": "I'm sorry to say, but I think more Jews need to condemn the genocide in Palestine. Too many Jews support it",
        "Weight": 17,
        "Id": 26
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "02/11/2024",
        "Text": "The cost of occupation is a life forever shadowed by the absence of safety",
        "Weight": 5,
        "Id": 34
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "28/10/2024",
        "Text": "1 \"Jewish\" baby versus tens of thousand of Arab ones who you have shredded. Please shut your mouth.",
        "Weight": 4,
        "Id": 40
    },
    {
        "URL": "https://x.com/InsiderWorld_1/status/1850288948607643708",
        "Date": "26/10/2024",
        "Text": "A Palestinian child trapped under the rubble awaits help.\n\nWhat a heartbreaking scene.",
        "Weight": 4,
        "Id": 51
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1848978957846073434",
        "Date": "23/10/2024",
        "Text": "Even if 6 million Arabs were burned by Zionists, it would still not be enough to satiate the insatiable hunger of the deranged egomaniacs",
        "Weight": 10,
        "Id": 64
    },
    {
        "URL": "https://x.com/Haqiqatjou/status/1848834182786494619",
        "Date": "22/10/2024",
        "Text": "Isn't it interesting how Rabbis who make genocidal statements like this are never ostracized or condemned by the wider Jewish community?",
        "Weight": 4,
        "Id": 65
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "19/10/2024",
        "Text": "You and I both know the Zionists are nothing without the Americans and Western Europeans",
        "Weight": 10,
        "Id": 71
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1847655474453266740",
        "Date": "19/10/2024",
        "Text": "To be honest, we Muslims need a dirty enemy like the Zionists so that we wake up from a 100 year sleep",
        "Weight": 10,
        "Id": 72
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1847186764353417717",
        "Date": "18/10/2024",
        "Text": "If the human shields theory was true, Yahya Sinwar would have surrounded himself with Israeli hostages as human shields.",
        "Weight": 8,
        "Id": 75
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1846943031317971062",
        "Date": "17/10/2024",
        "Text": "My hunch is killing Sinwar gives more legitimacy to HAMAS with the Palestinians. Moreover, when was the last time a Western leader either fought or was killed on the battlefield ?",
        "Weight": 12,
        "Id": 77
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1846476989189836839",
        "Date": "16/10/2024",
        "Text": "After hours of searching through rubble in Sheikh Radwan in Gaza, the body of a missing toddler is found: another poor soul killed by israelis",
        "Weight": 15,
        "Id": 80
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1845736188335759660",
        "Date": "14/10/2024",
        "Text": "The aftermath of the most inhuman monstrous act of terrorism committed by the israelis against Palestinians asleep in their tents in Al Aqsa Hospital",
        "Weight": 19,
        "Id": 81
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1846081306158854631",
        "Date": "15/10/2024",
        "Text": "Im sorry to say, but any Muslim scholar, influencer, or celebrity who has yet to speak out about the Palestinian Holocaust/genocide is, quite simply, finished. There are no more excuses left for their silence.",
        "Weight": 12,
        "Id": 85
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1846075797817229628",
        "Date": "15/10/2024",
        "Text": "Benjamin Netanyahu's Holocaust is occurring in the age of social media, unlike Hitler's Holocaust. There is no counterfactual assurance that Hitler would have done less in this era, or that Netanyahu would not have done more had he been in Hitler's time.",
        "Weight": 9,
        "Id": 86
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1845716134651187477",
        "Date": "14/10/2024",
        "Text": "The enemy should not that the 42 thousand martyrs in Gaza no longer feel pain, grief or sadness no matter how they were killed. You cannot defeat an enemy who is indifferent to your biggest consequences.",
        "Weight": 4,
        "Id": 93
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1844277201220632778",
        "Date": "10/10/2024",
        "Text": "In game theory the 'infinite player' has the initiative. On the battlefield, Hezbollah and HAMAS are the infinite player because they are 'defending'. Therefore, the longer this 'war' goes on the less chance 'Israel' has of winning anything.",
        "Weight": 11,
        "Id": 99
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1844276297201222022",
        "Date": "10/10/2024",
        "Text": "Many videos are coming out of Gaza with Hamas having successive victories over the IDF. Starting a ground war on two fronts and engaging in a war of attrition in a year long war has been a foolish strategic move with no benefit for the IDF.",
        "Weight": 8,
        "Id": 100
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1843671410109231410",
        "Date": "08/10/2024",
        "Text": "In 2002, the Arab Peace Initiative, all Arab nations and militant groups (including HAMAS) agreed to normalise relations with Israel in exchange for them leaving the occupied terroritories. This plan was rejected by Netanyahu in 2018",
        "Weight": 8,
        "Id": 108
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "08/10/2024",
        "Text": "You're saying I lost before the debate has been released and 156 desperados are blindly agreeing . This summarises the Zionist delusion.",
        "Weight": 5,
        "Id": 109
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "05/10/2024",
        "Text": "Definition of holocaust in Cambridge dictionary. It fits the situation in Gaza\n\na very large amount of destruction, especially by fire or heat, or the killing of very large numbers of people:\nThe 20th century was ripped apart by holocausts.",
        "Weight": 10,
        "Id": 114
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "05/10/2024",
        "Text": "Participation in a modern holocaust does not make you a brave soldier, it makes you a cowardly criminal.",
        "Weight": 3,
        "Id": 115
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "05/10/2024",
        "Text": "Hey coward. Do you still hold to what you said here. If so, considering the death toll in Lebanon is over 2,000, will you now officially give up on your \"human shields\" argument and acknowledge IDF crimes as you absolve Hezbollah from using civilians as human shields.",
        "Weight": 5,
        "Id": 116
    },
    {
        "URL": "https://x.com/Lowkey0nline/status/1842514602694762948",
        "Date": "05/10/2024",
        "Text": "Israel has destroyed 814 Mosques and 3 Churches in Gaza over the past year.",
        "Weight": 8,
        "Id": 120
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "04/10/2024",
        "Text": "Show us the bodies. The only bodies I've been seeing are the Israeli military ones which has people stomping on them",
        "Weight": 8,
        "Id": 121
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1842101411485495738",
        "Date": "04/10/2024",
        "Text": "According to William Martel, victory in war happens when a country fulfils its political and military goals. On this definition, Israel has no victory to claim in Gaza, Lebanon, with Hamas, Hezbollah, or Iran. They have lost life, trillions of dollars, and feel unsafe.",
        "Weight": 17,
        "Id": 123
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "02/10/2024",
        "Text": "I've done it before, but just for you : I hereby criticise all of them for their despicable stance on Palestine ",
        "Weight": 4,
        "Id": 135
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "02/10/2024",
        "Text": "I've got a degree in politics, done my first masters dissertation on the Palestine conflict, and authored two books on the topic and been following the middle Eastern conflict in both English and Arabic languages. Please detail your qualifications.",
        "Weight": 4,
        "Id": 136
    },
    {
        "URL": "https://x.com/IlmFeed/status/1840317891666751674",
        "Date": "29/09/2024",
        "Text": "Gaza Girl Finds a Quiet Place to Memorise the Qur'an",
        "Weight": 4,
        "Id": 149
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1840352042360979635",
        "Date": "29/09/2024",
        "Text": "In my estimation, there is a chance Nasrallah is still alive. No-one has seen a body and it could be a strategy to demoralise the Israelis",
        "Weight": 11,
        "Id": 151
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1840351186152571315",
        "Date": "29/09/2024",
        "Text": "Sorry to say, but if Hezbullah doesn't respond forcefully to Israel in the upcoming period, and if the death of Nasrallah is genuine and not staged as a strategy of war, it would be the greatest defeat of an Arab army since the 1967 war.",
        "Weight": 4,
        "Id": 152
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1839971592463434230",
        "Date": "28/09/2024",
        "Text": "Israel's brutal attack on Lebanon and its civilian population is a distraction for their failure to meet military objectives in Gaza. They want to be able to say that they achieved other objectives in a bid to cut their losses. I predict they will declare a ceasefire soon.",
        "Weight": 8,
        "Id": 159
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1839958678528545075",
        "Date": "28/09/2024",
        "Text": "If it is true that Nasrullah has been killed, and Iran doesn't respond then we can all rest assured that Iran would never respond to any aggression by Israel unless Israel attacks them directly which makes them no different from all of the secular Arab regimes backed by USA",
        "Weight": 12,
        "Id": 161
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "28/09/2024",
        "Text": "For me, the strategic point of not mentioning the crimes of Hizbullah for unity does not override the moral point of minimising or ignoring the crimes of Hizbullah to my people in Syria.",
        "Weight": 4,
        "Id": 163
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "28/09/2024",
        "Text": "I side with Hizbullah against Israel and with the Syrians against Hizbullah.",
        "Weight": 4,
        "Id": 164
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1839861469892006281",
        "Date": "28/09/2024",
        "Text": "Although they are undoubtedly preferable to Israel, those who unconditionally support Hizbullah without reservation are traitors to the Syrians and the Muslims at large.",
        "Weight": 4,
        "Id": 165
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1839717219082670091",
        "Date": "27/09/2024",
        "Text": "Why is Iran not backing its proxy?",
        "Weight": 2,
        "Id": 169
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1839716519338483795",
        "Date": "27/09/2024",
        "Text": "What has Beruit got to do with October 7th ?",
        "Weight": 5,
        "Id": 170
    },
    {
        "URL": "https://x.com/hzomlot/status/1839713133893493156",
        "Date": "27/09/2024",
        "Text": "Moments ago Israel bombed residential buildings in the southern neighbourhoods of Beirut. Same criminality, same mindset as in Gaza, in the West Bank, in Lebanon and all over the region and not just for the last year but since Israel’s inception.",
        "Weight": 12,
        "Id": 171
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "25/09/2024",
        "Text": "Hi Shmuley, How's your son? I hope he's dead. I've been challenged by 5 people in the last week alone. Unfortunately, you haven't made the cut. I, like the Jewish community, don't care about you enough. Don't forget to say hi to your daughter for me ",
        "Weight": 4,
        "Id": 180
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1838729267443572941",
        "Date": "24/09/2024",
        "Text": "If the 7th of October has special significance because 800+ civilians were killed in \"Israel\"  the 23rd of September should have the same for the death of almost 500 in Lebanon.",
        "Weight": 4,
        "Id": 181
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1838510303203471839",
        "Date": "24/09/2024",
        "Text": "So, what October 7th type event justifies \"Israel's\" killing of 500 Lebanese civilians ? Whether you attack the occupiers or not, they will attack you if they find an advantage. If this is so, you may as well attack them first.",
        "Weight": 9,
        "Id": 184
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1835448902994035064",
        "Date": "15/09/2024",
        "Text": "I'm sad to admit that the more the genocide continues in Palestine, the more desensitised I become to the suffering. Thus, I must conscientiously add to my weekly routine deliberate exposure to the events so that I don't lose my humanity.",
        "Weight": 9,
        "Id": 207
    },
    {
        "URL": "https://x.com/CriticalCN/status/1831052925818515505",
        "Date": "03/09/2024",
        "Text": "“Its nice to know that you’re dancing in a concert whilst hundreds of thousands of Gazans are homeless.”\n\nCO-HOST: “It makes it even better”\n\nIsraeli podcasters explain the average mentality of the people in Israel.",
        "Weight": 16,
        "Id": 214
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "26/08/2024",
        "Text": "Most of this list are things that encourage or facilitate hiding, spying, or running away. Points 1 and 9 in the list are not \"Israeli inventions\"",
        "Weight": 8,
        "Id": 220
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "25/08/2024",
        "Text": "Almost one year later and HAMAS is still operational. It's time to cut your losses and call it a day.",
        "Weight": 4,
        "Id": 223
    },
    {
        "URL": "https://x.com/Haqiqatjou/status/1827165014073180315",
        "Date": "24/08/2024",
        "Text": "He clearly says he is comparing Jesus in the New Testament vs Jesus according to Islam.\n\nIs this a Zionist account too?",
        "Weight": 5,
        "Id": 228
    },
    {
        "URL": "https://x.com/Haqiqatjou/status/1826361266505744431",
        "Date": "21/08/2024",
        "Text": " Top 20 Most Shocking Moral Teachings of the Talmud with PROOF\n\n(that help us better understand Israel's treatment of Palestinians, etc.)  \n\n(Citations from Sefaria, the authoritative online source for Jewish scriptures)",
        "Weight": 16,
        "Id": 233
    },
    {
        "URL": "https://x.com/DanBilzerian/status/1825453954005635197",
        "Date": "19/08/2024",
        "Text": "Fuck Israel",
        "Weight": 4,
        "Id": 242
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "11/08/2024",
        "Text": "Forced you to do it? What gun did you have to your head? You are against free-mixing when it comes to protesting against genocides but okay, but give yourself an excuse for your own money. Ur done now, repent publicly and don't let me expose you further. I have more.",
        "Weight": 5,
        "Id": 253
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1818576960576004391",
        "Date": "31/07/2024",
        "Text": "More violence has been exhibited due to the tragic killing of three kids in one day than has due to the tragic killing of thirty thousand in the entire pro-Palestine movement in the UK over 10 months.",
        "Weight": 9,
        "Id": 290
    },
    {
        "URL": "https://x.com/CensoredMen/status/1817427200611594406",
        "Date": "28/07/2024",
        "Text": " Belal Muhammad Becomes the First Palestinian Champion in UFC History #UFC304",
        "Weight": 4,
        "Id": 293
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1817490490255704182",
        "Date": "28/07/2024",
        "Text": "Congratulations  \n@bullyb170\n for the greatest victory of a Palestinian sportsman in recent times !!!",
        "Weight": 4,
        "Id": 295
    },
    {
        "URL": "https://x.com/Channel4News/status/1815458366912909710",
        "Date": "22/07/2024",
        "Text": "Israel-Gaza: 400,000 residents ordered to leave Khan Younis",
        "Weight": 8,
        "Id": 303
    },
    {
        "URL": "https://x.com/CriticalCN/status/1814088766291661145",
        "Date": "19/07/2024",
        "Text": "8 months of being an Israeli hostage vs 1 month of being a Palestinian hostage.\n\nFollow \n@CriticalCN",
        "Weight": 12,
        "Id": 308
    },
    {
        "URL": "https://x.com/jorymicah/status/1810673764763406580",
        "Date": "09/07/2024",
        "Text": "Ashkenazi Jews, who make up around 85% of Jews living today, do not descend from the Israelites. \n\nThey are from the Ukraine/Russia area & descend from Khazarians who mass converted to Judaism around the 7th century. \n\nTheir ancestors never stepped foot in the Middle East.",
        "Weight": 18,
        "Id": 331
    },
    {
        "URL": "https://x.com/RamAbdu/status/1809493730056868067",
        "Date": "06/07/2024",
        "Text": "Sham Mohammed Jamal Zino, Rania Mohammed Jamal Zino, Jamal Mohammed Jamal Zino, and their uncle, Mohammed Jalal Zino, were killed by Israel tonight.",
        "Weight": 4,
        "Id": 345
    },
    {
        "URL": "https://x.com/stairwayto3dom/status/1807018241874698625",
        "Date": "29/06/2024",
        "Text": " A child just DIED due to STARVATION in Gaza!",
        "Weight": 4,
        "Id": 357
    },
    {
        "URL": "https://x.com/sneako/status/1806530442243543322",
        "Date": "28/06/2024",
        "Text": "Someone in Trump’s circle needs to tell him “Palestinian” is not an insult. This blatantly reveals his view on the genocide. \n\nDisappointed. Free Palestine.",
        "Weight": 13,
        "Id": 359
    },
    {
        "URL": "https://x.com/DillyHussain88/status/1801221801571160136",
        "Date": "13/06/2024",
        "Text": "If this isn’t proof of genocidal intent and collective punishment, I don’t know what is.\n\nThis paid tweet has now been deleted by \n@Israel\n.",
        "Weight": 4,
        "Id": 361
    },
    {
        "URL": "https://x.com/DillyHussain88/status/1799366724606722105",
        "Date": "08/06/2024",
        "Text": "If you put Israel  before Britain you are not a British patriot, you are an Israeli shill living in Britain ",
        "Weight": 12,
        "Id": 364
    },
    {
        "URL": "https://x.com/Tam_Khan/status/1797247307043237962",
        "Date": "02/06/2024",
        "Text": "Respect \n@TeamKhabib\n \n\nAsking \n@realDonaldTrump\n to stop the genocide in Palestine \n\n",
        "Weight": 9,
        "Id": 367
    },
    {
        "URL": "https://x.com/djsnake/status/1795076380046082332",
        "Date": "27/05/2024",
        "Text": "GAZA IS ALONE.",
        "Weight": 4,
        "Id": 374
    },
    {
        "URL": "https://x.com/hzomlot/status/1794819449733685470",
        "Date": "26/05/2024",
        "Text": "Israel commits a massacre in #Rafah this evening, dropping several 2,000 pound bombs on civilian tents and #UN compounds, murdering dozens of civilians seeking shelter. This was Israel’s response to the \n@CIJ_ICJ\n ruling Friday that it must halt its offensive on Rafah.",
        "Weight": 12,
        "Id": 378
    },
    {
        "URL": "https://x.com/CriticalCN/status/1794340105043538237",
        "Date": "25/05/2024",
        "Text": "“I’m an IDF soldier.”\n\nIsraeli soldier assaulted a young woman in London, calling her a “dirty f***ing Muslim.”\n\nHe immediately backs down when confronted by a man.",
        "Weight": 8,
        "Id": 382
    },
    {
        "URL": "https://x.com/Lowkey0nline/status/1790035009027317822",
        "Date": "13/05/2024",
        "Text": "More footage emerges of Zionist settler gangs destroying aid meant for Gaza.",
        "Weight": 9,
        "Id": 393
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1789606349619245466",
        "Date": "12/05/2024",
        "Text": "Isn't it interesting that the greatest current Israeli hero is a singer who got 5th place at a trivial competition at a time where they have deployed hundreds of thousands of \"soldiers\" to Gaza.",
        "Weight": 12,
        "Id": 395
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1788868589878931730",
        "Date": "10/05/2024",
        "Text": "The most successful Christian missionary work that has been done has been in Shia majority Iran, where a large portion of the population hate their governments. Despite the Iranian exception, why are Christian missionaries abject failures in the Muslim world ?",
        "Weight": 6,
        "Id": 400
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1788639057569804728",
        "Date": "09/05/2024",
        "Text": "Our hearts bleed for Rafah. There is no doubt Allah is preparing these special things for something bigger",
        "Weight": 2,
        "Id": 402
    },
    {
        "URL": "https://x.com/AbbyMartin/status/1788248501517951041",
        "Date": "08/05/2024",
        "Text": "Very telling that all the big Israel accounts are promoting this… their guy appears insane, in the debate he actually threatens me (and my kids?), and is on record saying he thinks the lives of 1.6 billion Muslims are worth less than a single cow.",
        "Weight": 4,
        "Id": 405
    },
    {
        "URL": "https://x.com/MaxBlumenthal/status/1787870447805079680",
        "Date": "07/05/2024",
        "Text": "Here’s what Israel did today in Rafah \n\nThis is what its road to “total victory” looks like",
        "Weight": 6,
        "Id": 408
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1787768938262147131",
        "Date": "07/05/2024",
        "Text": "The fact that Israel is sending negotiators to Cairo to negotiate terms of a ceasefire with HAMAS is the clearest evidence that they have failed their political objectives to eradicate HAMAS and that HAMAS is inflicting damages on Israel which it cannot ignore.",
        "Weight": 20,
        "Id": 410
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "05/05/2024",
        "Text": "A British citizen gave other British citizens advice. Religion and skin colour do not remove citizenship in this country by law. If you dont like it, you can move to Israel.",
        "Weight": 4,
        "Id": 418
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "28/04/2024",
        "Text": "If you are brave enough, let's discuss your theories in person or on stream. Posting meme content in a comfortable place without man to man response is more reminiscent of Israeli strategies than anything else.",
        "Weight": 8,
        "Id": 431
    },
    {
        "URL": "https://x.com/georgegalloway/status/1783477206825484704",
        "Date": "25/04/2024",
        "Text": "Just imagine that this was your mother... #Gaza",
        "Weight": 4,
        "Id": 433
    },
    {
        "URL": "https://x.com/CriticalCN/status/1782849329746547040",
        "Date": "23/04/2024",
        "Text": "Nearly 500 bodies found in mass graves at multiple hospitals in Gaza. \n\nThe bodies included ELDERLY women and CHILDREN.\n\nWe are witnessing a genocide in real time and the media is focused on vilifying peaceful student protests.\n\n#Gaza #GazaHolocaust",
        "Weight": 20,
        "Id": 436
    },
    {
        "URL": "https://x.com/CriticalCN/status/1782062671648493732",
        "Date": "21/04/2024",
        "Text": " Ramallah, West Bank: Angry Israeli settler tries to remove Palestinian flag but triggers an explosive trap.\n\nThe women behind the camera said they want to “remove that ugly blot of the non-existent state” just before the explosion occurred.",
        "Weight": 12,
        "Id": 438
    },
    {
        "URL": "https://x.com/mhdksafa/status/1781757811107541044",
        "Date": "20/04/2024",
        "Text": "Rafah is being decimated, there is nowhere else left to go. Israel is now bombing more than 1.7 million civilians trapped in Rafah, Gaza's last place of refuge. A massacre is happening in Rafah right now and the world is silent.",
        "Weight": 14,
        "Id": 440
    },
    {
        "URL": "https://x.com/5Pillarsuk/status/1780946205721194813",
        "Date": "18/04/2024",
        "Text": "Prominent Muslim YouTuber Mohammed Hijab demands an apology from Norewigian MP Kjell Ingolf Ropstad who accused him of antisemitism, misogyny and homophobia.  \n@mohammed_hijab",
        "Weight": 3,
        "Id": 442
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1780019520544858447",
        "Date": "15/04/2024",
        "Text": "Alhamdolilah, our campaign against the Gaza genocide has been so successful that frustrated far-right zionists are trying to get me banned from Norway. It is clear zionists can not handle free speech. When you lose the argument, you must censor the truth.",
        "Weight": 29,
        "Id": 450
    },
    {
        "URL": "https://x.com/CriticalCN/status/1779556949568139473",
        "Date": "14/04/2024",
        "Text": " It cost Israel more than $1 billion to activate its defence systems to stop Iran's drone and missile onslaught over night. \nAccording to Brigadier General Reem Aminoach, \"the defence tonight was […] of 4-5 billion shekels [$I-I.3 billion] per night.\" https://ynetnews.com/article/h16o8qtea…",
        "Weight": 6,
        "Id": 451
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1779540377227178023",
        "Date": "14/04/2024",
        "Text": "Practically, all Muslim rulers have forsaken the Palestinians",
        "Weight": 8,
        "Id": 452
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1779493800060084374",
        "Date": "14/04/2024",
        "Text": "Iran is one of the most careful players in the region, and if I had to guess, I would think they have regular communication with the United States. The missile fiasco wasn't a UFC match. It was a WWE match.",
        "Weight": 2,
        "Id": 453
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1779434711120568707",
        "Date": "14/04/2024",
        "Text": "Something seems off key about the the Iran missile fiasco.",
        "Weight": 2,
        "Id": 455
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1779223625339416828",
        "Date": "13/04/2024",
        "Text": "What is the name and background of the Sydney terrorist? Can I have a source ?",
        "Weight": 5,
        "Id": 457
    },
    {
        "URL": "https://x.com/jakeshieldsajj/status/1778193545381511238",
        "Date": "10/04/2024",
        "Text": "Do Christian Zionists know how much they are hated in Israel?",
        "Weight": 14,
        "Id": 459
    },
    {
        "URL": "https://x.com/TuckerCarlson/status/1777800149818822809",
        "Date": "09/04/2024",
        "Text": "Ep. 91  How does the government of Israel treat Christians? In the West, Christian leaders don’t seem interested in knowing the answer. They should be. Here’s the view of a pastor from Bethlehem.",
        "Weight": 4,
        "Id": 460
    },
    {
        "URL": "https://x.com/CriticalCN/status/1774866169721155877",
        "Date": "01/04/2024",
        "Text": "New Article:  The Al-Shifa Hospital Siege: Exposing IDF Atrocities in Gaza\n\nhttps://criticalcontentnews.com/the-al-shifa-hospital-siege-exposing-idf-atrocities-in-gaza/…\n\n#GazaGenocide #AlShifa_Hospital #AlShifa #Palestine #Gaza",
        "Weight": 25,
        "Id": 468
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1774798212294987846",
        "Date": "01/04/2024",
        "Text": "The exchange rate currency for the term 'anti-semitism' is the lowest it probably has ever been in history due to over-supply.\n\nGood message by relating to the smear of \n@Haqiqatjou\n by the ADL.",
        "Weight": 3,
        "Id": 471
    },
    {
        "URL": "https://x.com/DillyHussain88/status/1774067099326980151",
        "Date": "30/03/2024",
        "Text": "\"I treat the Palestinians in Gaza in the same way I would treat any other group that produced a horror like that. They're responsible for their actions.\" \n\n\n@DouglasKMurray\n is evil personified.\n\nPro-genocide\nPro-collective punishment\nPro-ethnic cleansing\nPro-murder of women & kids",
        "Weight": 17,
        "Id": 475
    },
    {
        "URL": "https://x.com/jacksonhinklle/status/1773047207563821166",
        "Date": "27/03/2024",
        "Text": " Joe Rogan explains that ISRAEL’S GENOCIDE on GAZA is a “small scale Holocaust.”",
        "Weight": 16,
        "Id": 481
    },
    {
        "URL": "https://x.com/DillyHussain88/status/1772735588900155619",
        "Date": "26/03/2024",
        "Text": "JEWISH YOUTHS INTIMIDATED MUSLIM WORSHIPERS OUTSIDE MOSQUE ON PURIM\n\nJewish youths intimidated worshipers outside Bilal Mosque in Prestwich on their religious festival of Purim. They were singing and dancing in orange jumpsuits while blasting music right outside the mosque.",
        "Weight": 8,
        "Id": 488
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "25/03/2024",
        "Text": "Keep talking \n@LauraLoomer\n , we have information about you which (if released) will ruin your life. \n\nPerhaps you would like to cleanse your sins by providing charity to Gaza and other affected areas on the link below.",
        "Weight": 4,
        "Id": 494
    },
    {
        "URL": "https://x.com/smile2jannah/status/1772046110049132695",
        "Date": "24/03/2024",
        "Text": "This is the poor defenceless, Israeli army, apparently.",
        "Weight": 8,
        "Id": 497
    },
    {
        "URL": "https://x.com/DrLoupis/status/1771798882260766825",
        "Date": "24/03/2024",
        "Text": "Jewish Daily Wire host Andrew Klavan says “Christ is King” is an anti-Semitic dogwhistle, Jews are “God’s chosen people.”",
        "Weight": 8,
        "Id": 502
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "24/03/2024",
        "Text": "Before, you used to be a voice for the working class far right. It seems now you are a voice for a zionist handler. This is my last challenge I'll send you a link on Zoom and give you a chance send me your email on sirateducation@gmail.com. I'll be available Tuesday 8pm",
        "Weight": 5,
        "Id": 504
    },
    {
        "URL": "https://x.com/CriticalCN/status/1771726043075707037",
        "Date": "24/03/2024",
        "Text": "New Article: Why Candace Owens was fired by Ben Shapiro\nhttps://criticalcontentnews.com/why-candace-owens-was-fired-by-ben-shapiro/…\n\n#CandaceOwens #BenShapiro #DailyWire #Antisemitism",
        "Weight": 3,
        "Id": 507
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "23/03/2024",
        "Text": "I understand your point, but calling him out is unbecoming. Well done on your Pro-Palestine activism though, the community commends you",
        "Weight": 9,
        "Id": 509
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "20/03/2024",
        "Text": "Israeli cancerous tree. An apt depiction of the encroachment of an illegitimate entity.",
        "Weight": 8,
        "Id": 521
    },
    {
        "URL": "https://x.com/jodymcintyre_/status/1769849258163724644",
        "Date": "18/03/2024",
        "Text": "I hereby announce my intention to unseat Labour Friend of Israel and MP for Birmingham Yardley, Jess Phillips.\n\nThe people need a representative who speaks for them!\n\nhttps://crowdfunder.co.uk/p/jodymcintyre",
        "Weight": 4,
        "Id": 523
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "19/03/2024",
        "Text": "Candace, you're doing a great job, but don't make the mistake of justifying/explaining yourself excessively on the issue of \"anti-semitism\"; whatever you say will never be enough. Don't focus on the consequences of the zionists, focus on becoming a consequence for them.",
        "Weight": 13,
        "Id": 525
    },
    {
        "URL": "https://x.com/jakeshieldsajj/status/1768376692442358229",
        "Date": "14/03/2024",
        "Text": "Your false claims of antisemitism no longer work Ben and the world sees through your lies",
        "Weight": 3,
        "Id": 534
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1768093113480876456",
        "Date": "14/03/2024",
        "Text": "According to the Hebrew Old Testament, God repents for considering to punish the sons of Israel. Imagine growing up believing God himself owes you an apology sometimes.\n\nKing James Bible\nAnd the LORD repented of the evil which he thought to do unto his people\n32:14",
        "Weight": 4,
        "Id": 536
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1768089114312610030",
        "Date": "14/03/2024",
        "Text": "A real question must be asked: To what extent is Jewish theology (specifically ethnic supremacy claims) responsible for large numbers of \"Israelis\" having a narcisstic entitlement complex which makes them indifferent to the death of tens of thousand of human beings?",
        "Weight": 15,
        "Id": 537
    },
    {
        "URL": "https://x.com/CriticalCN/status/1767934486455484563",
        "Date": "13/03/2024",
        "Text": "New Article: Ramadan for the Indomitable People of Gaza.\n\nhttps://criticalcontentnews.com/ramadan-for-the-indomitable-people-of-gaza/…\n\n#Gaza #GazaHoloucast #Ramadan #GazaFamine #Israel",
        "Weight": 24,
        "Id": 540
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "12/03/2024",
        "Text": "Abu Obaida - Military strategist and general who Israel has not been able to dispose of despite overwhelming advantages on the air, sea, and land.",
        "Weight": 4,
        "Id": 543
    },
    {
        "URL": "https://x.com/Palestine001_/status/1766726814628454506",
        "Date": "10/03/2024",
        "Text": "They were buried alive hugging each other:\n\n#Israeli planes destroyed their house and buried them alive under rubble in the Nuseirat camp in #Gaza",
        "Weight": 12,
        "Id": 550
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1766645659778609212",
        "Date": "10/03/2024",
        "Text": "A message from Gaza, watch till end ",
        "Weight": 4,
        "Id": 551
    },
    {
        "URL": "https://x.com/davidsheen/status/1766054022811689359",
        "Date": "08/03/2024",
        "Text": "Israel’s top rabbi in Jaffa calls to genocide Gaza: “Don’t leave a soul alive…not only 14, 16-year-old lads…also the next generation. And those who create the future generation.” Asked “Babies too?” He responds “Same thing. You can’t outsmart the Torah.”",
        "Weight": 13,
        "Id": 552
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "06/03/2024",
        "Text": "Are you an Israeli citizen? Go and fight Hamas yourself. Why do you depend on other men to fight and die for your cause without engaging in battle yourself ? Are you a coward ?",
        "Weight": 12,
        "Id": 555
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1764572095856418950",
        "Date": "04/03/2024",
        "Text": "IDF\nhow many tanks of yours have been destroyed?  Israel have around 2,200 tanks. We have seen through HAMAS videos the destruction of many of these tanks. HAMAS claims over a thousand. A Merkava tank cost upto 10 million. how much have you lost?",
        "Weight": 12,
        "Id": 561
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1764319417305813211",
        "Date": "03/03/2024",
        "Text": "The more Israel continues, the more the British and American people side with Palestine. Source: Yougov",
        "Weight": 8,
        "Id": 563
    },
    {
        "URL": "https://x.com/CensoredMen/status/1764061755272057035",
        "Date": "02/03/2024",
        "Text": " UFC fighter Muhammad Mokaev calls on Rishi Sunak to \"stop the genocide\" after his win.\n\n\n@muhammadmokaev",
        "Weight": 5,
        "Id": 565
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "02/03/2024",
        "Text": "You are one of the most war equipped countries in the world, and you have FAILED miserably in even coming close to defeating HAMAS a group with 0 fighter jets, 0 tanks and and 0 real navy. You wage a war against civilians and  have only succeeded in making the world hate you",
        "Weight": 4,
        "Id": 567
    },
    {
        "URL": "https://x.com/CriticalCN/status/1762459553134682424",
        "Date": "27/02/2024",
        "Text": "New Article: Aaron Bushnell: A Tragedy\n\nhttps://criticalcontentnews.com/aaron-bushnell-a-tragedy/…\n\n#AaronBushnell #Gaza #Gaza_Genocide #Israel #Hamas #GazaWar",
        "Weight": 25,
        "Id": 571
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1761798111804923981",
        "Date": "25/02/2024",
        "Text": "In your experience, what has been the best charity you have donated to for the cause of Palestine?",
        "Weight": 4,
        "Id": 574
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1757652170235687162",
        "Date": "14/02/2024",
        "Text": "A Little Palestinian girl in agony takes her last breath after the israelis targeted her with missiles blowing out her stomach: this is defence?",
        "Weight": 15,
        "Id": 580
    },
    {
        "URL": "https://x.com/Lowkey0nline/status/1757326323712774650",
        "Date": "13/02/2024",
        "Text": "Israelis hold a party blocking humanitarian aid from entering Gaza.\n\nThis is sick.",
        "Weight": 15,
        "Id": 581
    },
    {
        "URL": "https://x.com/Lowkey0nline/status/1751249087930802235",
        "Date": "27/01/2024",
        "Text": "Yesterday, the ICJ made it clear that it had trust in UNRWA sources. \n\nImmediately,  Israel attacked the credibility of those employed by the agency, and now both the US and UK have cut funding to it.",
        "Weight": 4,
        "Id": 591
    },
    {
        "URL": "https://x.com/lexfridman/status/1751357828579594729",
        "Date": "27/01/2024",
        "Text": "I would like to host an Israel-Palestine debate, and to do it well: 3-5+ hours, in-person, focused on exploring ideas & history, with empathy, rigor, and respect. Please suggest people who could represent each side. Reply below and/or vote in this form: https://form.jotform.com/lexfridman/israel-palestine-debate…",
        "Weight": 16,
        "Id": 592
    },
    {
        "URL": "https://x.com/CriticalCN/status/1751205941263954388",
        "Date": "27/01/2024",
        "Text": "New Article: The ICJ’s Ruling and Implications for #Gaza and IL\n\nIn a defining moment for international jurisprudence and human rights, the ICJ's interim ruling on the Gaza conflict spotlights the humanitarian crisis and reinvigorates calls for justice",
        "Weight": 8,
        "Id": 594
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1750567028702769434",
        "Date": "25/01/2024",
        "Text": "Amazing work. Almost 500k on the link and 250k in the event. We almost raised 1 million for the people of Gaza.\n\nhttps://justgiving.com/campaign/palestine313aid…",
        "Weight": 8,
        "Id": 599
    },
    {
        "URL": "https://x.com/stairwayto3dom/status/1748307435691893053",
        "Date": "19/01/2024",
        "Text": "A young Palestinian child has a seizure from constant Israeli bombings…\n\nUnfortunately, he didn’t make it. ",
        "Weight": 12,
        "Id": 606
    },
    {
        "URL": "https://x.com/CriticalCN/status/1748322757140533507",
        "Date": "19/01/2024",
        "Text": "Target Baluchistan: Understanding the Iran/Pakistan Missile Crisis\n\n“The recent missile exchanges… encapsulate a volatile and complex regional landscape. These events are deeply rooted in historical, ethnic, and geopolitical tensions.\"\n\n\n@TariqKurd01",
        "Weight": 2,
        "Id": 608
    },
    {
        "URL": "https://x.com/Lowkey0nline/status/1748277798492393598",
        "Date": "19/01/2024",
        "Text": "\"If we killed 4,000 Palestinian children, we should have killed more...\"\n\nHate crime charges against former White House adviser Stuart Seldowitz\nare to be dismissed.",
        "Weight": 4,
        "Id": 609
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1747682270935224529",
        "Date": "17/01/2024",
        "Text": "Well done guys we raised almost half a million sterling pounds for Gaza and here it is being used on the ground. Together we make a difference",
        "Weight": 4,
        "Id": 611
    },
    {
        "URL": "https://x.com/CriticalCN/status/1746240431409488276",
        "Date": "13/01/2024",
        "Text": "ANALYSIS: How the Neighbouring Countries are Responding to the Palestinian Crisis\n\nCCN researcher Abdullah Ali delves into the complex geopolitical tapestry of the ME, to examine the logics behind how states in the region are responding to the #Gaza crisis",
        "Weight": 8,
        "Id": 618
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1745548009461424368",
        "Date": "11/01/2024",
        "Text": "Is the Corrupt State of Israel mentioned in the Quran?",
        "Weight": 4,
        "Id": 620
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1745196593815466183",
        "Date": "10/01/2024",
        "Text": "http://justgiving.com/campaign/palestine313aid…",
        "Weight": 4,
        "Id": 622
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1744288047267520540",
        "Date": "08/01/2024",
        "Text": "The Khamzat Wrestling match raised 100k of charity for Gaza in less than 24 hours. \n\nLet's meet the 250k target today !",
        "Weight": 4,
        "Id": 631
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1744005835032773028",
        "Date": "07/01/2024",
        "Text": "Let's get the donations up to 100k for Gaza inshallah, these guys are on the ground confirmed!",
        "Weight": 4,
        "Id": 632
    },
    {
        "URL": "https://x.com/CriticalCN/status/1743925367717376466",
        "Date": "07/01/2024",
        "Text": "New Article: #Sudan’s Strategic Role In The Geopolitical Landscape \n\nIn CCN’s third Sudan instalment we delve into the geopolitical dynamics, and the roles of major players like the #US, #Russia, Gulf nations and #Israel, as well as their regional impacts",
        "Weight": 4,
        "Id": 633
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1740111985713291675",
        "Date": "27/12/2023",
        "Text": "https://youtu.be/4yHrzVrOyT4?si=amqklYPRXikSHHvb…\n\nThe Israeli fighter Haim has officially pulled out of the fight.",
        "Weight": 8,
        "Id": 651
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1739640043050778906",
        "Date": "26/12/2023",
        "Text": "Video released by IDF indicates utter panic of the Israeli soldiers ",
        "Weight": 8,
        "Id": 653
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1739592292476780766",
        "Date": "26/12/2023",
        "Text": "https://haaretz.com/opinion/2023-12-23/ty-article-opinion/.premium/israel-must-recognize-that-its-lost-the-gaza-war-to-end-the-palestinian-conflict/0000018c-97ef-da81-a1bc-dfffe7ca0000…",
        "Weight": 12,
        "Id": 654
    },
    {
        "URL": "https://x.com/Lowkey0nline/status/1738519563803750671",
        "Date": "23/12/2023",
        "Text": "When Israeli snipers kill Palestinian women sheltering in churches, remember that Britain has consistently sold Israel the sniper rifles and sniper rifle components to do it.",
        "Weight": 16,
        "Id": 661
    },
    {
        "URL": "https://x.com/MusaAdnan/status/1737967032706965893",
        "Date": "21/12/2023",
        "Text": " NEW VIDEO: \n\nCHALLENGING the Zionist Apologist Ben Shapiro \n\nWatch & Share: \n\nhttps://youtu.be/wBtSOP6aaKM?si=0lp1v6vOmNHp9ny_…",
        "Weight": 5,
        "Id": 664
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "21/12/2023",
        "Text": "How could this be happening if you are dominating HAMAS as you claim?",
        "Weight": 4,
        "Id": 666
    },
    {
        "URL": "https://x.com/CensoredMen/status/1737491363497705621",
        "Date": "20/12/2023",
        "Text": " Israel's Minister for the Empowerment of Women:\n\n\"I don't care about Gaza.\n\nI literally don't care.\n\nFor all I care, they can go out and swim in the sea.\"",
        "Weight": 8,
        "Id": 667
    },
    {
        "URL": "https://x.com/MusaAdnan/status/1736868906005061654",
        "Date": "18/12/2023",
        "Text": " NEW VIDEO: \n\nIsraeli Propaganda | Hamas Members or Civilians? | Critical Content\n\nLet’s examine the footage that was recently released by the IDF… \n\nWatch & Share: https://youtu.be/9YnTyinDe88?si=8aMk4wLTBaJ8W4qJ…",
        "Weight": 12,
        "Id": 672
    },
    {
        "URL": "https://x.com/MiddleEastEye/status/1736541361287934432",
        "Date": "18/12/2023",
        "Text": "Israeli journalist Shimon Riklin has stirred controversy and condemnation after supporting war crimes, stating his inability to sleep unless he sees homes in Gaza destroyed. Riklin referenced the Torah, saying that ancient practices involved spreading salt on the earth.",
        "Weight": 24,
        "Id": 673
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "17/12/2023",
        "Text": " He's also ADCC champion and has a 18-6 professional record. He is the most formidable Israeli fighter in history. This should be an interesting one. I was starting to get bored of all the debating. I've sent him a private message, lets hope he signs contract",
        "Weight": 8,
        "Id": 678
    },
    {
        "URL": "https://x.com/Lowkey0nline/status/1736077016590438704",
        "Date": "16/12/2023",
        "Text": "Israeli soldiers write the names of public figures from social media on missiles to be dropped on Gaza.",
        "Weight": 12,
        "Id": 686
    },
    {
        "URL": "https://x.com/MMetaphysician/status/1736039172391977004",
        "Date": "16/12/2023",
        "Text": "I will be appearing on TalkTV today around 3:20-3:40pm ET/8:20-8:40pm UK time on James Whale's Unleashed to discuss the latest on Palestine and Israel in shaa Allah. Link for the stream below:",
        "Weight": 8,
        "Id": 687
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "16/12/2023",
        "Text": "This case study makes it clear that the IDF will not spare a person if they surrender. This makes it even harder to believe that the Palestinian men in underwear were anything other than unarmed civilians.",
        "Weight": 4,
        "Id": 688
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "16/12/2023",
        "Text": "Why did the IDF terrorist, dressed in fishing gear, meet his match on the battlefield? Because he thought he could reel in victory, but all he caught was defeat!",
        "Weight": 5,
        "Id": 689
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "15/12/2023",
        "Text": "@piersmorgan\n although I agree that you have been  biased I have also noticed your development on this issue. You now condemn the occupation, you came close to calling the indiscriminate killing as a war crime. I still have hope in you. Why not call for an areial ceasefire ?",
        "Weight": 10,
        "Id": 696
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "14/12/2023",
        "Text": "If you don't mind, can you tell me the exact time stamp where he endorsed HAMAS?",
        "Weight": 4,
        "Id": 699
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1735304667658113468",
        "Date": "14/12/2023",
        "Text": "This leaflet was dropped on the people of Gaza to give up the top commanders of HAMAS. Firstly, how will they deliver the cash prizes? Secondly, this shows they believe these commanders are in Gaza and not Qatar. Thirdly, it shows severe desperation more generally",
        "Weight": 12,
        "Id": 700
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "14/12/2023",
        "Text": "This is an interesting first step. Despite your recent indiscretions, I will give you credit for calling Gaza an \"open air prison\" when it was unpopular to do so. At this stage, we need stronger action against the indiscriminate killing of civilians. The UK position is untenable",
        "Weight": 4,
        "Id": 702
    },
    {
        "URL": "https://x.com/CensoredMen/status/1735033104757125209",
        "Date": "13/12/2023",
        "Text": " Wow, Prof. Norman Finkelstein being brilliant once again \n\nThe amount of respect I have for this man is indescribable.\n\nThank you Piers for giving him a good amount of time also.\n\n\"Israel has been waging a war of genocide in Gaza.\"\n\n\n@piersmorgan\n | \n@normfinkelstein",
        "Weight": 13,
        "Id": 705
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1734637251844272572",
        "Date": "12/12/2023",
        "Text": "Israel is guilty of terrorism, too.\n\nSo why aren't we talking about it?",
        "Weight": 4,
        "Id": 708
    },
    {
        "URL": "https://x.com/doamuslims/status/1734698372320178260",
        "Date": "12/12/2023",
        "Text": ".\n@piersmorgan\n has been humiliated and rattled again! \n\n\n@AbdullaAndalusi\n asked Piers a simple question about the definition of terrorism. He couldn’t answer. \n\n\n@AbdullaAndalusi\n: “Killing civilians is an act of terror\"?\n\nPiers: \"No\"\n\n#Palestine #Gaza",
        "Weight": 8,
        "Id": 710
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "12/12/2023",
        "Text": "That's a shocking mistake. Are you saying that orthodox Jewish teaching (Shapiro claims to be that)  doesn't say homosexuality is a sin ? This is becoming comical now.",
        "Weight": 4,
        "Id": 713
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "12/12/2023",
        "Text": "This man was a terrorist and is currently being eaten by worms under the ground. He died in vain.",
        "Weight": 5,
        "Id": 720
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "11/12/2023",
        "Text": "@piersmorgan\n if you said this about Jewish women what would you think would happen to you? That being said, Jewish Halakha law considers homosexuality to be a sin. Do you condemn it ? A woman cannot get a divorce without a Gett from a man, do you condemn it ?",
        "Weight": 8,
        "Id": 721
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "11/12/2023",
        "Text": "Despite a  numerical and technological advantage, they are dropping like dominoes. They looked very happy when they were in relative safety as their colleagues were killing kids. Look at them now. Under the ground in Gaza",
        "Weight": 4,
        "Id": 725
    },
    {
        "URL": "https://x.com/HATzortzis/status/1734170047482847527",
        "Date": "11/12/2023",
        "Text": "Let's make \"Unveiling Tyranny: The Genocide in Gaza & False Zionist Narratives on Palestine\" a bestseller. It will promote the book to wider audiences.\n\nhttps://amazon.co.uk/Unveiling-Tyranny-Genocide-Narratives-Palestine/dp/B0CPWHHY6F/…\n\nNote: we receive zero profit from these books as we have only priced them at cost price on Amazon.",
        "Weight": 27,
        "Id": 726
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "11/12/2023",
        "Text": "Isn't it ironic that you accuse Palestinians of being racist while being racist to them in the same tweet. Had the same statement been said of Jews it would undoubtedly be labelled anti-semitism. Well done, you have officially exposed yourself.",
        "Weight": 15,
        "Id": 727
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "11/12/2023",
        "Text": "Frankly, this video doesn't show a single HAMAS fighter that has been shot or killed. This is an embarrassment especially if it is the best thing the IDF can produce to evidence on-the-ground success.",
        "Weight": 4,
        "Id": 729
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1734119775859605578",
        "Date": "11/12/2023",
        "Text": "After analysing all of the videos released by the IDF (3 videos) and those many videos released by HAMAS it is clear that the IDF forces are losing on the ground in Gaza. After over two months of fighting the IDF have not achieved much militarily except killing non-combatants.",
        "Weight": 8,
        "Id": 732
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "10/12/2023",
        "Text": "Doesn't look anything like \"surrender\" to me. In fact, HAMAS has revealed dozens of these videos and most of them demonstrate massive damage being done to the IDF where the IDF videos are much less in number. I is clear the IDF are great play actors and civilian killers.",
        "Weight": 4,
        "Id": 733
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1733849207276970188",
        "Date": "10/12/2023",
        "Text": "It is naive to think that HAMAS will be overcome in a matter of weeks or months. Take the Jolo Islands (in the Philippines) as an example. Fighting has been ongoing for decades, and the Islamic militants still have significant presence to this day.",
        "Weight": 4,
        "Id": 734
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "10/12/2023",
        "Text": "Jews inhabited the area as a majority from 1250 BC till 129 AD (when Hadrian expelled them). This is about 1380 years. They didn't become a majority again until after 1948. 129 till 1948 is about 1820 years. Thus, historically Jews spent more time OUT than IN as a majority.",
        "Weight": 8,
        "Id": 735
    },
    {
        "URL": "https://x.com/HATzortzis/status/1733603730811998273",
        "Date": "09/12/2023",
        "Text": "To all those who have been blessed with a large following & influence. Please share this free book.\n\nIt is an intelligent, moral & timely contribution addressing the current genocide in Gaza and the decades-long Israeli oppression of the Palestinian people.\n\nPlease share!",
        "Weight": 21,
        "Id": 736
    },
    {
        "URL": "https://x.com/PalMissionUK/status/1733508477551563037",
        "Date": "09/12/2023",
        "Text": "100,000 protesters braved the cold weather today in London to protest against the mass killings in #Gaza and demand a permanent ceasefire",
        "Weight": 4,
        "Id": 740
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1733447187625865609",
        "Date": "09/12/2023",
        "Text": "Who are the most vocal pro-Israel/Zionist celebrities?",
        "Weight": 14,
        "Id": 742
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1733073311683194950",
        "Date": "08/12/2023",
        "Text": "Who are the most vocal pro-Palestine celebrities?",
        "Weight": 9,
        "Id": 745
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1732307159902224392",
        "Date": "06/12/2023",
        "Text": "Guys, make sure to subscribe to this channel. We are going to be doing big things on it for the Palestinian cause.",
        "Weight": 4,
        "Id": 749
    },
    {
        "URL": "https://x.com/ashoswai/status/1731949590721569149",
        "Date": "05/12/2023",
        "Text": "Israel has bombed another school in Gaza.",
        "Weight": 8,
        "Id": 752
    },
    {
        "URL": "https://x.com/CensoredMen/status/1732057063331623237",
        "Date": "05/12/2023",
        "Text": " Israel is a terrorist state.\n\nHow can ANYONE justify this?\n\n GRAPHIC 18+",
        "Weight": 9,
        "Id": 753
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1731942088621650044",
        "Date": "05/12/2023",
        "Text": "Commentators who condemn the captives held by HAMAS but do not condemn tens of thousands of Palestinian women and children who have been killed should be assumed to be morally bankrupt racists.",
        "Weight": 8,
        "Id": 757
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "04/12/2023",
        "Text": "200 'terrorist targets' and 20,000 civilians killed. That ratio is shockingly pathetic. Can you also comment on the IDF  ground retreat that has been reported yesterday in Northern Gaza where as much as 70% of the troops were forced into 'tactical retreat'?",
        "Weight": 9,
        "Id": 762
    },
    {
        "URL": "https://x.com/ashoswai/status/1730998776079262020",
        "Date": "02/12/2023",
        "Text": "A Palestinian child in Gaza! The world has lost its humanity. https://x.com/muratsahin2023/status/1730662341061087722/video/1…",
        "Weight": 8,
        "Id": 763
    },
    {
        "URL": "https://x.com/kennardmatt/status/1731282627745730778",
        "Date": "03/12/2023",
        "Text": "Unspeakable horror. Israel is pure evil. https://x.com/BekirDeveli/st/BekirDeveli/status/1731229677333741940…",
        "Weight": 4,
        "Id": 765
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1731056611270013120",
        "Date": "02/12/2023",
        "Text": "I spoke to a European who was in Gaza during the bombardment and was let out. He told me the Gazans watch what we do on social media and on the streets, and this makes them feel  supported. If this was the only objective activism fulfilled, it would suffice.",
        "Weight": 8,
        "Id": 768
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1731006811363328122",
        "Date": "02/12/2023",
        "Text": "Everyone needs to watch this: \n\nThe Reality of Israeli Prisons | Captive Children | Critical Content \n\nShare the channel with others\n\nWatch now:",
        "Weight": 8,
        "Id": 769
    },
    {
        "URL": "https://x.com/dancohen3000/status/1730957259792880106",
        "Date": "02/12/2023",
        "Text": "Israel just wiped out an entire block in Shujaiya, east of Gaza city. Initial reports say there are between 300 and 1000 dead. \n\nThis comes after Blinken asked Netanyahu to kill fewer civilians. Israel responded with one of its biggest massacres yet.\n https://x.com/BelalNezar/status/1730951686921891953/video/1…",
        "Weight": 12,
        "Id": 770
    },
    {
        "URL": "https://x.com/Haqiqatjou/status/1730627164536483907",
        "Date": "01/12/2023",
        "Text": "Watch till the end. Really exposes the historical record of Israel's genocidal agenda.",
        "Weight": 4,
        "Id": 772
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1730357031381397673",
        "Date": "30/11/2023",
        "Text": " New CCN video out now: \n\nNo Palestinians in Gaza | An Israeli Dream? | Critical Content \n\nPresented by \n@MusaAdnan",
        "Weight": 20,
        "Id": 776
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "30/11/2023",
        "Text": "These are some things that has been invented by Palestinians from raw materials, if they are not serious inventions I don't want to hear the IDF complain ever complain about their effect.",
        "Weight": 8,
        "Id": 777
    },
    {
        "URL": "https://x.com/HATzortzis/status/1729729572080406700",
        "Date": "29/11/2023",
        "Text": "New free book by \n@SapienceOrg\n,\n\n\"The Double Standard: Media Reactions to Zionist Terror\" written by \n@mohammed_hijab\n and Jody McIntyre:\n https://sapienceinstitute.org/the-double-standard-media-reactions-to-zionist-terror/…",
        "Weight": 10,
        "Id": 782
    },
    {
        "URL": "https://x.com/hzomlot/status/1729847459529015621",
        "Date": "29/11/2023",
        "Text": "Unarmed and running away. But Israeli soldiers still killed this child in #Jenin today in the same indiscriminate manner that they have been killing thousands of children in #Gaza.",
        "Weight": 12,
        "Id": 783
    },
    {
        "URL": "https://x.com/aaronjmate/status/1729619919292060016",
        "Date": "28/11/2023",
        "Text": ".\n@DrGaborMate\n to \n@piersmorgan\n on Israel's \"right to defend itself\":",
        "Weight": 4,
        "Id": 784
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1729610266881454140",
        "Date": "28/11/2023",
        "Text": "Our new book on Zionist terrorism is out and is FREE.",
        "Weight": 5,
        "Id": 788
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1729558878688325966",
        "Date": "28/11/2023",
        "Text": "In almost 2 years of war , Russia has killer 9614 civilians in Ukraine. The most conservative combatant deaths of Ukrainian soldiers in the same period is 70,000 according to the Voice of Ukraine. About 14 percent of the non-combatants died of the combatants, compare with Israel",
        "Weight": 4,
        "Id": 789
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1729478252140401088",
        "Date": "28/11/2023",
        "Text": "There are great similarities between Nazi Nuremberg Race Laws and Israeli Apartheid laws.",
        "Weight": 10,
        "Id": 790
    },
    {
        "URL": "https://x.com/utica_masjid/status/1728617399539110115",
        "Date": "26/11/2023",
        "Text": "Check out the latest podcast with @imamtomfacchine & \n@mohammed_hijab\n \n\n#Palestine \n\nhttps://youtu.be/QCpzO74zyWU?si=kn2TXlI9uMEAU885…",
        "Weight": 4,
        "Id": 791
    },
    {
        "URL": "https://x.com/mohammed_hijab/status/1728792309859332337",
        "Date": "26/11/2023",
        "Text": "A Historical Question: \n\nHow commonly was Hitler referred to as a terrorist by the Western Media?",
        "Weight": 6,
        "Id": 794
    },
    {
        "URL": "https://x.com/piersmorgan/status/495963860479012865",
        "Date": "03/08/2014",
        "Text": "At what point does Israel's current military strategy become the very terrorism it professes to be fighting? #gaza #schools",
        "Weight": 8,
        "Id": 795
    },
    {
        "URL": "https://x.com/mohammed_hijab",
        "Date": "25/11/2023",
        "Text": "Didn't call you a Zionist. I welcome your comments, especially the last one wherein you question Israel in engaging in terrorism. The argument people make  is that you changed your views because of FEAR of your boss Rupert Murdoch.",
        "Weight": 9,
        "Id": 797
    }
]