[
    {
        "URL": "https://x.com/NYplaid/status/1872512577789731032",
        "Date": "27/12/2024",
        "Text": "“Urgent: The occupation army besieges Kamal Adwan Hospital in Beit Lahia Project\nDr. Hussam Abu Safia and the medical staff are demanding to go down to the hospital yard in preparation for storming it.”",
        "Weight": 5,
        "Id": 0
    },
    {
        "URL": "https://x.com/NYplaid/status/1872305123868725451",
        "Date": "26/12/2024",
        "Text": "Most humanitarian aid initiatives in Gaza are about maintaining influence. As promised, we will expose the major Palestinian influences involved in these initiatives to end the weaponization of iNGOs for military intelligence gains. We start with \n@mohammad_dahlan\n   and UAEAid:",
        "Weight": 8,
        "Id": 6
    },
    {
        "URL": "https://x.com/NYplaid/status/1872284859894513806",
        "Date": "26/12/2024",
        "Text": "Where is \n@MSF\n and MSF_USA who we called out as guilty in the #GazaMedicalCoup on July 3rd 2024?\n\nThe silence is deafening! Shame!",
        "Weight": 4,
        "Id": 7
    },
    {
        "URL": "https://x.com/NYplaid/status/1872260887878549812",
        "Date": "26/12/2024",
        "Text": "“Patience is only at the first shock.\n\nMay God comfort people and strengthen their hearts.\n\n4 citizens were killed and others were injured, most of them children, as a result of the occupation aircraft bombing a family home” https://x.com/AnasAlSharif0//AnasAlSharif0/status/1872260459304476819…",
        "Weight": 5,
        "Id": 8
    },
    {
        "URL": "https://x.com/NYplaid/status/1872144635537289652",
        "Date": "26/12/2024",
        "Text": "They will kill us abroad next. Take my life instead of my brothers and sisters in Gaza. You know where I am. You want to kill more Palestinian journalist, come kill us all. 1,000 will come in our place. I was compelled to write again, because they keep killing us with impunity!",
        "Weight": 8,
        "Id": 9
    },
    {
        "URL": "https://x.com/NYplaid/status/1872141418141213146",
        "Date": "26/12/2024",
        "Text": "American democracy working hard to starve Palestinians as part of their #WeaponizedHunger strategy. \n\nBrought to you by the good guys \n@CENTCOM\n responsible for all the children experiencing these conditions planned by USAID and swept under the rug by PentagonPresSec & StateDept:",
        "Weight": 8,
        "Id": 10
    },
    {
        "URL": "https://x.com/NYplaid/status/1872096024829067498",
        "Date": "26/12/2024",
        "Text": "Where is the coverage from \n@pressfreedom\n or are they off for the holidays while the Holocaust continues?",
        "Weight": 3,
        "Id": 12
    },
    {
        "URL": "https://x.com/NYplaid/status/1872095086991008033",
        "Date": "26/12/2024",
        "Text": "The “Palestinian Authority” z i o n i s t propaganda forces:",
        "Weight": 4,
        "Id": 15
    },
    {
        "URL": "https://x.com/MENAUncensored/status/1871937360033989115",
        "Date": "25/12/2024",
        "Text": "The \"israeli occupation forces have forcibly displaced Christian couple Abu Asaad and his wife from their home!\nThey are celebrating Christmas in their tent in Al Mawasi area!\"\nVia our Colleague in North Gaza \n@AbujomaaGaza",
        "Weight": 21,
        "Id": 20
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1871758932852756955",
        "Date": "25/12/2024",
        "Text": "Woman has been KILLED and 8 other people have been WOUNDED in #Israeli_bombing of a house in Al Nuseirat refugee camp!",
        "Weight": 8,
        "Id": 21
    },
    {
        "URL": "https://x.com/NYplaid/status/1871709677291250017",
        "Date": "25/12/2024",
        "Text": "The #Christmas gift from \n@StateDept\n to all Palestinians in occupied Palestine and abroad. We will never forget that American diplomats committed a Holocaust for 15 months straight: https://x.com/shameensuleman/shameensuleman/status/1871708309864264047…",
        "Weight": 15,
        "Id": 23
    },
    {
        "URL": "https://x.com/NYplaid/status/1871708583815217213",
        "Date": "25/12/2024",
        "Text": "Where is \n@KingAbdullahII\n with his Gaza Health Initiative? The biggest fraud & gas lighting campaign, allowing the occupation to decimate all hospitals in Gaza, is run by the King of Jordan & all the iNGOs/institutions working alongside this initiative:\n\n#SaveKamalAdwanHospital",
        "Weight": 13,
        "Id": 25
    },
    {
        "URL": "https://x.com/NYplaid/status/1871633964508823842",
        "Date": "24/12/2024",
        "Text": "Where is \n@KingAbdullahII\n and his Gaza Health Iniative? How does the world view this iniative, which has failed all Palestinians in Gaza occupied Palestine? Where are these iNGOs? They are all involved in the ongoing #GazaMedicalCoup in varying degrees. Who will be break silence?",
        "Weight": 24,
        "Id": 28
    },
    {
        "URL": "https://x.com/NYplaid/status/1871414308229534091",
        "Date": "24/12/2024",
        "Text": "The only honorable “Palestinian Authority” security forces are those that refuse to participate in killing and betraying their own brothers and sisters in Jenin, and other resistance factions. Guess who is upset about this?",
        "Weight": 4,
        "Id": 30
    },
    {
        "URL": "https://x.com/NYplaid/status/1871412355416146163",
        "Date": "24/12/2024",
        "Text": "There have been multiple evacuations of WFP's operational centers, including from Deir al-Balah, due to “israeli” military orders. After evacuation orders on August 25, 2024, WFP had to relocate its main operating hub in Deir al-Balah for the third time…",
        "Weight": 8,
        "Id": 32
    },
    {
        "URL": "https://x.com/NYplaid/status/1871412366732353789",
        "Date": "24/12/2024",
        "Text": "Perhaps the intelligence ring operating out of this facilities, will evacuate yet again, in the near future. This is the latest development in a string of international “non-government” organizations (iNGOs) used for military intelligence operations in Gaza, occupied Palestine.",
        "Weight": 8,
        "Id": 33
    },
    {
        "URL": "https://x.com/omarsuleiman/status/1871351904397414484",
        "Date": "24/12/2024",
        "Text": "Refaat Alareer's mother, Umm Hani, reads his poem \"If I Must Die\". Alareer was murdered by Israeli airstrikes alongside his brother, his sister, and her four children. 4 months later, his wife, children, and grandson were murdered.",
        "Weight": 8,
        "Id": 35
    },
    {
        "URL": "https://x.com/AbubakerAbedW/status/1871312536693620877",
        "Date": "23/12/2024",
        "Text": "Kamal Adwan Hospital is under Israeli attacks. Israel will bomb and decimate the facility, so the 91 patients trapped inside die.\n\nNo words from medical organisations in Europe, specifically the U.S. and the UK.",
        "Weight": 12,
        "Id": 42
    },
    {
        "URL": "https://x.com/NYplaid/status/1857982765645328589",
        "Date": "17/11/2024",
        "Text": "This is a great question….we started that campaign to showcase the hypocrisy of \n@KingAbdullahII\n …here we are again, months later, another famine, and the Jordanian British ruler has shown his colors. He has left our people to starve to death again #AirDropAidForGaza",
        "Weight": 4,
        "Id": 56
    },
    {
        "URL": "https://x.com/NYplaid/status/1857976691647213681",
        "Date": "17/11/2024",
        "Text": "I said it several times. The extremist Jewish settlers got me suspended with their friends.",
        "Weight": 4,
        "Id": 60
    },
    {
        "URL": "https://x.com/NYplaid/status/1857963207211598241",
        "Date": "17/11/2024",
        "Text": "Yes, the \n@UN\n is officially openly part of the i s r a e l i----------terrorist organized crimes against humanity syndicate. Behind the scenes they have been for well over 76 years…oh wait…how old is the UN…",
        "Weight": 7,
        "Id": 61
    },
    {
        "URL": "https://x.com/NYplaid/status/1857961465392546266",
        "Date": "17/11/2024",
        "Text": "The captions on 𝕏 are amazing. I think it captured everything the z i o n i s t terrorist said perfectly….",
        "Weight": 5,
        "Id": 63
    },
    {
        "URL": "https://x.com/NYplaid/status/1857950873063678351",
        "Date": "17/11/2024",
        "Text": "Convenient Mrose the terrorist and her friend Noobz got me suspended the same day as this post…now she’s hosting a space playing victim card like a good “israel” z i o n i s t symp",
        "Weight": 9,
        "Id": 65
    },
    {
        "URL": "https://x.com/NYplaid/status/1857943623385624718",
        "Date": "17/11/2024",
        "Text": "Mrose and Noob met in real life. She will lie about this.\n\nOlive is an “israeli” \n\nHal is married to a pharisee (פָּרוּד)",
        "Weight": 8,
        "Id": 66
    },
    {
        "URL": "https://x.com/NYplaid/status/1857948236549411035",
        "Date": "17/11/2024",
        "Text": "What’s someone who is friends with a terrorist collecting Palestinian identification for? Interesting she only mentions these little piece of info in tiny spaces where she feels like she’s not being monitored.",
        "Weight": 9,
        "Id": 67
    },
    {
        "URL": "https://x.com/NYplaid/status/1857948954933014922",
        "Date": "17/11/2024",
        "Text": "I’ve been receiving calls and updates from the “israeli” terrorist support group space. Someone has called me telling me the terrorist symp is crying now? Ultimate victim card. Someone grab a bottle a catch those tears for me!",
        "Weight": 18,
        "Id": 68
    },
    {
        "URL": "https://x.com/NYplaid/status/1857945675062808933",
        "Date": "17/11/2024",
        "Text": "If someone has guts to ask the terrorist “israeli” symp about her friends initiative…waiting for those receipts…",
        "Weight": 13,
        "Id": 69
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1857940357188604038",
        "Date": "17/11/2024",
        "Text": "An israeli soldier sets Rafah’s greenhouses in Gaza on fire, for a photo; is it only a war crime if it’s King Charles \n@RoyalFamily\n Cotswold greenhouses?",
        "Weight": 19,
        "Id": 70
    },
    {
        "URL": "https://x.com/NYplaid/status/1857942240808808803",
        "Date": "17/11/2024",
        "Text": "Ok terrorist:",
        "Weight": 5,
        "Id": 71
    },
    {
        "URL": "https://x.com/iNessrineN/status/1857927857713840434",
        "Date": "16/11/2024",
        "Text": "No they are not. They are jut whitewashing Gaza's genocide and trying to save the zionist entity. Read here",
        "Weight": 14,
        "Id": 75
    },
    {
        "URL": "https://x.com/iNessrineN/status/1857902212904570968",
        "Date": "16/11/2024",
        "Text": "She has the purple circle, they call themselves \"standing together\" and we call them \"genocide together\" .. it's a whole groupe of settlers that so many praise here for their \"fight for peace, but really they are just criminals. Pay attention to the  and block them",
        "Weight": 5,
        "Id": 76
    },
    {
        "URL": "https://x.com/NYplaid/status/1857917874817442132",
        "Date": "16/11/2024",
        "Text": "No Muhanad did not use any money for his legal fees. She is a lying dog who befriends z i o n i s t terrorist. If someone records the terrorist speaking I will debunk every lie. Coward terrorist atheist has no ethics.",
        "Weight": 15,
        "Id": 77
    },
    {
        "URL": "https://x.com/LibraHaya/status/1857809149943247000",
        "Date": "16/11/2024",
        "Text": "Well well , look who decided to show their true colors \nAn israeli settler = a criminal , period !\n\nCredits of this masterpiece to \n@NYplaid\n ",
        "Weight": 8,
        "Id": 78
    },
    {
        "URL": "https://x.com/Tseday/status/1332053710189580290",
        "Date": "26/11/2020",
        "Text": "Unelected dictator \n@AbiyAhmedAli\n just signed Ethiopia’s sovereignty over to Mossad.\n\nMany idiots in Ethiopia/Diaspora are cheering for this.\n\nDo you know what this means?!! Everything Ethiopians do will be accessible by the Zionist regime. \n\nMossad fabricates intel & false flags!",
        "Weight": 5,
        "Id": 80
    },
    {
        "URL": "https://x.com/NYplaid/status/1857457642584625221",
        "Date": "15/11/2024",
        "Text": "“ Urgent: The occupation blows up residential buildings west of Jabalia camp, north of Gaza.”",
        "Weight": 9,
        "Id": 85
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1857422171515081205",
        "Date": "15/11/2024",
        "Text": "Seven displaced persons have been KILLED in #Israeli_bombing of their tent in Al Mawasi neighbourhood west of Khan Younis!",
        "Weight": 8,
        "Id": 87
    },
    {
        "URL": "https://x.com/NYplaid/status/1857419350145130848",
        "Date": "15/11/2024",
        "Text": "“ Follow-up | Al-Qassam Brigades: We targeted a Zionist tank of the \"Merkava 4\" type with a \"Shawaz\" explosive device on Dawas Street, west of Jabalia camp, north of the Gaza Strip”",
        "Weight": 9,
        "Id": 89
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1857371235484569687",
        "Date": "15/11/2024",
        "Text": "Three people have been KILLED and 7 others INJURED in #Israeli_bombing of Al Zaytoun neighbourhood of #Gaza_City!",
        "Weight": 12,
        "Id": 93
    },
    {
        "URL": "https://x.com/EyeonPalestine/status/1857345227452813784",
        "Date": "15/11/2024",
        "Text": "A young girl at the start of her life watches the farewell of a martyr. At this age, she is supposed to be playing, having fun, or studying, but in Gaza, everything is different for its children.",
        "Weight": 4,
        "Id": 100
    },
    {
        "URL": "https://x.com/NYplaid/status/1857347696434024878",
        "Date": "15/11/2024",
        "Text": "Press coverage: Prisoner Sheikh Samih Aliwi, who died in the occupation prisons, in a photo with Hamas leader Salah Darwaza, who was assassinated by the occupation in the Al-Aqsa Intifada, during their detention in the nineties",
        "Weight": 14,
        "Id": 101
    },
    {
        "URL": "https://x.com/NYplaid/status/1857347530138309074",
        "Date": "15/11/2024",
        "Text": "Press coverage: Occupation forces set up a checkpoint on Al-Ain Street in Silwan",
        "Weight": 5,
        "Id": 102
    },
    {
        "URL": "https://x.com/EyeonPalestine/status/1857347066004963495",
        "Date": "15/11/2024",
        "Text": "More footage of the Israeli occupations targeting of a residential building in Tayouneh, Beirut’s southern suburb.",
        "Weight": 13,
        "Id": 107
    },
    {
        "URL": "https://x.com/NYplaid/status/1857344852964364464",
        "Date": "15/11/2024",
        "Text": "The best alarm clock for the terrorist child killers, sent from the brave resistance in South Lebanon ",
        "Weight": 5,
        "Id": 109
    },
    {
        "URL": "https://x.com/NYplaid/status/1857343927331774754",
        "Date": "15/11/2024",
        "Text": "Do you wake up sweating, thinking of your brothers and sisters being killed in Palestine? \n\nDo you wake up thinking of them being starved to death?\n\nDo you command your subconscious mind to find ways to cripple the enemies of God, while you sleep?\n\nAre you doing all you can?",
        "Weight": 4,
        "Id": 110
    },
    {
        "URL": "https://x.com/NYplaid/status/1857341950300446750",
        "Date": "15/11/2024",
        "Text": "“Press coverage: Announcing the death of prisoners Samih Aliwi from Nablus and Anwar Aslim from Gaza in the occupation prisons”",
        "Weight": 9,
        "Id": 112
    },
    {
        "URL": "https://x.com/norabf/status/1857285004079853897",
        "Date": "15/11/2024",
        "Text": "International experts on famine and starvation have warned, yet again, that starvation is imminent in northern Gaza. Action is needed “within days” to avert a catastrophe -- my latest news roundup",
        "Weight": 4,
        "Id": 115
    },
    {
        "URL": "https://x.com/NYplaid/status/1857284962619166767",
        "Date": "15/11/2024",
        "Text": "“ Senior Humanitarian Coordinator and Reconstruction Coordinator in Gaza: The situation is catastrophic in the Strip, and the extent of humanitarian needs there cannot be estimated due to security restrictions imposed on humanitarian workers”",
        "Weight": 4,
        "Id": 117
    },
    {
        "URL": "https://x.com/NYplaid/status/1857274953650888741",
        "Date": "15/11/2024",
        "Text": "Finally! #GazaMedicalCoup\n\n“ A global medical campaign by doctors and health cadres to protect the health sector and medical staff in the Gaza Strip”",
        "Weight": 8,
        "Id": 123
    },
    {
        "URL": "https://x.com/NYplaid/status/1857272627099783522",
        "Date": "15/11/2024",
        "Text": "“Its life is longer than the occupation…\nHajja Aisha Abu Sultan, 90 years old, displaced from Jabalia camp to Yarmouk Stadium in Gaza City, tells the harsh stories of displacement and the bitter experience of hunger that is ravaging northern Gaza.”",
        "Weight": 13,
        "Id": 126
    },
    {
        "URL": "https://x.com/NYplaid/status/1857268891795231077",
        "Date": "15/11/2024",
        "Text": "Ya Allah, Turn weapons against those killing our brothers and sisters in Gaza. Protect our brothers and sisters from the ongoing genocide, famine and epidemic.\n\nBless Us, Unite Us, Make us worthy of Your Protection and give us the strength to defeat Your enemies wherever they are",
        "Weight": 9,
        "Id": 128
    },
    {
        "URL": "https://x.com/NYplaid/status/1857268135415500974",
        "Date": "15/11/2024",
        "Text": "Every phone call from pharisee (פָּרוּד) supporters in the senate, reaffirms that these terrorist all support killing children",
        "Weight": 5,
        "Id": 129
    },
    {
        "URL": "https://x.com/NYplaid/status/1857264482155630774",
        "Date": "15/11/2024",
        "Text": "“ (Enemy) media: “israel” declares “war” on foreign activists in the West Bank through arrests, passport confiscation and deportation\n#اسرائيل_سقطت",
        "Weight": 4,
        "Id": 130
    },
    {
        "URL": "https://x.com/decensorednews/status/1857220943497556422",
        "Date": "15/11/2024",
        "Text": " “They've just bombed our neighbourhood... Apocalyptic scenes. A new massacre...”\n\n“Apache warplanes, helicopters, drones...”\n\n“People are being burnt alive and are bleeding till death...”\n\n\n@AbubakerAbedW\n reporting live right now from Gaza as Israel's genocide continues:",
        "Weight": 13,
        "Id": 131
    },
    {
        "URL": "https://x.com/NYplaid/status/1857260269480591600",
        "Date": "15/11/2024",
        "Text": "Meet Mrose the most liberal pharisee terrorist supported by a special group of Palestinians. \n\nThis same group of Palestinians provides safe harbor for an atheist who supports and defends Mrose.\n\nhttps://x.com/NYplaid/status/1856870689875399012/video/1…",
        "Weight": 21,
        "Id": 133
    },
    {
        "URL": "https://x.com/issawiESQ/status/1856873170411655341",
        "Date": "14/11/2024",
        "Text": "She portrays herself as a “good jew,” one who stands up for Palestinian rights, while also being squatter, occupier, and invader. \n\nThis thief will never hold greater rights to our grandfathers land than us.\n\nIf she was a “good jew,” she would self deport herself back to Europe.",
        "Weight": 8,
        "Id": 134
    },
    {
        "URL": "https://x.com/NYplaid/status/1857257448819638740",
        "Date": "15/11/2024",
        "Text": "Let’s go! Keep exposing the NGOs which are used for spying, surveillance, intelligence among other espionage related activities! i s r a e l i----------terrorist have no place in Africa! The rulers of flags above are pharisee (פָּרוּד) pillaging and plundering",
        "Weight": 5,
        "Id": 135
    },
    {
        "URL": "https://x.com/NYplaid/status/1857246717340528958",
        "Date": "15/11/2024",
        "Text": "Ya Allah, please Protect our brothers and sisters in Gaza. The soulless rulers in Egypt and Jordan have abandoned our brothers and sisters in Gaza. Replace the tyrant \n@KingAbdullahII\n and \n@AlsisiOfficial\n and bring forth a true leader to confront Your enemies that besiege us!",
        "Weight": 8,
        "Id": 136
    },
    {
        "URL": "https://x.com/NYplaid/status/1857245703795298628",
        "Date": "15/11/2024",
        "Text": "\n\n“ Watch..\nClashes broke out with the occupation forces as they passed in front of An-Najah University in the city of Nablus, north of the occupied West Bank, a short while ago.”",
        "Weight": 5,
        "Id": 138
    },
    {
        "URL": "https://x.com/NYplaid/status/1857232948082114787",
        "Date": "15/11/2024",
        "Text": "These organizations are core to the ongoing Holocaust. 404 days before the terrorist \n@UN\n comes out with a statement as such, and they will not mobilize their military wing to stop the terrorist in \n@StateDept\n from arming the terrorist “jews” who kill our children daily w impunity",
        "Weight": 22,
        "Id": 143
    },
    {
        "URL": "https://x.com/NYplaid/status/1857232134777274836",
        "Date": "15/11/2024",
        "Text": "\n\n“ A martyr and injuries in the occupation air force bombing of a residential apartment near the Technical College in Deir al-Balah in the central Gaza Strip”",
        "Weight": 9,
        "Id": 144
    },
    {
        "URL": "https://x.com/NYplaid/status/1857229874500444206",
        "Date": "15/11/2024",
        "Text": "Let me say it the way it needs to be said \n@AlsisiOfficial\n is a low life z i o n i s t terrorist child killer and any Egyptian supporting this terrorist pharisee (פָּרוּד) lover can take the expressway to hell especially his generals & all the scum who align with Dahlan",
        "Weight": 10,
        "Id": 146
    },
    {
        "URL": "https://x.com/NYplaid/status/1857228931511775499",
        "Date": "15/11/2024",
        "Text": "“Press coverage: Two martyrs and injuries in the occupation air force bombing of a residential apartment near the Technical College in Deir al-Balah in the central Gaza Strip”",
        "Weight": 9,
        "Id": 148
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1857221562308468816",
        "Date": "15/11/2024",
        "Text": "From \n@SuppressedNws\n masked & hooded & backward: genocidal israelis prove their vileness by attacking French supporters at the Stade de France",
        "Weight": 11,
        "Id": 150
    },
    {
        "URL": "https://x.com/NYplaid/status/1857225908488175677",
        "Date": "15/11/2024",
        "Text": "Are they aware of MSF’s role in #GazaMedicalCoup?",
        "Weight": 4,
        "Id": 151
    },
    {
        "URL": "https://x.com/HossamShabat/status/1857224682782785600",
        "Date": "15/11/2024",
        "Text": "Palestinian mother from northern Gaza: \n\n“We will not leave Gaza; we stand in defiance,we will rebuild and return to our home,  Gaza is where our hearts belong.",
        "Weight": 16,
        "Id": 154
    },
    {
        "URL": "https://x.com/NYplaid/status/1857205278871052526",
        "Date": "14/11/2024",
        "Text": "If you haven’t listened to the Palestinian liberal zionist’s favorite z i o n i s t terrorist liberal pharisee (פָּרוּד)…now is your chance.\n\nListen carefully to her tone. Casual, calm, collected, without a flinch…leave a comment with her exact words about “flattening  Gaza” https://x.com/NYplaid/status/NYplaid/status/1856870689875399012…",
        "Weight": 18,
        "Id": 156
    },
    {
        "URL": "https://x.com/NYplaid/status/1857199360209244433",
        "Date": "14/11/2024",
        "Text": "Every NGO in Gaza is working and coordinating with the “israeli” entity. The \n@WFP\n has already started assuming the role of UNRWA in Gaza. All international NGOs routing $ into Gaza are working with israeli-terrorist!  #FlourMassacre \nEvidence:  https://x.com/EuroMedHR/status/1857101572435485144…",
        "Weight": 33,
        "Id": 159
    },
    {
        "URL": "https://x.com/MenchOsint/status/1857187730230567022",
        "Date": "14/11/2024",
        "Text": " Hezbollah carried out 32 operations today, targeting israeli forces at the border & other bases, settlements | Thursday 14 November 2024\n\n*The party announced a few minutes ago the first operation (# 32) targeting Israeli forces inside the \"ground maneuver's expansion area\"",
        "Weight": 19,
        "Id": 160
    },
    {
        "URL": "https://x.com/Leila1H/status/1857187846001414224",
        "Date": "14/11/2024",
        "Text": "the US State Department says it has not observed forced displacement in Gaza that would amount to a war crime \n------------------\ninsert all the swear words you can think of...",
        "Weight": 9,
        "Id": 161
    },
    {
        "URL": "https://x.com/ytirawi/status/1857179223389311449",
        "Date": "14/11/2024",
        "Text": "Events in Gaza today:\n\nIn Beit Lahia, Israeli military fired a shell on two children (12 & 16 yo) bringing water near khadoura junction in the town. Both were instantly killed\n\nWhile another attack on the town targeted Msalem family and killed 3, incl a mother & her child ->",
        "Weight": 12,
        "Id": 162
    },
    {
        "URL": "https://x.com/ytirawi/status/1857180247063400896",
        "Date": "14/11/2024",
        "Text": "In Beit Lahia again, an Israeli attack on a group of residents filling water near Hijazi building killed also 3 including a child. \n\nIn Burej RC, an Israeli airstrike bombed a displaced tent killing 4 incl a child\n\nAn attack on a school in north Gaza city killed 4 incl a child",
        "Weight": 20,
        "Id": 163
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1857125794130145790",
        "Date": "14/11/2024",
        "Text": "Palestinian parents mourn their daughter, killed by the israelis in an air strike targeting an emergency tent in Bureij refugee camp in central Gaza",
        "Weight": 19,
        "Id": 164
    },
    {
        "URL": "https://x.com/MenchOsint/status/1857120350200385565",
        "Date": "14/11/2024",
        "Text": " At least one of the Drones launched by Hezbollah impacted the \"Eliakim Military Training Camp\"\n\nWaiting for Hezbollah confirmation but looks like it to me. Thoughts ?\n\n(32.6299804, 35.0596089)",
        "Weight": 6,
        "Id": 168
    },
    {
        "URL": "https://x.com/NYplaid/status/1857120900354584880",
        "Date": "14/11/2024",
        "Text": "pharisee (פָּרוּד) settler from West Chester plotting to besiege speech online further occupying Palestinians including their speech globally. This is the fascist Orwellian State of Netanyahu‘s wet dream:",
        "Weight": 8,
        "Id": 171
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1856913923288563966",
        "Date": "14/11/2024",
        "Text": "How Trump Will Escalate Israel’s Genocide Against Palestinians https://thered.stream/how-trump-may-escalate-israels-genocide-against-palestinians/… via \n@redstreamnet",
        "Weight": 34,
        "Id": 173
    },
    {
        "URL": "https://x.com/prem_thakker/status/1856795827253252218",
        "Date": "13/11/2024",
        "Text": "95 orgs urge Sens. Schumer & Gillibrand to support resolutions to block arms sales to Israel.\n\nSigners include: Doctors Against Genocide; NY Council of Churches; Jewish Voice for Peace (Albany, Westchester, and Buffalo); more.\n\nSanders, Welch, Schatz, Merkley leading resolutions.",
        "Weight": 13,
        "Id": 178
    },
    {
        "URL": "https://x.com/NYplaid/status/1856901162307289388",
        "Date": "14/11/2024",
        "Text": "Does anyone know why a liberal Z i o n i s t is collecting Palestinian IDs to verify Palestinians on the ground? Why is a foreigner collecting IDs at all? Why are Palestinians trusting foreigners with private information? Who else is she sharing this information with?",
        "Weight": 20,
        "Id": 180
    },
    {
        "URL": "https://x.com/NYplaid/status/1856896347514818579",
        "Date": "14/11/2024",
        "Text": "Did anyone arrest this terrorist child killer?",
        "Weight": 5,
        "Id": 181
    },
    {
        "URL": "https://x.com/Leila1H/status/1856890786882678852",
        "Date": "14/11/2024",
        "Text": "غارة ارهابية صهيونية اعنف من اللي سبقتها... بنايتنا رجّت معها.. شكلها عمنطقة الحدث\n\nanother extremely violent terrorist iOf airstrike.. closer to our side this time. our building felt the shockwave.. seems against alhadath area",
        "Weight": 5,
        "Id": 182
    },
    {
        "URL": "https://x.com/NYplaid/status/1856889635034579432",
        "Date": "14/11/2024",
        "Text": "Terrorist in Belgium, someone arrest him!",
        "Weight": 5,
        "Id": 184
    },
    {
        "URL": "https://x.com/NYplaid/status/1856878210941964507",
        "Date": "14/11/2024",
        "Text": "As I wrap up my investigation into the liberal terrorist symp group, and the crypto cronies, I leave you with a message from two of the star actors, an atheist, and the who got away with marrying a pharisee (פָּרוּד):",
        "Weight": 5,
        "Id": 185
    },
    {
        "URL": "https://x.com/NYplaid/status/1856872605464302049",
        "Date": "14/11/2024",
        "Text": "It would be the biggest sign of betrayal to throw this fucker Biden in the slammer for crimes against humanity for the end of his life",
        "Weight": 2,
        "Id": 187
    },
    {
        "URL": "https://x.com/NYplaid/status/1856866460502823244",
        "Date": "14/11/2024",
        "Text": "Press coverage: Occupation forces targeted with an explosive device during the storming of the town of Tamoun, south of Tubas\n\nNote: LONG LIVE PALESTINE! VICTORY TO THE RESISTANCE!",
        "Weight": 9,
        "Id": 189
    },
    {
        "URL": "https://x.com/NYplaid/status/1856862683162869948",
        "Date": "14/11/2024",
        "Text": "“Department of Killing Children”:\n\nLet’s bomb Gaza and starve some more children…",
        "Weight": 4,
        "Id": 191
    },
    {
        "URL": "https://x.com/cheriblossom__/status/1856841143733907713",
        "Date": "13/11/2024",
        "Text": "Kids are still being killed in Jabalia stop treating it like it’s just empty buildings being destroyed \n\nAmira Walid and her sister Eileen Walid were killed in an occupation bombing in Jabalia refugee camp.",
        "Weight": 5,
        "Id": 194
    },
    {
        "URL": "https://x.com/HossamShabat/status/1856833445042737509",
        "Date": "13/11/2024",
        "Text": "The never-ending targeting of kids in Gaza continues. These children were sleeping when they were bombed just a short while ago in Gaza City.",
        "Weight": 8,
        "Id": 195
    },
    {
        "URL": "https://x.com/NYplaid/status/1856858971539382753",
        "Date": "14/11/2024",
        "Text": "Except Palestinians* \n\nHolocaust Holocaust Holocaust",
        "Weight": 17,
        "Id": 198
    },
    {
        "URL": "https://x.com/NYplaid/status/1856858781558476815",
        "Date": "14/11/2024",
        "Text": "This is more believable than anyone speaking at the podium \n@StateDept\n regarding aid in Gaza for the past 400+ days…get this guy a job at the StateDept…he’s more believable than the clowns they put up #StarvedByTheStateDept",
        "Weight": 4,
        "Id": 199
    },
    {
        "URL": "https://x.com/GozukaraFurkan/status/1856694290757337159",
        "Date": "13/11/2024",
        "Text": "This is the Amsterdam citizen that all the Zionists tried to dox, listen to learn truths",
        "Weight": 10,
        "Id": 207
    },
    {
        "URL": "https://x.com/QudsNen/status/1856825249662148872",
        "Date": "13/11/2024",
        "Text": "The young girl Mira Khreis, the daughter of photojournalist Mohammed Khreis, has succumbed to the injuries she sustained after an Israeli airstrike targeted their tent in the al-Nusairate refugee camp in central Gaza, killing her parents.",
        "Weight": 12,
        "Id": 210
    },
    {
        "URL": "https://x.com/MenchOsint/status/1856672187479921073",
        "Date": "13/11/2024",
        "Text": "Erdogan is very malicious.\n\nHe claims to have cut trade with Israel, but here are some live tracking of ships from Turkey, faking their destination on the AIS system but heading to Israeli ports.",
        "Weight": 12,
        "Id": 213
    },
    {
        "URL": "https://x.com/NYplaid/status/1856820858167464332",
        "Date": "13/11/2024",
        "Text": "Terrorist child killers below. When you think of the people working in USAID make sure you picture the children they starve to death daily.",
        "Weight": 5,
        "Id": 216
    },
    {
        "URL": "https://x.com/NYplaid/status/1856820050759749944",
        "Date": "13/11/2024",
        "Text": "“The occupation artillery targets Jabalia camp, north of Gaza.”\n\nNote: not only are the terrorist \n@CENTCOM\n BOMBING DAILY, but they continue to starve our brothers and sisters in Gaza",
        "Weight": 18,
        "Id": 217
    },
    {
        "URL": "https://x.com/NYplaid/status/1856815409368076306",
        "Date": "13/11/2024",
        "Text": "“Daily scene..\nFarewell to the martyrs who were killed in the occupation's bombing of the central Gaza Strip”",
        "Weight": 9,
        "Id": 222
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1856812999782105466",
        "Date": "13/11/2024",
        "Text": "Five to 9 year-old Palestinian children make up the majority of the israeli regime’s victims: yes, a genocide – the most evil in the history of the world",
        "Weight": 17,
        "Id": 223
    },
    {
        "URL": "https://x.com/NYplaid/status/1856814204822724694",
        "Date": "13/11/2024",
        "Text": "i s r a e l i----------terrorist supplied by \n@StateDept_GCJ\n specialist in killing kids",
        "Weight": 5,
        "Id": 225
    },
    {
        "URL": "https://x.com/NYplaid/status/1856813569607905577",
        "Date": "13/11/2024",
        "Text": "Terrorist child killers abroad",
        "Weight": 5,
        "Id": 226
    },
    {
        "URL": "https://x.com/cheriblossom__/status/1856805527373668563",
        "Date": "13/11/2024",
        "Text": "In just 48 hours, the occupation army announced the death of 11 Israeli officers and soldiers and the injury of more than 10 others in the battles of Gaza and Lebanon.",
        "Weight": 17,
        "Id": 227
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1856801053947432964",
        "Date": "13/11/2024",
        "Text": "The israelis commit 7 massacres in Gaza in just 24 hours, killing multiple families — 47 adults & children: round-the-clock-israeli-slaughter-house",
        "Weight": 23,
        "Id": 228
    },
    {
        "URL": "https://x.com/Intel_Sky/status/1856802641323372593",
        "Date": "13/11/2024",
        "Text": "Hezbollah Crushes Symbol of IDF’s Elite Golani Brigade Underfoot.",
        "Weight": 3,
        "Id": 229
    },
    {
        "URL": "https://x.com/NYplaid/status/1856782454884802735",
        "Date": "13/11/2024",
        "Text": "terrorist child killers below",
        "Weight": 5,
        "Id": 230
    },
    {
        "URL": "https://x.com/NYplaid/status/1856753485376885068",
        "Date": "13/11/2024",
        "Text": "“Press coverage: Widespread deployment of occupation forces west of Ramallah after two soldiers were injured in a run-over attack.”",
        "Weight": 5,
        "Id": 234
    },
    {
        "URL": "https://x.com/NYplaid/status/1856740560511406521",
        "Date": "13/11/2024",
        "Text": "“Urgent | The occupation forces are sending additional reinforcements to the Jarad Estate in Tulkarm, after discovering the infiltration of an “israeli” special force and the outbreak of an armed clash with the resistance.”",
        "Weight": 13,
        "Id": 238
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1856713186713415763",
        "Date": "13/11/2024",
        "Text": "Don’t forget #Gaza.. 14 months",
        "Weight": 4,
        "Id": 243
    },
    {
        "URL": "https://x.com/NYplaid/status/1856713503362445821",
        "Date": "13/11/2024",
        "Text": "All the below have direct relations, even if they deny it. Top offenders and enablers in the holocaust: \ni s r a e l i----------terrorist",
        "Weight": 8,
        "Id": 244
    },
    {
        "URL": "https://x.com/annepal99/status/1856636406451331546",
        "Date": "13/11/2024",
        "Text": "For Israelis claiming, it’s Propaganda, palywood, I got you a better version showing your soldiers and military vehicles while pointing laser on journalists! \nAnd they killed 188 journalists in Gaza, before that they killed Shireen Abu Akleh, it’s not sth they won’t do!!",
        "Weight": 15,
        "Id": 245
    },
    {
        "URL": "https://x.com/ayshaahmeds/status/1856585546111373706",
        "Date": "13/11/2024",
        "Text": "Israeli forces destroyed the aid which was supposed to feed Palestinians who are starving",
        "Weight": 16,
        "Id": 246
    },
    {
        "URL": "https://x.com/NYplaid/status/1856585272290328625",
        "Date": "13/11/2024",
        "Text": "Terrorist child killer: \n@EliseStefanik",
        "Weight": 5,
        "Id": 249
    },
    {
        "URL": "https://x.com/NYplaid/status/1856584906916204592",
        "Date": "13/11/2024",
        "Text": "Urgent | Quds Network correspondent: Two martyrs in the occupation's bombing of a gathering of residents in the Shuja'iyya neighborhood east of Gaza City.",
        "Weight": 9,
        "Id": 250
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1856342226097295599",
        "Date": "12/11/2024",
        "Text": "The israelis & America are trying to install a new president of Lebanon, hoping to eliminate the military presence in the south, but it won’t work",
        "Weight": 11,
        "Id": 252
    },
    {
        "URL": "https://x.com/palithreads/status/1856107183068324098",
        "Date": "11/11/2024",
        "Text": "A thread on Canada’s unspoken genocide in Somalia ",
        "Weight": 5,
        "Id": 254
    },
    {
        "URL": "https://x.com/annepal99/status/1856438322777804856",
        "Date": "12/11/2024",
        "Text": "Palestinian journalists LAUGHED OFF the incident where an Israeli sniper aimed a laser sight at him.\n\nHe was covering the execution of a young Palestinian man at Deir Sharaf checkpoint near Nablus today,saying; \n\n“You’ll be able to add to your CV that you can work under pressure”",
        "Weight": 16,
        "Id": 255
    },
    {
        "URL": "https://x.com/NYplaid/status/1856580737945813223",
        "Date": "13/11/2024",
        "Text": "“Urgent | The occupation artillery targets the Nassar junction in Jabalia camp, north of the Gaza Strip.”",
        "Weight": 9,
        "Id": 259
    },
    {
        "URL": "https://x.com/NYplaid/status/1856579027458285826",
        "Date": "13/11/2024",
        "Text": "Another man who claims to fear God but cannot utter a word for Gaza being starved to death for over 6 weeks: \n\n@MElDeweni\n \n\nIs this supposed to be the state of Islam?",
        "Weight": 4,
        "Id": 265
    },
    {
        "URL": "https://x.com/NYplaid/status/1856578747639443747",
        "Date": "13/11/2024",
        "Text": "A man who claims to fear God but cannot utter a word for Gaza being starved to death for over 6 weeks: \n@alimamaltayeb",
        "Weight": 4,
        "Id": 266
    },
    {
        "URL": "https://x.com/NYplaid/status/1856576923444412703",
        "Date": "13/11/2024",
        "Text": "“Local sources: The explosion was caused by the Iron Dome launching a missile into the airspace east of Khan Yunis, south of the Gaza Strip.”\n\nNote: The Resistance continues to bravely fight the enemies of God commanded by the child killers \n@CENTCOM",
        "Weight": 4,
        "Id": 268
    },
    {
        "URL": "https://x.com/NYplaid/status/1856553070416609473",
        "Date": "13/11/2024",
        "Text": "Terrorist child killers:",
        "Weight": 5,
        "Id": 273
    },
    {
        "URL": "https://x.com/NYplaid/status/1856552290934530161",
        "Date": "13/11/2024",
        "Text": "Lovers of pharisee (פָּרוּד) and haters of Islam and Christianity. The UAE is a terrorist entity, the same as “israel”. \n\nGod Willing the entire UAE is swallowed up in one swift Act Of God. We spit on all the Emirates with the exception of some believers, mostly in Kuwait.",
        "Weight": 9,
        "Id": 276
    },
    {
        "URL": "https://x.com/NYplaid/status/1856550337185722536",
        "Date": "13/11/2024",
        "Text": "Terrorist ai:",
        "Weight": 5,
        "Id": 278
    },
    {
        "URL": "https://x.com/NYplaid/status/1856550221582418382",
        "Date": "13/11/2024",
        "Text": "Terrorist satellite:",
        "Weight": 5,
        "Id": 279
    },
    {
        "URL": "https://x.com/receipts_lol/status/1856543905757462603",
        "Date": "13/11/2024",
        "Text": "A little aid was allowed in the north.\n\nThen Israel bombed the aid, the people the aid was delivered to, and burnt down the school they were sheltering in.\n\nToday, US government spokespeople bragged about this aid.",
        "Weight": 4,
        "Id": 281
    },
    {
        "URL": "https://x.com/NYplaid/status/1856529147398410405",
        "Date": "13/11/2024",
        "Text": "FYI this is live. Thank you \n@Tseday\n for confirming. \n\nNote: Digital ID run by z i o n i s t terrorist, using Ethiopia CIA puppet President to control the Ethiopian population.",
        "Weight": 5,
        "Id": 285
    },
    {
        "URL": "https://x.com/NYplaid/status/1856527716037677200",
        "Date": "13/11/2024",
        "Text": "LONG LIVE PALESTINE, VICTORY TO THE RESISTANCE",
        "Weight": 4,
        "Id": 287
    },
    {
        "URL": "https://x.com/NYplaid/status/1856524909402329202",
        "Date": "13/11/2024",
        "Text": "Little folks here. We wrote about it and spit in Elons face too in:\n\n#GenocideOnAutoPilot",
        "Weight": 5,
        "Id": 290
    },
    {
        "URL": "https://x.com/WarMonitors/status/1856498975995461805",
        "Date": "13/11/2024",
        "Text": "As expected, Trump’s cabinet is as bigoted, as war hungry and as demonically zionist as he is. \n\nWhy can’t the U.S just embrace isolationism. For God’s Sake.",
        "Weight": 5,
        "Id": 300
    },
    {
        "URL": "https://x.com/NYplaid/status/1856497118690656267",
        "Date": "13/11/2024",
        "Text": "“Press coverage: Al-Tuffah Sports Club player Iyad Abu Khater killed as a result of the ongoing occupation bombing of northern Gaza”\n\nSource: \n@qudsn",
        "Weight": 9,
        "Id": 305
    },
    {
        "URL": "https://x.com/NYplaid/status/1856485315944554771",
        "Date": "12/11/2024",
        "Text": "Thank you \n@realDonaldTrump\n you will undoubtedly destroy the United States of America with your current picks in your administration. This is a win for humanity. Rough times ahead, but when the USA collapses, so will the jewish terrorist entity. \n\nGOD IS THE BEST OF PLANNERS!",
        "Weight": 9,
        "Id": 307
    },
    {
        "URL": "https://x.com/NYplaid/status/1856483934265393577",
        "Date": "12/11/2024",
        "Text": "The most powerful terrorist on planet earth…who  openly  starved  children  for  13  months.",
        "Weight": 5,
        "Id": 308
    },
    {
        "URL": "https://x.com/NYplaid/status/1856482531362660765",
        "Date": "12/11/2024",
        "Text": "The United States continues its #WeaponizedHunger strategy with our brothers and sisters in Gaza",
        "Weight": 4,
        "Id": 309
    },
    {
        "URL": "https://x.com/MenchOsint/status/1856480144631710057",
        "Date": "12/11/2024",
        "Text": "Very interesting that's exactly what i imagined.\n\nThe Moroccan Front to Support Palestine also said that the ship \"NYsted Maersk\" left the port of Tangier Med heading to the port of Haifa, after loading three containers with supplies from the US Army in Tangier.\n (\n@palyouthmvmt\n)",
        "Weight": 4,
        "Id": 311
    },
    {
        "URL": "https://x.com/Dr_Muneer1/status/1856317919635865765",
        "Date": "12/11/2024",
        "Text": "في شمال رفح، ارتقى 11 شهيداً، امتزجت دماؤهم بأكياس الطحين، ضحايا عدوان الاحتلال الإسرائيلي.\n\nIn northern Rafah, 11 martyrs lost their lives, their blood mingling with sacks of flour, victims of Israeli occupation aggression.",
        "Weight": 15,
        "Id": 313
    },
    {
        "URL": "https://x.com/NYplaid/status/1856220455868285404",
        "Date": "12/11/2024",
        "Text": "Press coverage: Photos showing the extent of the destruction caused by the occupation air force targeting a house belonging to the Abu Awda family, west of the new camp in Nuseirat, in the central Gaza Strip.",
        "Weight": 9,
        "Id": 315
    },
    {
        "URL": "https://x.com/NYplaid/status/1856216745456898493",
        "Date": "12/11/2024",
        "Text": "In a new massacre committed by the occupation against the displaced in Mawasi Khan Younis.. The effects of the occupation aircraft bombing of a café north of Mawasi Khan Younis, last night, which resulted in the deaths of 11 martyrs.",
        "Weight": 10,
        "Id": 316
    },
    {
        "URL": "https://x.com/NYplaid/status/1856213325090099399",
        "Date": "12/11/2024",
        "Text": "“Channel 13 “israel”: The Political Security (terrorist) Council decided not to allow visits from the Red Cross inside the Gaza Strip\n#الجزيرة”\n\nNote: the Red Cross always betrayed our brothers and sisters in Gaza, working against liberation. Perhaps they said no to spying now?",
        "Weight": 17,
        "Id": 319
    },
    {
        "URL": "https://x.com/NYplaid/status/1856212748763373967",
        "Date": "12/11/2024",
        "Text": "#عاجل | The occupation artillery targets the north of Rafah city.",
        "Weight": 7,
        "Id": 320
    },
    {
        "URL": "https://x.com/NYplaid/status/1856211311543111700",
        "Date": "12/11/2024",
        "Text": "Heavy gunfire and artillery shelling south of Al-Zeitoun neighborhood, around the Dawlah and Al-Masalaba intersections, south of Gaza City.",
        "Weight": 4,
        "Id": 322
    },
    {
        "URL": "https://x.com/ismailalthwabta/status/1856210462649594299",
        "Date": "12/11/2024",
        "Text": "جميع شعوب العالم تدعم الآن القضية الفلسطينية وتهتف ضد جرائم الاحتلال الإسرائيلي.\nAll peoples of the world now support the Palestinian cause and chant against the crimes of the Israeli occupation\n#وللحديث_بقايا",
        "Weight": 19,
        "Id": 323
    },
    {
        "URL": "https://x.com/NYplaid/status/1856207170620002695",
        "Date": "12/11/2024",
        "Text": "“Press coverage: 3 citizens were killed and 5 were injured as a result of the occupation's bombing of the Al-Masakin area in the city of Tyre, southern Lebanon, at dawn today.”",
        "Weight": 5,
        "Id": 324
    },
    {
        "URL": "https://x.com/NYplaid/status/1856206948007325932",
        "Date": "12/11/2024",
        "Text": "“Press coverage | “israeli” Broadcasting Authority: Netanyahu says in closed meetings that \"the issue of annexing the West Bank must return to the forefront with the entry of Trump into office.\"”\n\nNote: Called it months ago…",
        "Weight": 8,
        "Id": 325
    },
    {
        "URL": "https://x.com/NYplaid/status/1856196149671031036",
        "Date": "12/11/2024",
        "Text": "“Rescuing martyrs and injuries in the occupation's bombing of a residential apartment of the Al-Amsi family in the Yarmouk building on Al-Jalaa Street in Gaza City”",
        "Weight": 9,
        "Id": 333
    },
    {
        "URL": "https://x.com/NYplaid/status/1856191749380599936",
        "Date": "12/11/2024",
        "Text": "The “israeli” occupation army is advancing towards the shelters in the city of Beit Hanoun, and is asking them to move south via loudspeakers, and before that it brought in some aid to distract the world with that!",
        "Weight": 13,
        "Id": 334
    },
    {
        "URL": "https://x.com/NYplaid/status/1856182274913370532",
        "Date": "12/11/2024",
        "Text": "Rescuing martyrs and injuries in the occupation's bombing of a residential apartment of the Al-Amsi family in the Yarmouk building on Al-Jalaa Street in Gaza City",
        "Weight": 9,
        "Id": 337
    },
    {
        "URL": "https://x.com/NYplaid/status/1856180383378813350",
        "Date": "12/11/2024",
        "Text": "Oh Muslims, where is the beacon of Islamic Civilization? What happened to \n@AlAzhar\n? Where have the Muslims gone? What will they say about our brothers and sisters in Gaza who have been butchered because their brothers in Egypt have become limp?",
        "Weight": 4,
        "Id": 338
    },
    {
        "URL": "https://x.com/VerraciousWolf/status/1855245731444998609",
        "Date": "09/11/2024",
        "Text": "320 PRO ISRAEL LAWYERS BACKED BY AIPAC (AMERICAN ISRAEL PUBLIC AFFAIRS COMMITTEE) ELECTED IN OFFICE",
        "Weight": 8,
        "Id": 341
    },
    {
        "URL": "https://x.com/NYplaid/status/1856172423806140485",
        "Date": "12/11/2024",
        "Text": "Al Arabiya TV correspondent: The number of martyrs rose to 3 as a result of an “israeli” bombing that targeted a residential apartment on Al Jalaa Street in the center of Gaza City\n\nNote: where is the beacon of the Islamic world \n@AlAzhar\n?",
        "Weight": 12,
        "Id": 342
    },
    {
        "URL": "https://x.com/NYplaid/status/1856171457921126535",
        "Date": "12/11/2024",
        "Text": "l Arabiya TV correspondent: Wounded as a result of the occupation bombing of a house in the Nuseirat camp in the central Gaza Strip",
        "Weight": 9,
        "Id": 344
    },
    {
        "URL": "https://x.com/NYplaid/status/1856168584801644670",
        "Date": "12/11/2024",
        "Text": "I will continue to add the death toll to the  highest ranking Islamic institution in the world: \n@AlAzhar\n \n\nThey have failed Gaza, and the world for 13 months straight. Are you not responsible for leading by example? Where are the Muslims of AlAzhar? How are you applying our laws?",
        "Weight": 4,
        "Id": 346
    },
    {
        "URL": "https://x.com/NYplaid/status/1856164705187791030",
        "Date": "12/11/2024",
        "Text": "I call on \n@AlAzhar\n where are the Muslims in your nation? Do they exist? What do you teach your students after 13 months of Holocaust? Have you forgotten to Fear Allah, and the loss of His Love? What will you and the Muslims of Egypt say on the day of Reckoning? Practice now…",
        "Weight": 3,
        "Id": 349
    },
    {
        "URL": "https://x.com/NYplaid/status/1856160331594158430",
        "Date": "12/11/2024",
        "Text": " Urgent....\nAppeals to retrieve martyrs and injured from under the rubble of homes bombed by the occupation in Beit Hanoun, north of Gaza, as the occupation continues to take ambulances and civil defense crews out of service and target them",
        "Weight": 14,
        "Id": 350
    },
    {
        "URL": "https://x.com/NYplaid/status/1856101091223507112",
        "Date": "11/11/2024",
        "Text": "Terrorist child killers:",
        "Weight": 5,
        "Id": 359
    },
    {
        "URL": "https://x.com/NYplaid/status/1856100497804984540",
        "Date": "11/11/2024",
        "Text": "“People in Gaza are without food while the occupation holds goods and aid at the Kerem Shalom crossing and prevents them from entering the Gaza Strip.”",
        "Weight": 13,
        "Id": 360
    },
    {
        "URL": "https://x.com/decensorednews/status/1856088292338680118",
        "Date": "11/11/2024",
        "Text": "Trump's pick for UN ambassador says US must supply Israel “with what it needs, when it needs it, without conditions,” and that she has “sponsored or backed every measure to aid Israel” that's come before Congress.\n\nCalls  an “outpost of freedom” and “western values”:",
        "Weight": 8,
        "Id": 364
    },
    {
        "URL": "https://x.com/NYplaid/status/1856086835174256773",
        "Date": "11/11/2024",
        "Text": "“Senait, a refugee living in Uganda, was orphaned at a young age and had to drop out of school in the fourth grade to raise her five siblings. At time #TigrayGenocide she sadly lost all her siblings.”",
        "Weight": 5,
        "Id": 366
    },
    {
        "URL": "https://x.com/receipts_lol/status/1856082616811733217",
        "Date": "11/11/2024",
        "Text": "Israel just carried out a massacre in the heart of what the IDF and western journalists call the \"humanitarian safe area\" shortly after the IDF bragged about expanding it.\n\nhttps://x.com/RamAbdu/status/1856070457666965556…",
        "Weight": 4,
        "Id": 367
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1855978352219152720",
        "Date": "11/11/2024",
        "Text": "Footage captures the intense israeli artillery shelling that is currently targeting multiple areas west of Nuseirat refugee camp in central Gaza",
        "Weight": 12,
        "Id": 369
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1856045731447971876",
        "Date": "11/11/2024",
        "Text": "This is how Israeli occupation army’s spokesmen feel when people ask for evidence of their lies!",
        "Weight": 13,
        "Id": 381
    },
    {
        "URL": "https://x.com/NYplaid/status/1856035758164885845",
        "Date": "11/11/2024",
        "Text": "“The occupation army commits a horrific massacre in Akkar, northern Lebanon, against the displaced. More than 30 martyrs so far as a result of the raid.  A large number of ambulances set off from Tripoli centers to Akkar to help transport the injured.”",
        "Weight": 5,
        "Id": 384
    },
    {
        "URL": "https://x.com/NYplaid/status/1855957048875253902",
        "Date": "11/11/2024",
        "Text": "The famine isn’t looming but they have to go by the definition of the terrorist \n@WFP_MENA",
        "Weight": 5,
        "Id": 392
    },
    {
        "URL": "https://x.com/NYplaid/status/1855849207778714075",
        "Date": "11/11/2024",
        "Text": "What are your updates on Gaza? Have you abandoned North Gaza???",
        "Weight": 8,
        "Id": 394
    },
    {
        "URL": "https://x.com/NYplaid/status/1855848560337494461",
        "Date": "11/11/2024",
        "Text": " Urgent | The Israeli occupation army blows up residential buildings in Jabalia camp, north of the Gaza Strip",
        "Weight": 17,
        "Id": 396
    },
    {
        "URL": "https://x.com/NYplaid/status/1855848340962849177",
        "Date": "11/11/2024",
        "Text": "I can vibe with the below statement. If you contribute to the terrorist entity, you are part of the problem",
        "Weight": 5,
        "Id": 397
    },
    {
        "URL": "https://x.com/NYplaid/status/1855848055049732439",
        "Date": "11/11/2024",
        "Text": "“Urgent | Al-Awda Hospital: An elderly woman was killed by the occupation's artillery shelling west of Al-Nuseirat camp in the central Gaza Strip.”",
        "Weight": 9,
        "Id": 398
    },
    {
        "URL": "https://x.com/NYplaid/status/1855846911925739671",
        "Date": "11/11/2024",
        "Text": "“Families trapped as occupation forces infiltrate west of Nuseirat camp after intensive raids.. More with Al Arabiya TV correspondent\n\n@Bata99m\n”",
        "Weight": 5,
        "Id": 401
    },
    {
        "URL": "https://x.com/NYplaid/status/1855846276094398652",
        "Date": "11/11/2024",
        "Text": "“The occupation forces stormed the Jalazone camp, north of Ramallah, and carried out an arrest campaign”",
        "Weight": 5,
        "Id": 402
    },
    {
        "URL": "https://x.com/MenchOsint/status/1855842362745848100",
        "Date": "11/11/2024",
        "Text": "W Greta.\n\nAzerbaijan, which is a major Turkish ally, is also a vital ally for Israel, supplying Oil & buying weapons.  https://x.com/ragipsoylu/sta/ragipsoylu/status/1855717761827340379…",
        "Weight": 4,
        "Id": 408
    },
    {
        "URL": "https://x.com/saroyahx/status/1855606543259214329",
        "Date": "10/11/2024",
        "Text": "Starting tomorrow, the Sudanese Embassy in Cairo will open a desk to receive reports from community members on crimes and violations committed by the UAE-backed RSF militia during the war. #KeepEyesOnSudan",
        "Weight": 2,
        "Id": 410
    },
    {
        "URL": "https://x.com/SeifGebre/status/1853137251930403320",
        "Date": "03/11/2024",
        "Text": "Four years ago these #WarCriminals with the support of Somalia troops & #UAE & #Turkiye drones started the #TigrayGenocide. As the then #EU Envoy Pekka Haavisto attested, the objective was to erase Tigrayans from the face of earth so as to steal Tigray’s land, history & culture.",
        "Weight": 5,
        "Id": 412
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1855834558412816887",
        "Date": "11/11/2024",
        "Text": "Three people have been KILLED in #Israeli_bombing of Al Nuseirat refugee camp!",
        "Weight": 8,
        "Id": 413
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1855808007981953307",
        "Date": "11/11/2024",
        "Text": "JOURNALIST Mohammad Khrees and his wife have been MURDERED and his children WOUNDED in #Israeli_bombing of his tent in Al Nuseirat refugee camp!",
        "Weight": 8,
        "Id": 414
    },
    {
        "URL": "https://x.com/NYplaid/status/1855833178453233759",
        "Date": "11/11/2024",
        "Text": "“ The occupation forces stormed the city of Nablus at dawn today and carried out raids and arrests.”",
        "Weight": 5,
        "Id": 416
    },
    {
        "URL": "https://x.com/NYplaid/status/1855833018281099278",
        "Date": "11/11/2024",
        "Text": "“ An occupation drone fired at citizens’ homes in Al-Mufti Land and the outskirts of Camp 5, north of Al-Nuseirat, in the central Gaza Strip.”",
        "Weight": 9,
        "Id": 417
    },
    {
        "URL": "https://x.com/NYplaid/status/1855828058369892379",
        "Date": "11/11/2024",
        "Text": "“#عاجل | ““israeli” terrorist force: We intercepted the Yemeni ballistic missile near Jerusalem before it entered our airspace”",
        "Weight": 13,
        "Id": 420
    },
    {
        "URL": "https://x.com/NYplaid/status/1855827678626001138",
        "Date": "11/11/2024",
        "Text": "There is no Power but Allah. I bear witness that the Egyptian Muslims were bankrupt of dignity due to the Military State of affairs. The Sisi sold the Egyptian people and collected on the Holocaust of the Palestinian people",
        "Weight": 7,
        "Id": 421
    },
    {
        "URL": "https://x.com/NYplaid/status/1855825534791368859",
        "Date": "11/11/2024",
        "Text": "“ Media coverage: The occupation turns a house into an interrogation center for young men in the village of Budrus, west of Ramallah, after a campaign of raids, arrests, and searches of dozens of homes.”",
        "Weight": 5,
        "Id": 422
    },
    {
        "URL": "https://x.com/OmnaTigray/status/1853518168712511668",
        "Date": "04/11/2024",
        "Text": "Today marks 4 years since Ethiopia’s PM Abiy Ahmed launched #TigrayGenocide. A silent genocide continues in Tigray. On this solemn occasion, we draw attention to conditions in Tigray & call for the implementation of the Cessation of Hostilities Agreement & #Justice4Tigray. \nA",
        "Weight": 10,
        "Id": 425
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1855819549800534097",
        "Date": "11/11/2024",
        "Text": "People are dying due to complete lack of food and water in #NorthernGaza, why has not WHO declared starvation there?!\n\nIs it afraid of Israel’s reactions and US sanctions?!",
        "Weight": 8,
        "Id": 428
    },
    {
        "URL": "https://x.com/Tseday/status/1855268629228429314",
        "Date": "09/11/2024",
        "Text": "The Ark of the Covenant is in Ethiopia.\n\nThis is the history that Zionists erased.\n\nOrthodox Christians are the keepers of the Ark of the Covenant not the Ethiopian Jews who sold their souls to Zionism & settled in Palestine.\n\nThis is my history & why my account is shadow banned.",
        "Weight": 18,
        "Id": 429
    },
    {
        "URL": "https://x.com/PalBint/status/1855818787573862580",
        "Date": "11/11/2024",
        "Text": "More than 23,000 Americans are serving in Israeli army:",
        "Weight": 8,
        "Id": 430
    },
    {
        "URL": "https://x.com/GenXGirl1994/status/1855816720906158419",
        "Date": "11/11/2024",
        "Text": "Trump offered Israeli Foreign Agent Elise Stefanik the UN Ambassador position.\n\nDrain the Swamp my Áśś!",
        "Weight": 8,
        "Id": 432
    },
    {
        "URL": "https://x.com/NYplaid/status/1855812022622945472",
        "Date": "11/11/2024",
        "Text": "Long Live Palestine! Victory to The Resistance!!!",
        "Weight": 4,
        "Id": 440
    },
    {
        "URL": "https://x.com/NYplaid/status/1855811834042867994",
        "Date": "11/11/2024",
        "Text": "“ Intermittent artillery shelling, accompanied by gunfire from vehicles west of the Nuseirat camp in the central Gaza Strip.”\n\nNote: Ya Allah, protect our brothers and sisters in Gaza",
        "Weight": 8,
        "Id": 441
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1855810181810081812",
        "Date": "11/11/2024",
        "Text": "They are doing it in front of the whole world..\n\nEthnic cleansing is not a claim, but fact is being carried out by Israeli occupation forces backed by the US and other world leaders!",
        "Weight": 13,
        "Id": 442
    },
    {
        "URL": "https://x.com/AlanRMacLeod/status/1855747473102324051",
        "Date": "10/11/2024",
        "Text": "The Israeli media are saying it. \n\nWhy can't ours do the same?",
        "Weight": 8,
        "Id": 443
    },
    {
        "URL": "https://x.com/NYplaid/status/1855805075827859728",
        "Date": "11/11/2024",
        "Text": "“ Urgent..\nOccupation army vehicles withdraw from Nablus city after arrest campaign”\n\nNote: they kidnap, torture and continue to put our brothers and sisters into “administrative” torture camps. This is a Holocaust funded by \n@StateDept",
        "Weight": 8,
        "Id": 445
    },
    {
        "URL": "https://x.com/NYplaid/status/1855802119166595571",
        "Date": "11/11/2024",
        "Text": "“#AlMasirah_Urgent | Our correspondent in Saada: American-British aggression with two raids on Al-Rahba area in Al-Safraa directorate”\n\nNote: the  terrorist are at it again… i s r a e l i----------terrorist continue bombing Yemen",
        "Weight": 10,
        "Id": 448
    },
    {
        "URL": "https://x.com/NYplaid/status/1855800698690027913",
        "Date": "11/11/2024",
        "Text": "Saudi terrorist* and they got sent to hell just like their demon brothers in the iOF. \n\nLong live the resistance",
        "Weight": 5,
        "Id": 449
    },
    {
        "URL": "https://x.com/NYplaid/status/1855799630597853683",
        "Date": "11/11/2024",
        "Text": "Note: Ya Allah! Bless our Resistance in Nablus!\n\n“ Press coverage: Clashes with the occupation forces around Balata camp, east of Nablus, in the northern occupied West Bank.”",
        "Weight": 5,
        "Id": 450
    },
    {
        "URL": "https://x.com/NYplaid/status/1855795607559880941",
        "Date": "11/11/2024",
        "Text": "Except if you are Palestinian***",
        "Weight": 4,
        "Id": 455
    },
    {
        "URL": "https://x.com/AbuLocation/status/1855789108687163874",
        "Date": "11/11/2024",
        "Text": "Geolocation #89:\nOct 30, 2023 - Revisiting the Famous Salah Al Deen Tank Attack\n\nOn that day several Palestinian cars were traveling North, unsuspecting a road block guarded by an Israeli Merkava tank, first approaching car tried to quickly turn and escape but it was too late",
        "Weight": 12,
        "Id": 457
    },
    {
        "URL": "https://x.com/NYplaid/status/1855787004199334192",
        "Date": "11/11/2024",
        "Text": "“ Malaysian Prime Minister from Cairo: Malaysia is preparing a draft resolution to expel \"Israel\" from the United Nations”\n\nNote: GOD WILLING. Expel the i s r a e l i----------terrorist all of them are enablers of the Holocaust",
        "Weight": 12,
        "Id": 459
    },
    {
        "URL": "https://x.com/NYplaid/status/1855779181323341943",
        "Date": "11/11/2024",
        "Text": "NOTE: THIS IS #NorthGazaHolocaust\n“Watch.. How the bodies of the martyrs were transported in northern Gaza on vehicles due to the occupation targeting ambulances and civil defense crews”",
        "Weight": 16,
        "Id": 461
    },
    {
        "URL": "https://x.com/NYplaid/status/1855778749821903235",
        "Date": "11/11/2024",
        "Text": "“A child was injured in the occupation's bombing of a tent for displaced people west of Al-Nuseirat camp in the central Gaza Strip”",
        "Weight": 9,
        "Id": 462
    },
    {
        "URL": "https://x.com/Tseday/status/492220863216119809",
        "Date": "24/07/2014",
        "Text": "This cartoon depicts what occupation & zionism is all about. The fate of the Ethiopian Jew in stolen Palestinian land",
        "Weight": 11,
        "Id": 463
    },
    {
        "URL": "https://x.com/NYplaid/status/1855684937417957650",
        "Date": "10/11/2024",
        "Text": "The i s r a e l i----------terrorist are trying to perform the same crimes against humanity the Roman’s did to those in Jerusalem in 70CE\nWe are 40 days into completely besieged North Gaza. THE \n@UNGeneva\n is helping Holocaust North Gaza",
        "Weight": 18,
        "Id": 464
    },
    {
        "URL": "https://x.com/NYplaid/status/1855565292694364169",
        "Date": "10/11/2024",
        "Text": "How many other people have co-hosted with this monster? This is Noobs other bestie…interesting choice of words he has for women, and respectable members of 𝕏. He does not represent Palestinians. Please excuse this mentally unstable person Noobs considers a close friend:",
        "Weight": 8,
        "Id": 472
    },
    {
        "URL": "https://x.com/swilkinsonbc/status/1855561492864647676",
        "Date": "10/11/2024",
        "Text": "An injured Palestinian boy holds his wounded sister after the israeli massacre of the Aloush family in Jabalia, in north Gaza | via \n@RamAbdu",
        "Weight": 16,
        "Id": 473
    },
    {
        "URL": "https://x.com/NYplaid/status/1855559931660804517",
        "Date": "10/11/2024",
        "Text": "Imagine “israel” not killing almost 20k children in Gaza!",
        "Weight": 8,
        "Id": 474
    },
    {
        "URL": "https://x.com/NYplaid/status/1855559715914195109",
        "Date": "10/11/2024",
        "Text": "“#عاجل | Director of field hospitals in Gaza to Al Arabiya TV: We urgently need to allow medical teams from the southern Gaza Strip to enter the north”\n\nNOTE: hey \n@realDonaldTrump\n do something! Is your transition team also pro genocide?",
        "Weight": 13,
        "Id": 476
    },
    {
        "URL": "https://x.com/EyeonPalestine/status/1855552166238278004",
        "Date": "10/11/2024",
        "Text": "Israeli air strikes targeted several areas in Lebanon.",
        "Weight": 8,
        "Id": 479
    },
    {
        "URL": "https://x.com/NYplaid/status/1855549044468187303",
        "Date": "10/11/2024",
        "Text": "“ Lebanese News Agency: The number of martyrs rose to 17 as a result of the “israeli” raids on the town of Deir Qanoun Ras al-Ain in the Tyre district in the south of the country”",
        "Weight": 8,
        "Id": 480
    },
    {
        "URL": "https://x.com/NYplaid/status/1855548513691529356",
        "Date": "10/11/2024",
        "Text": "#عاجل | Ministry of Health in Gaza: The number of victims of the “israeli” aggression has risen to 43,603 martyrs and 102,929 wounded since October 7, 2023",
        "Weight": 12,
        "Id": 483
    },
    {
        "URL": "https://x.com/NYplaid/status/1855548055602266311",
        "Date": "10/11/2024",
        "Text": "“Gaza Ministry of Health: The occupation committed 3 massacres against families in the Gaza Strip, 51 bodies and 164 injuries arrived at hospitals during the past 24 hours.”",
        "Weight": 13,
        "Id": 484
    },
    {
        "URL": "https://x.com/NYplaid/status/1855543321415790781",
        "Date": "10/11/2024",
        "Text": "“A message from Hamas in Lebanon to our Palestinian people and the world\n\n\"National unity is a necessity, and joint action is a duty.\"”",
        "Weight": 8,
        "Id": 485
    },
    {
        "URL": "https://x.com/NYplaid/status/1855538262091108445",
        "Date": "10/11/2024",
        "Text": "Press coverage: The occupation carries out operations to blow up residential blocks in the village of Al-Wazzani on the Palestinian-Lebanese border.",
        "Weight": 9,
        "Id": 487
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1855532845554348224",
        "Date": "10/11/2024",
        "Text": "Director of Kamal Odwan Hospital Dr Hussam abu Safiyeh: \n\n“Symptoms of malnutrition started to appear on starving people in #NorthernGaza.\n\n“We are fighting to afford only one little meal for paramedics and patients in the hospital.”",
        "Weight": 4,
        "Id": 488
    },
    {
        "URL": "https://x.com/NYplaid/status/1855536378613780617",
        "Date": "10/11/2024",
        "Text": "In Jabalia\n\nThis is the situation of the injured in the homes, as ambulances are unable to reach Jabalia due to the stifling siege on the camp.\n\nGenocide and war crimes in front of humanity https://x.com/Hanzpal2/statu/Hanzpal2/status/1855534118332755987…",
        "Weight": 17,
        "Id": 491
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1855533873519563103",
        "Date": "10/11/2024",
        "Text": "This highly respected person, Wael al Khour, director of Palestinian Authority’s Welfare Ministry in #Gaza, was MURDERED in #israeli_bombing of his house in #Gaza tonight!\n\nFive of his children were killed in the same bombing!",
        "Weight": 20,
        "Id": 492
    },
    {
        "URL": "https://x.com/Aseergaza/status/1855476146437075167",
        "Date": "10/11/2024",
        "Text": "#عاجل مجزرة جديدة بحق عائلة علوش في جباليا البلد شمال غزة وارتقاء 32 شهيد حتى اللحظة \n#جباليا_تباد \n#Urgent A new massacre against the Alloush family in Jabalia al-Balad, north of Gaza, and 32 martyrs have been killed so far. #Jabalia_is_being_annihilated. #Jabalia_is_burning",
        "Weight": 4,
        "Id": 498
    },
    {
        "URL": "https://x.com/NYplaid/status/1855475880908218715",
        "Date": "10/11/2024",
        "Text": "“ Scenes documenting the massacre committed by the occupation against the Alloush family in the northern Gaza Strip.”",
        "Weight": 9,
        "Id": 502
    },
    {
        "URL": "https://x.com/warfareanalysis/status/1855472721661944073",
        "Date": "10/11/2024",
        "Text": " Israel just bombed Al-Khour family’s house in Sabra neighborhood, south of Gaza city. So far, 5 martyrs, mostly children and women, have been recovered from under the rubble, and the search for missing is still ongoing.\n\n- Gaza civil defense.",
        "Weight": 12,
        "Id": 503
    },
    {
        "URL": "https://x.com/NYplaid/status/1855473177910030411",
        "Date": "10/11/2024",
        "Text": "“ The occupation forces storm the village of Budrus, west of Ramallah, and climb onto the roof of a house.”",
        "Weight": 5,
        "Id": 504
    },
    {
        "URL": "https://x.com/NYplaid/status/1855471762542129424",
        "Date": "10/11/2024",
        "Text": "\n“Urgent The “israeli” occupation Apache helicopters are widely deployed in the skies of northern and western Gaza at a very low level and are firing missiles and targeting the area now. Listen carefully to the sound.”\n#Jabalia",
        "Weight": 17,
        "Id": 505
    },
    {
        "URL": "https://x.com/NYplaid/status/1855461677409386590",
        "Date": "10/11/2024",
        "Text": "What the hell is this? Spoiled olive oil? Makes sense when you spend too much time with liberal z i o n i s t and love attacking ladies online. Not even the z i o n i s t “jews” curse peoples mothers like this scum low life.",
        "Weight": 4,
        "Id": 506
    },
    {
        "URL": "https://x.com/NYplaid/status/1855463487524254044",
        "Date": "10/11/2024",
        "Text": "He prays on women because he is a weak little bitch, and anyone that supports his behavior is an enabler of his disgusting conduct. He does not represent how Palestinians conduct themselves. He is a piece of shit low life and projects his own characteristics onto others. Fuck him",
        "Weight": 8,
        "Id": 509
    },
    {
        "URL": "https://x.com/NYplaid/status/1855459747425661263",
        "Date": "10/11/2024",
        "Text": "“5 martyrs and wounded in the occupation targeting a house in Al-Sabra neighborhood, south of the city #غزة .. More with the Al-Arabiya TV correspondent\n\n@Bata99m\n”",
        "Weight": 5,
        "Id": 510
    },
    {
        "URL": "https://x.com/NYplaid/status/1855453387652772327",
        "Date": "10/11/2024",
        "Text": "This is the type of recycled old news that people will think is fresh because they don’t follow \n@MENAUncensored\n and the journalist breaking stories months in advance of the i s r a e l i----------terrorist forces ",
        "Weight": 5,
        "Id": 517
    },
    {
        "URL": "https://x.com/NYplaid/status/1855448335655502302",
        "Date": "10/11/2024",
        "Text": "What are a bunch of American terrorist doing near Somalia?",
        "Weight": 5,
        "Id": 521
    },
    {
        "URL": "https://x.com/NYplaid/status/1855447408311665035",
        "Date": "10/11/2024",
        "Text": "“ Urgent | The occupation (terrorist forces) army blows up residential buildings in Jabalia camp, north of the Gaza Strip”\n\nNote: this is the legacy of antisemite pharisee (פָּרוּד) \n@ABlinken\n the i s r a e l i----------terrorist",
        "Weight": 19,
        "Id": 522
    },
    {
        "URL": "https://x.com/NYplaid/status/1855446918039585098",
        "Date": "10/11/2024",
        "Text": "“#عاجل | Al Arabiya TV correspondent: 5 martyrs were recovered after an “israeli” raid targeted a house in the Sabra neighborhood, south of Gaza City”",
        "Weight": 12,
        "Id": 523
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1855446150356083166",
        "Date": "10/11/2024",
        "Text": "Children have been WOUNDED in #israeli_bombing of a house in Al Sabra neighbourhood of #Gaza_City!",
        "Weight": 12,
        "Id": 524
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1855368416565383621",
        "Date": "09/11/2024",
        "Text": "This is a massive media scandal.\n\n\n@SkyNews\n posted a video accurately describing what happened in Amsterdam.\n\nIt described violence perpetrated by Israeli football hooligans, and their hideous racism.\n\nThey then deleted it. This is the original.",
        "Weight": 8,
        "Id": 526
    },
    {
        "URL": "https://x.com/NYplaid/status/1855445462397919669",
        "Date": "10/11/2024",
        "Text": "“The specter of famine besieges more than 340 thousand Palestinians in the northern Gaza Strip #غزة”",
        "Weight": 12,
        "Id": 527
    },
    {
        "URL": "https://x.com/NYplaid/status/1855437627207348663",
        "Date": "10/11/2024",
        "Text": " Watch\nArt exhibition in the Yemeni capital Sana'a to highlight the suffering of the Palestinian people and highlight their spirit of struggle",
        "Weight": 4,
        "Id": 530
    },
    {
        "URL": "https://x.com/Uncommonsince76/status/1855026159458652530",
        "Date": "08/11/2024",
        "Text": "Dave Chapelle will always be a real one for this. \n\n“-If it’s the blacks it’s a gang.\n\n-If it’s the Italians it’s the mafia.\n\n-if it’s the Jews it’s a coincidence….”",
        "Weight": 4,
        "Id": 533
    },
    {
        "URL": "https://x.com/HossamShabat/status/1855366374782050727",
        "Date": "09/11/2024",
        "Text": "Thank you for everyone who continues to protest , speak up and stand with us much from Gaza ",
        "Weight": 4,
        "Id": 539
    },
    {
        "URL": "https://x.com/NYplaid/status/1855282037575254045",
        "Date": "09/11/2024",
        "Text": "“ The truth about the public disorder in the Netherlands  , particularly in Amsterdam, involving far-right hooligans supporting Maccabi “Tel Aviv”, and the media coverage given to these events in that country and in Europe .\n\n#AmsterdamAttack",
        "Weight": 1,
        "Id": 541
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1855265200321990745",
        "Date": "09/11/2024",
        "Text": "400 days of israeli #genocide in #Gaza! \n#StopGazaGenocide",
        "Weight": 26,
        "Id": 549
    },
    {
        "URL": "https://x.com/MENAUncensored/status/1855260708742598700",
        "Date": "09/11/2024",
        "Text": "This is what we've been warning from for a while.. that corridor is Nahal Oz parallel to Netsarim.\noh well, just listen to the most recent time we warned of the plan in our space from Monday 4/11/2024 at timing 00:42:00 (minute 42). a day before the Israeli media spoke of it",
        "Weight": 8,
        "Id": 551
    },
    {
        "URL": "https://x.com/NYplaid/status/1855123811307315346",
        "Date": "09/11/2024",
        "Text": "Note: Ya Allah! Bless Our Resistance with a swift victory! \n\n“Press coverage: Ongoing clashes with occupation forces in the town of Aqaba, north of Tubas.”",
        "Weight": 5,
        "Id": 556
    },
    {
        "URL": "https://x.com/NYplaid/status/1855120723666243888",
        "Date": "09/11/2024",
        "Text": "“#Photos | From the ongoing storming of the town of Aqaba, north of Tubas, by the occupation forces”",
        "Weight": 5,
        "Id": 557
    },
    {
        "URL": "https://x.com/Aseergaza/status/1855115701234663614",
        "Date": "09/11/2024",
        "Text": "I don't want anything from you. My hope is only in God. All I want is for you to imagine yourself and your family in my place, struggling every minute to stay alive, you and your children. This is today's news. Watch the video to the end. #Here_is_North_Gaza",
        "Weight": 4,
        "Id": 558
    },
    {
        "URL": "https://x.com/cheriblossom__/status/1855109039731957859",
        "Date": "09/11/2024",
        "Text": "Did you know there was an entire “Moroccans neighborhood” right next to Al-Aqsa and the Zionists leveled it to the ground as soon as they occupied the city?One of the entrances of Al Aqsa is still named after them to this day. \nPalestinians still use the neighborhood name too.",
        "Weight": 18,
        "Id": 559
    },
    {
        "URL": "https://x.com/EyeonPalestine/status/1855109036275872012",
        "Date": "09/11/2024",
        "Text": "Five Palestinians, including children, were in an Israeli air strike that targeted the school of Fahad Al Subah in Al Tuffah neighborhood east of Gaza City.",
        "Weight": 20,
        "Id": 560
    },
    {
        "URL": "https://x.com/realstewpeters/status/1855103323981955529",
        "Date": "09/11/2024",
        "Text": "Since the very beginning of this country, subversive jews have been doing everything they can to gobble up complete control and destroy us. ",
        "Weight": 4,
        "Id": 562
    },
    {
        "URL": "https://x.com/WesamHammad110/status/1854908037544231056",
        "Date": "08/11/2024",
        "Text": "Spain prevents two ships carrying weapons from America to Israel from docking in the port of Algeciras. Who will be the alternative country? Will it be Morocco or Egypt? Who among the practical Arab regimes will come to Israel's aid, as is the custom of loyal agents?",
        "Weight": 8,
        "Id": 567
    },
    {
        "URL": "https://x.com/Dr_Muneer1/status/1855093843789525278",
        "Date": "09/11/2024",
        "Text": "أي سيارة إسعاف تتحرك في محافظة شمال غزة يتم استهدافها.. الواقع الصحي المؤلم في غزة.\n\nAny ambulance moving in the North Gaza Governorate is targeted… The painful health reality in Gaza.",
        "Weight": 8,
        "Id": 569
    },
    {
        "URL": "https://x.com/leylahamed/status/1855080060190912743",
        "Date": "09/11/2024",
        "Text": "In this last video, things get even worse. As \n@OmeBender\n says, Maccabi fans made the atmosphere look “life-threatening”\n\nChildren around 12 years old were holding steel poles among the Israeli supporters, and even attacked the police.",
        "Weight": 8,
        "Id": 573
    },
    {
        "URL": "https://x.com/NYplaid/status/1855082495198343174",
        "Date": "09/11/2024",
        "Text": "“ Local sources | Occupation forces storm Aktaba suburb in Tulkarm” \n\nNOTE: This is the West Bank, not Gaza. Terrorism funded by \n@TravelGov\n the premier child killers who resettle terrorist from Brooklyn to occupied Palestine.",
        "Weight": 18,
        "Id": 574
    },
    {
        "URL": "https://x.com/NYplaid/status/1855081846767268341",
        "Date": "09/11/2024",
        "Text": "Diet Coke news spells  m u r d e r e d  wrong. Here ill fix it for you…\n\nNearly 70 percent of those m u r d e r e d in Gaza are women and children: UN (i s r a e l i----------terrorist supporters of famine)",
        "Weight": 9,
        "Id": 575
    },
    {
        "URL": "https://x.com/leylahamed/status/1855078845293961611",
        "Date": "09/11/2024",
        "Text": "As \n@omebender\n reports, the Israeli fans are seen stealing steel poles from the ground and proceed to terrorise Dutch people who were around (you will notice a few women desperately running away from the scene)",
        "Weight": 8,
        "Id": 576
    },
    {
        "URL": "https://x.com/warfareanalysis/status/1854872041628762583",
        "Date": "08/11/2024",
        "Text": "Al-Qassam Brigades: \n\nTargeting a Zionist military vehicle in Al-Khazandar area, northwest of Gaza City.",
        "Weight": 9,
        "Id": 579
    },
    {
        "URL": "https://x.com/NYplaid/status/1855036689477165119",
        "Date": "08/11/2024",
        "Text": "i s r a e l i----------terrorist child killers who prevented all negotiations from proceeding, because they all supported the Holocaust our children",
        "Weight": 8,
        "Id": 585
    },
    {
        "URL": "https://x.com/NYplaid/status/1855035510852624443",
        "Date": "08/11/2024",
        "Text": "“Update... The number of martyrs has risen to 5 as a result of an “israeli” airstrike targeting Fahd Al-Sabah School, which houses displaced people on Jaffa Street in Gaza City.”",
        "Weight": 12,
        "Id": 587
    },
    {
        "URL": "https://x.com/cheriblossom__/status/1855034724110017006",
        "Date": "08/11/2024",
        "Text": "Al Qassam after the occupation got out of Gaza in 2005 and made it the first Palestinian land to be taken back. \n\n",
        "Weight": 13,
        "Id": 588
    },
    {
        "URL": "https://x.com/MenchOsint/status/1855034913147244567",
        "Date": "08/11/2024",
        "Text": "Turkish people boarded the last ship carrying arms for Israel.\n\nI believe Moroccan people can do too, the King cannot silent nor arrest people who are protesting the docking of a ship carrying arms to kill Palestinian & Lebanese people, ship that even Spain refused.",
        "Weight": 8,
        "Id": 589
    },
    {
        "URL": "https://x.com/jjz1600/status/1854972996215357860",
        "Date": "08/11/2024",
        "Text": "The new Israeli ambassador to the US was a member of US designated terror organization. I take this personally. The JDL murdered my colleague Alex Odeh, threatened my life, & firebombed my office. He should be denied entry to the US.",
        "Weight": 8,
        "Id": 590
    },
    {
        "URL": "https://x.com/GenXGirl1994/status/1854514365162201245",
        "Date": "07/11/2024",
        "Text": "HARRIS LOST B/C SHE IGNORED GAZA GENOCIDE\n\nPRIMARY: Voters Withhold Vote 4Arms Embargo\nPOLLING: Voters Seek Candidate 4Arms Embargo\nELECTION: Data Shows Uncommitted Vote was Factor in Harris Loss in 4 States\nMichigan\nWisconsin\nPennsylvania\nNorth Carolina\n\n#imspeaking",
        "Weight": 9,
        "Id": 592
    },
    {
        "URL": "https://x.com/NYplaid/status/1855017807475626385",
        "Date": "08/11/2024",
        "Text": "This is Julia Tayeh was massacred along with her entire life by indiscriminate “israeli” attacks in northern Gaza.",
        "Weight": 12,
        "Id": 600
    },
    {
        "URL": "https://x.com/NYplaid/status/1855017168888643832",
        "Date": "08/11/2024",
        "Text": "“We confirm: The hypersonic ballistic missile \"Palestine 2\"\nThanks to God, he reached his target at the Nevatim Air Base in the Negev region in southern occupied Palestine???”",
        "Weight": 8,
        "Id": 602
    },
    {
        "URL": "https://x.com/NYplaid/status/1855015484347105575",
        "Date": "08/11/2024",
        "Text": "“The first anniversary of the martyrdom of a group of resistance fighters and the moons of Jenin\nOn the land of Jenin and its steadfast camp, after the incursion of Zionist special forces\n\nMay God have mercy on the most generous of us all”",
        "Weight": 5,
        "Id": 604
    },
    {
        "URL": "https://x.com/QudsNen/status/1855002500207657122",
        "Date": "08/11/2024",
        "Text": "Over 110,000 Palestinian patients in Gaza fighting death without medication after Israel’s systematic attacks on hospitals since the initiation of Israel’s onslaught. Here’s a recap",
        "Weight": 16,
        "Id": 605
    },
    {
        "URL": "https://x.com/NYplaid/status/1855014509964148962",
        "Date": "08/11/2024",
        "Text": "Tell \n@StateSEAS\n to stop being so antisemitic! Why are you kicking Palestinians out of Qatar now?\n\nStateDept harbors the most terrorist world wide. It’s a child killing machine. Godless, pagan pharisee (פָּרוּד) employer",
        "Weight": 16,
        "Id": 607
    },
    {
        "URL": "https://x.com/NYplaid/status/1855010744934580641",
        "Date": "08/11/2024",
        "Text": "“ Urgent..\nTargeting the occupation forces with a hail of bullets inside the old Askar camp east of Nablus.”",
        "Weight": 5,
        "Id": 609
    },
    {
        "URL": "https://x.com/s_m_marandi/status/1854895995043127684",
        "Date": "08/11/2024",
        "Text": "Watch Zionists terrorize starving Palestinians in northern Gaza.\n\nWill the EU condemn this?\n\nOf course not. They support the #GazaHolocaust.",
        "Weight": 29,
        "Id": 613
    },
    {
        "URL": "https://x.com/receipts_lol/status/1855005409041404302",
        "Date": "08/11/2024",
        "Text": "> Wikipedia has decided to rename the  page –  initially titled ‘Genocide allegations in the 2023 Israeli  assault on Gaza’ to simply ‘Gaza Genocide’.",
        "Weight": 26,
        "Id": 614
    },
    {
        "URL": "https://x.com/NYplaid/status/1855004799672238335",
        "Date": "08/11/2024",
        "Text": "Note: All that makeup won’t coverup the fact that she is a terrorist child killer\n\n\"“Don’t worry. Women and children in Gaza will pay the price.”\n\nThis is what Israeli soldier Mazal Ladri commented on a video of the Amsterdam events.\"",
        "Weight": 17,
        "Id": 616
    },
    {
        "URL": "https://x.com/ytirawi/status/1854840901580861451",
        "Date": "08/11/2024",
        "Text": "Israeli soldiers blow up homes in Gaza this morning, in revenge for the events in Amsterdam the two past days.\n\n“We dedicate this explosion to all the fans of Maccabi Tel Aviv. We’ll get to all of you, you sons of **”",
        "Weight": 13,
        "Id": 617
    },
    {
        "URL": "https://x.com/AbuLocation/status/1855004004637397191",
        "Date": "08/11/2024",
        "Text": "Geolocation #85: The State of Israeli Ground Invasion (October 29, 2023)\n\nGoogle Earth updated Gaza strip imagery (only Central and Sothern districts), which provides opportunity to observe the progress of Eastern direction aimed to envelope Gaza from the Valley and upwards.",
        "Weight": 16,
        "Id": 618
    },
    {
        "URL": "https://x.com/NYplaid/status/1855002965159166192",
        "Date": "08/11/2024",
        "Text": " image\nPart of the occupation raids on the southern suburb of Beirut",
        "Weight": 5,
        "Id": 621
    },
    {
        "URL": "https://x.com/Leila1H/status/1854973597825007970",
        "Date": "08/11/2024",
        "Text": "Here \n@NRC_Egeland\n refrains from stating who did the destruction &why the iOf set those check points.\nHis words ALSO insinuate that only the northernmost part of the North Gaza Strip is under siege & NOT all of NORTH GAZA STRIP\nPS:Gaza city is NOT North Gaza Strip but a city in it",
        "Weight": 16,
        "Id": 622
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1854928431001039315",
        "Date": "08/11/2024",
        "Text": "Salam Alykum \nDr Hussam abu Safiyeh, director of kamal Odwan hospital in Jabalia of Northern Gaza, says: “Every day we lose patients due to lack of medicines and medical supplies.”",
        "Weight": 4,
        "Id": 625
    },
    {
        "URL": "https://x.com/Nina_yeya/status/1854927137150489047",
        "Date": "08/11/2024",
        "Text": "ISL raid targets the vicinity of Kamal Adwan Hospital.\n\n#SaveNorthGaza #FreePalestine",
        "Weight": 8,
        "Id": 627
    },
    {
        "URL": "https://x.com/NYplaid/status/1854916264793378960",
        "Date": "08/11/2024",
        "Text": "Tanks advance on civilians in Beit Lahia, North Gaza.  Media blackout on the ongoing massacres unfolding in North Gaza.",
        "Weight": 8,
        "Id": 628
    },
    {
        "URL": "https://x.com/WesamHammad110/status/1854912879813693553",
        "Date": "08/11/2024",
        "Text": "The current Israeli plan: In the coming weeks, until US President Trump takes office, the Israeli army will complete the establishment of a third axis (after the Philadelphia and Netzarim axis) in preparation for the evacuation of Gaza City when Trump enters the White House.",
        "Weight": 20,
        "Id": 629
    },
    {
        "URL": "https://x.com/NYplaid/status/1854903577183142241",
        "Date": "08/11/2024",
        "Text": "“Ministry of Health in Gaza: The death toll from the israeli aggression on the Strip has risen to 43,508 martyrs and 102,684 wounded since October 7, 2023.”",
        "Weight": 12,
        "Id": 632
    },
    {
        "URL": "https://x.com/NYplaid/status/1854780117815300249",
        "Date": "08/11/2024",
        "Text": "“The vehicle that the occupation forces opened fire at, injuring a resident in the Ras Khamis neighborhood in occupied Jerusalem at dawn today”",
        "Weight": 5,
        "Id": 635
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1854779274508525764",
        "Date": "08/11/2024",
        "Text": "Fisherman has been KILLED and 3 others WOUNDED in #israeli_bombing of fishermen on the beach of Rafah!",
        "Weight": 10,
        "Id": 636
    },
    {
        "URL": "https://x.com/NYplaid/status/1854771292559249560",
        "Date": "08/11/2024",
        "Text": "“On its 399th day... the most prominent developments in the Israeli genocide in Gaza\n\nRead more via the Palestinian Information Center:”",
        "Weight": 21,
        "Id": 639
    },
    {
        "URL": "https://x.com/NYplaid/status/1854770756674036079",
        "Date": "08/11/2024",
        "Text": "Terrorist pharisee (פָּרוּד) continues to lie",
        "Weight": 5,
        "Id": 640
    },
    {
        "URL": "https://x.com/NYplaid/status/1854764582868316480",
        "Date": "08/11/2024",
        "Text": "Press coverage: Destruction caused by the occupation forces after storming Balata camp, east of Nablus.",
        "Weight": 5,
        "Id": 642
    },
    {
        "URL": "https://x.com/NYplaid/status/1854760378233716739",
        "Date": "08/11/2024",
        "Text": "Lmfao no fucking way!!!!\n\n“#عاجل | iOF (terrorist forces): We are preparing to send a force to the Netherlands to help evacuate Israelis who were exposed to violence”",
        "Weight": 16,
        "Id": 645
    },
    {
        "URL": "https://x.com/NYplaid/status/1854758575077315049",
        "Date": "08/11/2024",
        "Text": "#صور | A protest stand by students demanding the opening of the crossing to join their universities, at Al-Aqsa Martyrs Hospital in Deir al-Balah in the central Gaza Strip.",
        "Weight": 4,
        "Id": 648
    },
    {
        "URL": "https://x.com/NYplaid/status/1854758473596092589",
        "Date": "08/11/2024",
        "Text": "Urgent | Local sources: Injuries in an occupation raid targeting a house in the Abu Ma'ala area, northwest of the Nuseirat camp in the central Gaza Strip.",
        "Weight": 9,
        "Id": 649
    },
    {
        "URL": "https://x.com/NYplaid/status/1854755645288767785",
        "Date": "08/11/2024",
        "Text": "“Press coverage: A protest by students demanding the opening of the crossing to join their universities at Al-Aqsa Martyrs Hospital in Deir al-Balah in the central Gaza Strip.”",
        "Weight": 4,
        "Id": 650
    },
    {
        "URL": "https://x.com/NYplaid/status/1854755226051305503",
        "Date": "08/11/2024",
        "Text": "“#صور | Palestinians bury a number of martyrs at the Baptist Hospital in Gaza City.”",
        "Weight": 12,
        "Id": 651
    },
    {
        "URL": "https://x.com/NYplaid/status/1854754040476733607",
        "Date": "08/11/2024",
        "Text": "DC pharisee with the ADL propaganda machine running. These are the terrorist killing children in Gaza:",
        "Weight": 9,
        "Id": 652
    },
    {
        "URL": "https://x.com/Yaz5_0/status/1854748641639940377",
        "Date": "08/11/2024",
        "Text": "People don’t need to justify their actions to Jews, they’re simply responding to the harm done by Jews against them.\nExplaining it just elevates their sense of importance.\nStand strong,support those who fight back and stop trying to convince Jews about the actions of free people.",
        "Weight": 12,
        "Id": 653
    },
    {
        "URL": "https://x.com/DanBilzerian/status/1854747422557409716",
        "Date": "08/11/2024",
        "Text": "The only pogroms going on are happening in the West Bank. The jews in Amsterdam are just getting a good old fashioned ass whipping for bragging about killing Arabs and children. FAFO",
        "Weight": 4,
        "Id": 654
    },
    {
        "URL": "https://x.com/_jwhittall/status/1854616339828052322",
        "Date": "07/11/2024",
        "Text": "1/11 Everyone in Gaza feels as if they have been put on death row. If not killed by bombs or bullets, they are slowly suffocating from a lack of the basic means of survival. The only difference is the speed at which you die. The world has failed #Gaza. A…",
        "Weight": 8,
        "Id": 655
    },
    {
        "URL": "https://x.com/AbubakerAbedW/status/1854747015202168981",
        "Date": "08/11/2024",
        "Text": "To get it clearer: more \"Israeli terrorists and extremists\" \n\nThose were inciting hate and violence against Palestinian children. So, they totally deserve a life sentence and no welcome at any country around the world.",
        "Weight": 22,
        "Id": 660
    },
    {
        "URL": "https://x.com/NYplaid/status/1854743317046497783",
        "Date": "08/11/2024",
        "Text": "You are correct \n@carte14531\n the ppl in Netherlands checked for “israeli” passports before proceeding to teach the child killers a lesson.",
        "Weight": 8,
        "Id": 662
    },
    {
        "URL": "https://x.com/NYplaid/status/1854742199629406483",
        "Date": "08/11/2024",
        "Text": "“For the first time since the beginning of the war\n\nSirens sound in Dimona near the Israeli nuclear reactor there.\n\nMissiles coming from Yemen”",
        "Weight": 8,
        "Id": 666
    },
    {
        "URL": "https://x.com/AidanSimardone/status/1854734988962300268",
        "Date": "08/11/2024",
        "Text": "The real crime is that Amsterdam hosted a football game with Israel",
        "Weight": 4,
        "Id": 672
    },
    {
        "URL": "https://x.com/NYplaid/status/1854735480069198074",
        "Date": "08/11/2024",
        "Text": "“ Burning the occupation flag in front of the hotels where the fans of the occupation team are staying in the Netherlands”",
        "Weight": 10,
        "Id": 674
    },
    {
        "URL": "https://x.com/Marmoreal/status/1854733255724974247",
        "Date": "08/11/2024",
        "Text": "Ya Allaah \n\n#stopgaza https://x.com/AnasAlSharif0//AnasAlSharif0/status/1854663498279604613…",
        "Weight": 4,
        "Id": 675
    },
    {
        "URL": "https://x.com/NYplaid/status/1854732770842423318",
        "Date": "08/11/2024",
        "Text": " Media coverage: Heavy gunfire from occupation vehicles north of Al-Bureij and Al-Nuseirat",
        "Weight": 5,
        "Id": 677
    },
    {
        "URL": "https://x.com/NYplaid/status/1854732178946445428",
        "Date": "08/11/2024",
        "Text": "“Urgent | Press coverage: The occupation's gunboats renew their shelling of the western areas of Rafah city”",
        "Weight": 7,
        "Id": 678
    },
    {
        "URL": "https://x.com/NYplaid/status/1854731575281545435",
        "Date": "08/11/2024",
        "Text": "“ The child martyr Julia Yousef Tayeh, who was killed with her family in the occupation’s bombing of Jabalia camp, north of Gaza, a few months ago.”",
        "Weight": 9,
        "Id": 680
    },
    {
        "URL": "https://x.com/TheCradleMedia/status/1854673973486764079",
        "Date": "07/11/2024",
        "Text": "Israel's extermination campaign in the Gaza Strip has seen the bombing of hospitals and schools, along with the erasure of homes and lives, become completely normalized.\n\nWatch on YouTube: http://bit.ly/4fBNS2t",
        "Weight": 8,
        "Id": 681
    },
    {
        "URL": "https://x.com/walidmahmodrouk/status/1854719982950560224",
        "Date": "08/11/2024",
        "Text": "These were the football fans of the Maccabi Tel Aviv who assaulted Pro-Palestine protesters, attacked taxi cab drivers, and tore down people’s property.\n\nStop crying like the victim every single time.",
        "Weight": 10,
        "Id": 682
    },
    {
        "URL": "https://x.com/NYplaid/status/1854727189171666973",
        "Date": "08/11/2024",
        "Text": "“ \"After they tore up the Palestinian flag...\"\n\n#شاهد | Attack on \"israeli\" fans in the Dutch capital Amsterdam after the end of a football match”",
        "Weight": 12,
        "Id": 688
    },
    {
        "URL": "https://x.com/AidenHunterX/status/1854682402427371925",
        "Date": "08/11/2024",
        "Text": "Nobody trusts jews anymore.",
        "Weight": 4,
        "Id": 691
    },
    {
        "URL": "https://x.com/shameensuleman/status/1854721304269631671",
        "Date": "08/11/2024",
        "Text": "Palestinians scream after the israeli occupation bombed the house of the \"Al-Masry\" family near the Beit Lahia Sports Club in the northern Gaza Strip.",
        "Weight": 25,
        "Id": 692
    },
    {
        "URL": "https://x.com/shameensuleman/status/1854720107894771859",
        "Date": "08/11/2024",
        "Text": "An attack by citizens and displaced persons on the barracks of Zionist merchants in the Daraj neighborhood, northwest of Gaza City\n.\nMamoun Hamada is shooting at citizens\n\nحَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
        "Weight": 9,
        "Id": 693
    },
    {
        "URL": "https://x.com/WearThePeaceCo/status/1854635597706547452",
        "Date": "07/11/2024",
        "Text": "Journalist \n@nahed_hajjaj99\n who continues to broadcast live from Gaza is officially on X | Please give him a follow to support him on here",
        "Weight": 4,
        "Id": 694
    },
    {
        "URL": "https://x.com/samhusseini/status/1854719645669900519",
        "Date": "08/11/2024",
        "Text": "Except for Palestine.",
        "Weight": 4,
        "Id": 695
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1854713287960563786",
        "Date": "08/11/2024",
        "Text": "Another massacre in #Gaza\n\nEight people —entire family— have been KILLED in #israeli_bombing of a house in Al Daraj neighbourhood of #Gaza_City!",
        "Weight": 16,
        "Id": 696
    },
    {
        "URL": "https://x.com/NYplaid/status/1854702803165626483",
        "Date": "08/11/2024",
        "Text": "“Jews” doing what they do: https://x.com/SuppressedNws//SuppressedNws/status/1854701760385872270…",
        "Weight": 4,
        "Id": 700
    },
    {
        "URL": "https://x.com/NYplaid/status/1854692871305412746",
        "Date": "08/11/2024",
        "Text": "“Urgent | Press coverage: Occupation forces blow up residential buildings in Jabalia camp, north of Gaza”",
        "Weight": 9,
        "Id": 701
    },
    {
        "URL": "https://x.com/NYplaid/status/1854691594919977148",
        "Date": "08/11/2024",
        "Text": "“Press coverage: Shooting at an “israeli” army bulldozer during a raid on Balata camp east of Nablus”\n\nNote: resistance to “Jewish” occupation is protected under international law",
        "Weight": 17,
        "Id": 702
    },
    {
        "URL": "https://x.com/NYplaid/status/1854681451780043237",
        "Date": "08/11/2024",
        "Text": "The Yemenis poke the eye of terrorist right from the sky. May Allah bless Ansar Allah, and all those fighting for liberation in  and elsewhere",
        "Weight": 5,
        "Id": 703
    },
    {
        "URL": "https://x.com/Leila1H/status/1854591796086538637",
        "Date": "07/11/2024",
        "Text": "Zionazi accounts attacking our colleague \n@AbujomaaGaza\n who is an internationally accredited journalist stationed in North Gaza and has been stuck there for the past 13 months.",
        "Weight": 10,
        "Id": 704
    },
    {
        "URL": "https://x.com/hzomlot/status/1854525551832129906",
        "Date": "07/11/2024",
        "Text": "The president of the \n@OxfordUnion\n asked about Israel’s right to self defence. Here is the answer in 30 seconds.",
        "Weight": 4,
        "Id": 706
    },
    {
        "URL": "https://x.com/NYplaid/status/1854679179213898145",
        "Date": "08/11/2024",
        "Text": "“Urgent .. The occupation forces launch a large-scale arrest campaign during their storming of the town of Al-Ram in occupied Jerusalem”",
        "Weight": 5,
        "Id": 707
    },
    {
        "URL": "https://x.com/MaxBlumenthal/status/1854660028407726580",
        "Date": "07/11/2024",
        "Text": "To Trump’s right, also paying homage to the founder of the pro-settler Chabad cult, is his transition chair, Howard Lutnick\n\nLutnick was also the chair of this year’s gala for United Hatzalah, the Israeli “rescue” org behind the babies baked in ovens hoax",
        "Weight": 8,
        "Id": 710
    },
    {
        "URL": "https://x.com/warfareanalysis/status/1854602571455119715",
        "Date": "07/11/2024",
        "Text": "Arabs just WATCH Gaza getting holocausted, and their excuse is that Sykes-Picot did not include Gaza within their “country”!!!!!!!!!!!!!",
        "Weight": 11,
        "Id": 712
    },
    {
        "URL": "https://x.com/shameensuleman/status/1854624405592457346",
        "Date": "07/11/2024",
        "Text": "PLEASE RT FAR AND WIDE \n\nPlease tune in to hear brother \n@SSDeen1969\n tomorrow with \n@SoniaPoulton\n @9.10am \nI would like to give a big Thank you to \n@jack_sprat74\n for arranging this to help Dr Mohamed \n@rebuildgaza24",
        "Weight": 4,
        "Id": 713
    },
    {
        "URL": "https://x.com/NYplaid/status/1854673299504349376",
        "Date": "07/11/2024",
        "Text": "“Press coverage: \"No one survived.\" Occupation aircraft wipe out an entire family from the civil registry after bombing the home of the \"Hamada\" family near the Al-Daraj clinic in the center of Gaza City.”",
        "Weight": 9,
        "Id": 716
    },
    {
        "URL": "https://x.com/NYplaid/status/1854673170189763016",
        "Date": "07/11/2024",
        "Text": "“Press coverage: Part of the occupation forces storming Balata camp east of Nablus”",
        "Weight": 5,
        "Id": 717
    },
    {
        "URL": "https://x.com/cheriblossom__/status/1854634528607735981",
        "Date": "07/11/2024",
        "Text": "The PA: We will pay employees' salaries when the Israeli Ministry of Finance transfers the clearing funds at the beginning of next week, and we have completed the procedures for calculating employees' salaries based on paying 70% of the salary\n\nthe fucking embarrassment.",
        "Weight": 8,
        "Id": 718
    },
    {
        "URL": "https://x.com/NYplaid/status/1854651967366410674",
        "Date": "07/11/2024",
        "Text": "Two terrorist work together to continue to commit a holocaust and genocide. The crimes against humanity and evidence piles up. #WHODidIt",
        "Weight": 15,
        "Id": 722
    },
    {
        "URL": "https://x.com/ytirawi/status/1854641685961326597",
        "Date": "07/11/2024",
        "Text": "Jabalia today |\n\nIsraeli officer Avraham Zerveev from Givati Special Operations Unit\n\n“Here in Jabalia. The Land of Israel is ours. That’s what we’re doing here. Walk[ing] through the length & breadth of the land.. And we’ll stay here till the end..Till victory.. Till settlement”",
        "Weight": 12,
        "Id": 723
    },
    {
        "URL": "https://x.com/NYplaid/status/1854614146991460492",
        "Date": "07/11/2024",
        "Text": "May Allah protect all those doing work to help our brothers and sisters in Gaza.\n\nMay He protect us from those venomous snakes looking to hinder any initiative that they cannot themselves benefit from abroad\n\nThat includes the platform builders:",
        "Weight": 4,
        "Id": 729
    },
    {
        "URL": "https://x.com/NYplaid/status/1854588020256575507",
        "Date": "07/11/2024",
        "Text": "Why aren’t you consistently posting about the crimes against humanity? You have first hand witnesses and testimony. Upload the crimes as they are documented. Do more.",
        "Weight": 4,
        "Id": 733
    },
    {
        "URL": "https://x.com/NYplaid/status/1854586103627432143",
        "Date": "07/11/2024",
        "Text": "“Martyrs and wounded, including children, in the occupation's bombing of the displaced in the Al-Shati camp, west of #غزة .. Video footage reveals the extent of the destruction and testimonies from the heart of the region”",
        "Weight": 5,
        "Id": 736
    },
    {
        "URL": "https://x.com/gazanotice/status/1854484286172266618",
        "Date": "07/11/2024",
        "Text": "Last night, the Israeli occupation forces detained dozens of Palestinian civilians in Jabalia, transporting them to an undisclosed detention center for “interrogation.” The location of the detainees remains unknown.",
        "Weight": 17,
        "Id": 739
    },
    {
        "URL": "https://x.com/shameensuleman/status/1854580637992468512",
        "Date": "07/11/2024",
        "Text": "North Gaza revolts against israeli merchants and their mercenary agents\n\nALHUMDULILHA",
        "Weight": 12,
        "Id": 740
    },
    {
        "URL": "https://x.com/NYplaid/status/1854580898651361326",
        "Date": "07/11/2024",
        "Text": "“Press coverage | Without any introductions.. The war of starvation is still gnawing at the bodies of the people of Gaza.. So what is the world waiting for?!”",
        "Weight": 4,
        "Id": 741
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1854579816298917921",
        "Date": "07/11/2024",
        "Text": "Fourth massacre since the morning!\n\nInitial reports: 6 displaced persons have been KILLED in #israeli_bombing of Al Rimal School —refugee shelter— in Al Nasr neighbourhood, northwest of #Gaza_City.",
        "Weight": 12,
        "Id": 743
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1854469140313964994",
        "Date": "07/11/2024",
        "Text": "Horrible Massacre \n\nTens of people have been KILLED and hundreds WOUNDED in an #israeli_bombing of a residential compound including more than 10 densely populated homes in the city of #Jabalia! \n\nNo more details available yet!",
        "Weight": 8,
        "Id": 750
    },
    {
        "URL": "https://x.com/AbujomaaGaza/status/1854513917927608426",
        "Date": "07/11/2024",
        "Text": "He served me some cactus on 1 June.. He told me he put himself to get it for his children after 8 months of lack of vegetables and fruits that day.. \n\nTwo months later, he wad killed in #israeli_bombing and left EIGHT ORPHAN CHILDREN and a WIDOW!",
        "Weight": 8,
        "Id": 753
    },
    {
        "URL": "https://x.com/NYplaid/status/1854401920380919903",
        "Date": "07/11/2024",
        "Text": "#عاجل | 5 martyrs and a number of missing persons as a result of the occupation targeting a house belonging to the Al-Asi family in the Beit Lahia project, north of the Gaza Strip.\n#جباليا_تباد \n#جباليا_تحترق",
        "Weight": 9,
        "Id": 757
    },
    {
        "URL": "https://x.com/NYplaid/status/1854401468465598938",
        "Date": "07/11/2024",
        "Text": "“Quds Translation | The occupation Knesset approves in the third reading the law \"deporting the families of those who carry out operations.\"”\n\nNote: This “law” will fast track the end of the “israeli” entity. The arrogance and ignorance of the terrorist pharisee (פָּרוּד) ",
        "Weight": 18,
        "Id": 758
    },
    {
        "URL": "https://x.com/NYplaid/status/1854394968460386368",
        "Date": "07/11/2024",
        "Text": "“For the sixteenth day, the Civil Defense is still forcibly disabled in all areas of the northern Gaza Strip due to the ongoing Israeli targeting and aggression, and thousands of citizens there are now without humanitarian and medical care”",
        "Weight": 12,
        "Id": 764
    },
    {
        "URL": "https://x.com/palinfoen/status/1854388308433912214",
        "Date": "07/11/2024",
        "Text": "Palestinian journalist Anas al-Sharif captured footage of children who reportedly died from starvation in al-Tuffah, east of Gaza city.\n#DoNotConcedeKamala \n#Pompeo \n#latinos \n#Meta \n#charlie \n#Dearborn",
        "Weight": 8,
        "Id": 769
    },
    {
        "URL": "https://x.com/NYplaid/status/1854387493178929197",
        "Date": "07/11/2024",
        "Text": "“Iraqi armed factions: We attacked a military target in the occupied territories with drones in support of our people in Palestine and Lebanon”",
        "Weight": 4,
        "Id": 771
    },
    {
        "URL": "https://x.com/NYplaid/status/1854385993597821093",
        "Date": "07/11/2024",
        "Text": "Including you \n@KingAbdullahII\n how will you be remembered? As the ruler that sat with the enemies, and let his children bare the shame and disgrace of allowing the #GazaHolocaust \n\nWhat happened to the airdrops to keep the ppl alive? Did your master shoot your planes? You ",
        "Weight": 7,
        "Id": 773
    }
]