[
    {
        "URL": "https://x.com/MacaesBruno/status/1872333819682152799",
        "Date": "26/12/2024",
        "Text": "Israel admits it killed journalists it knew were journalists and not Hamas fighters. Journalists all over the world keep silent",
        "Weight": 8,
        "Id": 0
    },
    {
        "URL": "https://x.com/KaviChek/status/1872620881387852069",
        "Date": "27/12/2024",
        "Text": "A short 7 paragraph write up from NYT on the brutal attack on Kamal Adwan hospital w/ Israeli military talking points that have no supporting evidence. And not one mention of the five hospital staff killed -including a pediatrician & two paramedics - in a direct attack yesterday",
        "Weight": 8,
        "Id": 2
    },
    {
        "URL": "https://x.com/GhassanAbuSitt1/status/1872598168476766520",
        "Date": "27/12/2024",
        "Text": "The triad of death: Hypothermia, malnutrition and injury. In Gaza this means that people will die of hypothermia at higher temperatures, will starve to death much quicker and will succumb to less severe wounds.",
        "Weight": 4,
        "Id": 4
    },
    {
        "URL": "https://x.com/ytirawi/status/1872602295495749958",
        "Date": "27/12/2024",
        "Text": "Fake news.\n\nAt dawn on December 6, under the command of the Givati Brigade, the Israeli military raided the hospital and killed over 50 people.",
        "Weight": 8,
        "Id": 5
    },
    {
        "URL": "https://x.com/PulaRJS/status/1872408834859528346",
        "Date": "26/12/2024",
        "Text": "BBC Online finally reported this story at 9.55 am.\n\nTo state the obvious, the headline - \"Five Gaza journalists killed in Israeli strike targeting armed group\" - uncritically accepts Israeli framing .\n\nThese claims ALWAYS unravel. / 1",
        "Weight": 20,
        "Id": 6
    },
    {
        "URL": "https://x.com/tksshawa/status/1872049147286855964",
        "Date": "25/12/2024",
        "Text": "These babies won’t be included in Gaza’s official death toll, proving once again how 45,000 is a severe undercount. Yet they’re dead because Israel displaced them, destroyed Gaza’s healthcare infrastructure, and insists on punishing millions with no end in sight. Merry Christmas.",
        "Weight": 12,
        "Id": 9
    },
    {
        "URL": "https://x.com/malsaafin/status/1872351861153665317",
        "Date": "26/12/2024",
        "Text": "The NYT editors will publish reports about Israeli soldiers sniping children in the head or setting houses on fire or shooting people receiving food aid or starving entire populations and then conclude it’s all collateral damage",
        "Weight": 8,
        "Id": 11
    },
    {
        "URL": "https://x.com/muhammadshehad2/status/1872369107355758823",
        "Date": "26/12/2024",
        "Text": "The irony Fabian, is that you’re a “military correspondent” yourself. So, a “combat propaganda operative” by your logic & hence a legitimate military target.\n\nSounds insane, right? stop justifying the wanton murder of hundreds of your colleagues in Gaza!",
        "Weight": 4,
        "Id": 13
    },
    {
        "URL": "https://x.com/_ZachFoster/status/1872330617020682746",
        "Date": "26/12/2024",
        "Text": "What is more antisemitic than turning Jewish symbols into symbols of hate?",
        "Weight": 7,
        "Id": 15
    },
    {
        "URL": "https://x.com/TreyYingst/status/1872365228467658978",
        "Date": "26/12/2024",
        "Text": "Israel is striking northern Gaza so hard that we can hear the explosions in Tel Aviv.",
        "Weight": 9,
        "Id": 16
    },
    {
        "URL": "https://x.com/NimerSultany/status/1872354079395184652",
        "Date": "26/12/2024",
        "Text": "The NYT report is a whitewash that portrays the genocide as a chaotic and disproportionate war justified by military necessity. Only one statement (by Netanyahu) is mentioned (no \"flatten Gaza\" statements). Also, the UN Commission of Inquiry reported this on 10 June.",
        "Weight": 9,
        "Id": 17
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1872340108638343438",
        "Date": "26/12/2024",
        "Text": "It also be noted that the \n@nytimes\n says its investigation \"found that\" senior Israeli commanders approved strikes on Hamas targets they knew \"would each endanger more than 100 combatants.\"\n\nAgain, this was already established by \n@972mag\n back in April.",
        "Weight": 12,
        "Id": 21
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1872333846651511150",
        "Date": "26/12/2024",
        "Text": "This is absurd.\n\nThe \n@nytimes\n published a piece about Israel's bombing campaign in Gaza.\n\nThey refer to an Israeli order allowing the killing of up to 20 civilians, including if the target was a \"lowest-ranking fighter\".\n\nThey claim the order \"has not previously been reported.\"",
        "Weight": 16,
        "Id": 22
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1872333864955498775",
        "Date": "26/12/2024",
        "Text": "Now the \n@nytimes\n comes along to confirm the obvious 14 months later, after Gaza has been reduced to an apocalyptic mass grave and so many Palestinians have been liquidated, without even properly citing the work who did this work a long time ago.",
        "Weight": 12,
        "Id": 23
    },
    {
        "URL": "https://x.com/hamaapil/status/1872025002725568949",
        "Date": "25/12/2024",
        "Text": "It was at this point in the war that German military leadership began “investigating low rates of Jewish conscription” in the army. When they found out that Jews served at a higher percentage rate than ethnic Germans, they lied and released a report saying that they didnt anyways",
        "Weight": 8,
        "Id": 25
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1872287810511905046",
        "Date": "26/12/2024",
        "Text": "He's weeping here for his brother, Palestinian journalist Ayman Al Gedi, burned alive by an Israeli strike alongside four colleagues.\n\nHe was outside the hospital where his wife was due to give birth to their first child.",
        "Weight": 12,
        "Id": 26
    },
    {
        "URL": "https://x.com/KhalilJeries/status/1872032376978866552",
        "Date": "25/12/2024",
        "Text": "I told \n@AJEnglish\n that on Christmas Day, Christians in Gaza are still facing Israeli genocide, both direct and indirect killing, with the recent Christian victim, 21-year-old Hiba Tarazi, who was killed due to a lack of diabetes medicine while at the church.",
        "Weight": 17,
        "Id": 28
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1872041317985095884",
        "Date": "25/12/2024",
        "Text": "This is a West Bank settler.\n\nHis content is regularly shared by pro-Israel accounts.\n\nLet’s be blunt. A society which produces cartoonish evil this extreme is not going to last.",
        "Weight": 9,
        "Id": 31
    },
    {
        "URL": "https://x.com/mehdirhasan/status/1872023945568039150",
        "Date": "25/12/2024",
        "Text": "This guy has to say \"Gaza wanted\" and \"Gaza got\", as if Gaza is a person, because otherwise his statement would sound as genocidal and cruel as it actually is (i.e. \"1 million children wanted war. 1 million children got war\").",
        "Weight": 12,
        "Id": 32
    },
    {
        "URL": "https://x.com/derJamesJackson/status/1871876552495116682",
        "Date": "25/12/2024",
        "Text": "The same President demanded everyone with Arabic ancestry (which includes Christians and Shia) condemn Hamas.",
        "Weight": 4,
        "Id": 33
    },
    {
        "URL": "https://x.com/GazaMartyrs/status/1872017269678854302",
        "Date": "25/12/2024",
        "Text": "Merry Christmas, Dears \n\nWhile the world celebrates, families in Gaza face unimaginable hardship. We’re launching a campaign to deliver 500 food packages to those in need. \n\nEvery share and every dollar matters. \ntogether, we can make a difference.",
        "Weight": 4,
        "Id": 34
    },
    {
        "URL": "https://x.com/LailaAlarian/status/1871944222343061827",
        "Date": "25/12/2024",
        "Text": "Palestinian babies like Silla Al-Faseeh are freezing to death because they’re being forced by Israel to stay in flimsy tents and under tarps in freezing temperatures. What a racist cruel world that has allowed this.",
        "Weight": 8,
        "Id": 38
    },
    {
        "URL": "https://x.com/UNLazzarini/status/1871584739226005876",
        "Date": "24/12/2024",
        "Text": "Another sad #Christmas for people in #Gaza & in other parts of the region \n\nIt’s time for peace \nIt’s time for courage\n\n#CeasefireNOW \n",
        "Weight": 4,
        "Id": 41
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1871887064075309390",
        "Date": "25/12/2024",
        "Text": "This Christmas I’m thinking of Palestinian Christians like \n@KhalilJeries\n.\n\nHis beloved father and sister were killed by Israel’s genocide.\n\nThroughout he’s shown moral clarity, courage and determination which always leaves me in awe.\n\n",
        "Weight": 13,
        "Id": 47
    },
    {
        "URL": "https://x.com/KhalilJeries/status/1871665810235875550",
        "Date": "24/12/2024",
        "Text": "You know whose Christmas isn't as merry, the Christian families like mine whose family members were killed by your military in Gaza. You are a despicable liar and war criminal",
        "Weight": 4,
        "Id": 48
    },
    {
        "URL": "https://x.com/marcowenjones/status/1871633344523620639",
        "Date": "24/12/2024",
        "Text": "The \n@ADL\n are sharing a photo depicting Israeli fans chasing Amsterdam residents in the context of a \"pogrom\" on Jews. This photo has been misused so many times -the original photographer \n@iAnnetnl\n has spent much effort correcting it - it shows Maccabi Tel Aviv fans on the attack",
        "Weight": 13,
        "Id": 49
    },
    {
        "URL": "https://x.com/oxfamgb/status/1871613279552020959",
        "Date": "24/12/2024",
        "Text": "This year marks the second Christmas while Israel's war on Gaza continues. But the hope for peace and unity for Palestinians and Israelis alike remains as strong as ever. \n\nJoin us in demanding an immediate and permanent ceasefire:  http://bit.ly/3rRRJ8p",
        "Weight": 27,
        "Id": 51
    },
    {
        "URL": "https://x.com/miqdaad/status/1871541507993518240",
        "Date": "24/12/2024",
        "Text": "The BBC finally acknowledges it misled viewers when it used a video showing fans from Israeli football club Maccabi Tel Aviv attacking people on the street, whilst implying Israeli fans were the victims in the video\n\nhttps://bbc.co.uk/helpandfeedback/corrections_clarifications…",
        "Weight": 17,
        "Id": 53
    },
    {
        "URL": "https://x.com/souljagoytellem/status/1871241588577583440",
        "Date": "23/12/2024",
        "Text": "This anecdote from a Haaretz article about the psychology of IDF soldiers in Gaza should be the defining statement on the Gaza genocide",
        "Weight": 13,
        "Id": 54
    },
    {
        "URL": "https://x.com/YousefMunayyer/status/1871566784807293241",
        "Date": "24/12/2024",
        "Text": "US Ambassador to Israel: Israel can't be starving these people in that area because they have already ethnically cleansed it.",
        "Weight": 8,
        "Id": 57
    },
    {
        "URL": "https://x.com/muhammadshehad2/status/1871579768237515152",
        "Date": "24/12/2024",
        "Text": "Taqiyya ≠ lying\nAnd it’s not a Muslim thing\n\nIt’s a general ancient practice of persecuted religious minorities to merely hide their religion to avoid getting killed\n\nThat’s what the Jewish Queen Esther did in the Purim story\n\nChristians also did Taqiyya under the Roman Empire..",
        "Weight": 4,
        "Id": 58
    },
    {
        "URL": "https://x.com/johnmcdonnellMP/status/1870994869021544544",
        "Date": "23/12/2024",
        "Text": "Every day more scenes of horrific barbarity being perpetrated by Israel & of heartrending suffering being inflicted by the IDF on Palestinian children & our own country, supposedly a Christian country, fails to lift a finger to halt these crimes but sends the war criminals arms.",
        "Weight": 10,
        "Id": 59
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1871556863361446243",
        "Date": "24/12/2024",
        "Text": "A human is a human. I could cite polls which show that Israeli society is awash with the same genocidal mania you display as you support unspeakable crimes.\n\nYou, and other civilians, are still entitled to protection from violence.\n\nThis is why you and I are not the same.",
        "Weight": 10,
        "Id": 61
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1871525684096704860",
        "Date": "24/12/2024",
        "Text": "Well, this is revealing.\n\nIsraeli Defence Minister Israel Katz announced: \"We defeated Hamas.\"\n\nIn that way case, why is Israel still pummelling Gaza and massacring people?\n\nKatz has announced there is no military value in doing so. Therefore, a confession of war crimes.",
        "Weight": 36,
        "Id": 62
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1871548870381203563",
        "Date": "24/12/2024",
        "Text": "Always a pleasure to receive correspondence from Israel",
        "Weight": 4,
        "Id": 63
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1871546796620779849",
        "Date": "24/12/2024",
        "Text": "The Western media will never be forgiven for their role in Israel's genocide of the Palestinian people.\n\nNew post ",
        "Weight": 13,
        "Id": 64
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1871537669219779027",
        "Date": "24/12/2024",
        "Text": "I think a lot about these Palestinian children, who begged the world over a year ago to save them from violence and death.\n\nI wonder how many have been maimed and killed since, how many have lost loved ones.",
        "Weight": 4,
        "Id": 65
    },
    {
        "URL": "https://x.com/SaulStaniforth/status/1871126053659558252",
        "Date": "23/12/2024",
        "Text": "BBC News tells us that over 100,000 displaced Gazans are now living in Al Mawasi\n\nUNRWA estimates that over a million people (half the entire Gazan population) are now in Al Mawasi. Why can't BBCNews get its facts right? Read Owen Jones latest piece & you start to get an idea why",
        "Weight": 8,
        "Id": 66
    },
    {
        "URL": "https://x.com/4noura/status/1871455189288317298",
        "Date": "24/12/2024",
        "Text": "The media has been a key arm of genocide of the Palestinian people in Gaza. ⁦\n@owenjonesjourno\n⁩ investigates how that is happening at the ⁦\n@BBC\n⁩ in spite of internal revolt. \n\n#Gaza #Genocide #Nakba",
        "Weight": 22,
        "Id": 68
    },
    {
        "URL": "https://x.com/ta_mills/status/1871479993857135093",
        "Date": "24/12/2024",
        "Text": "Only now got to this. Detailed reporting from \n@owenjonesjourno\n on the BBC's systematic failings in its reporting on Israel's genocidal war on Gaza. Essential reading.",
        "Weight": 8,
        "Id": 69
    },
    {
        "URL": "https://x.com/AtifRashid_/status/1871246865800601693",
        "Date": "23/12/2024",
        "Text": "This headline in 2018 [left] was changed after the BBC received complaints from a pro-Israel group.  \n\nWhen I later raised this with someone from editorial policy, they told me they would've told the editor to stand by the original headline.",
        "Weight": 9,
        "Id": 70
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1871214515058364924",
        "Date": "23/12/2024",
        "Text": "All the evidence points to the Christmas Market attacker being an anti-Muslim far right sympathiser.\n\nBut for the growing far right, facts and reality don't matter.\n\nTheir strategy: scream a lie loudly enough so the truth is drowned out.\n\nNew post \n\nhttps://owenjones.news/p/german-terrorist-attack-conspiracy…",
        "Weight": 5,
        "Id": 73
    },
    {
        "URL": "https://x.com/ireallyhateyou/status/1870564704307020014",
        "Date": "21/12/2024",
        "Text": "Some more normalized looting by Israelis:\n\"A guitar from Gaza that plays great\"\nAn item for sale on Facebook marketplace, offered by an Israeli by the name of Yaniv Idzon, for 450 Shekels ($123)\n\nIdzon added: \"From Khan Younis. A great instrument\"",
        "Weight": 23,
        "Id": 74
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1871153511339048964",
        "Date": "23/12/2024",
        "Text": "If we can’t stop the genocide in Gaza, the least we can do is bear witness to the crime.\n\nA stunning column from \n@NesrineMalik\n, a titan of moral clarity as ever.",
        "Weight": 9,
        "Id": 78
    },
    {
        "URL": "https://x.com/maryam_dh/status/1871109623299588259",
        "Date": "23/12/2024",
        "Text": "The BBC’s Gaza coverage has fallen disgracefully short. “One journalist watched a broadcast and was horrified to see their report stripped of details about dead children.” Must read  By ⁦\n@owenjonesjourno\n⁩",
        "Weight": 4,
        "Id": 79
    },
    {
        "URL": "https://x.com/AbdelA1924/status/1870978108368785421",
        "Date": "22/12/2024",
        "Text": "This is a collective feeling in the Palestinian diaspora. Survivors guilt, sadness, and helplessness have defined our emotions",
        "Weight": 4,
        "Id": 80
    },
    {
        "URL": "https://x.com/AjAqrabawi/status/1870977318694629648",
        "Date": "22/12/2024",
        "Text": "My heart feels so heavy. It appears everyone has accepted death in Gaza. I never imagined a world so cruel.",
        "Weight": 4,
        "Id": 82
    },
    {
        "URL": "https://x.com/battleforeurope/status/1871088562764185751",
        "Date": "23/12/2024",
        "Text": "If the Western media had shown 0.1% of the unspeakable horror that has unfolded in Gaza over the past year, it would have been over a long time ago. Fully complicit in genocide.",
        "Weight": 9,
        "Id": 92
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870963469547348272",
        "Date": "22/12/2024",
        "Text": "The starving cats of Gaza are eating the bodies of Palestinians killed by an Israeli air strike.\n\nIf you are someone who backed Israel’s mass slaughter of Gaza, you are a monster, and you need to know that. https://x.com/ihabhassane/st/ihabhassane/status/1870956733000290576…",
        "Weight": 28,
        "Id": 97
    },
    {
        "URL": "https://x.com/VictorKattan/status/1870884697796133085",
        "Date": "22/12/2024",
        "Text": "“One staffer believes the BBC has largely sought to align its journalism with the UK government’s foreign policy. As far as top brass is concerned, “Israel is treated like Ukraine, Palestinians like Russia,” the staffer said.”",
        "Weight": 12,
        "Id": 100
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870932660551582187",
        "Date": "22/12/2024",
        "Text": "It's the \"beginning of the end for the Zionist colonialist project in Palestine.\"\n\nThat's according to Israeli historian Ilan Pappé in my new interview \n\nhttps://youtube.com/watch?v=16EjsiOyb_s…",
        "Weight": 17,
        "Id": 102
    },
    {
        "URL": "https://x.com/newmanjmary/status/1870550196532453789",
        "Date": "21/12/2024",
        "Text": "“We’ve got to all remember that this all started on 7 October”: \n@deborahturness\n, CEO of BBC News, from \n@owenjonesjourno\n's exposé for \n@DropSiteNews\n.\n\nI heard the same ignorant pronouncement and observed the same pattern of pro-Israeli bias \n@CBCNews\n.",
        "Weight": 13,
        "Id": 106
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870522209694884157",
        "Date": "21/12/2024",
        "Text": "The terrorist suspect in Germany's Christmas Market attack has been exposed.\n\nHe's a far right anti-Muslim pro-Israel extremist.\n\nAn extremist who supported the very anti-Muslim bigots who opportunistically jumped on this crime \n\nhttps://youtube.com/watch?v=es38RDlBZO8…",
        "Weight": 14,
        "Id": 112
    },
    {
        "URL": "https://x.com/Yonatan_Touval/status/1870086938935603508",
        "Date": "20/12/2024",
        "Text": "@Netanyahu\n’s decision to skip the 80th #Auschwitz liberation anniversary (fearing arrest in Poland over The Hague warrant) is good news for anyone who values #Holocaust memory. For he is one of the #Shoah’s most cynical abusers, relativizers, and defamers.",
        "Weight": 3,
        "Id": 117
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870487738195021943",
        "Date": "21/12/2024",
        "Text": "A message to Western journalists.\n\nStop being cowards.\n\nOther than those still cheering on this depravity - who should be treated as disgraced moral pariahs:\n\nYou know Israel's genocide is one of the worst crimes of our age.\n\nYour silence is complicity. Do something - now.",
        "Weight": 11,
        "Id": 120
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870484833753030843",
        "Date": "21/12/2024",
        "Text": "This is just disgusting bile from this nasty, glorified troll.\n\nNot a single BBC journalist mentioned that the online Middle East editor is Jewish.\n\nIt's not mentioned even once in my piece.\n\nThey are criticising his record as online Middle East editor.",
        "Weight": 4,
        "Id": 121
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870484835791155344",
        "Date": "21/12/2024",
        "Text": "If you want to see what a disgusting pack of lies these smears are, read the piece.\n\nThis constant attempt to conflate Israel and Jewish people by the likes of \n@stephenpollard\n is disgusting and self-evidently dangerous.",
        "Weight": 8,
        "Id": 122
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870482012823560265",
        "Date": "21/12/2024",
        "Text": "So the suspected terrorist who attacked the German Christmas market is a far-right, anti-Muslim, pro-Israel fanatic.\n\nMany of the accounts who jubilantly jumped on this attack as anti-Muslim fodder have had their bigotry approvingly reposted by the suspect in question.",
        "Weight": 14,
        "Id": 123
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870464764184547514",
        "Date": "21/12/2024",
        "Text": "Appropriately, in this Daily Telegraph attack on my research into the BBC's Israel coverage, the top rated comment refers to me being beaten up...\n\n...by an actual neo-Nazi whose whom was full of Nazi flags and Nazi death skulls.\n\n(He was imprisoned for 2 years and 9 months)",
        "Weight": 10,
        "Id": 126
    },
    {
        "URL": "https://x.com/rivkahbrown/status/1870441683869208985",
        "Date": "21/12/2024",
        "Text": "Quite embarrassing watching liberal commentators try to distract from Owen Jones' 9,000-word, months-long investigation on the BBC and Gaza by obsessing over him accidentally liking a comment underneath it. Thankfully, most people are not as weird and petty as James Ball.",
        "Weight": 4,
        "Id": 127
    },
    {
        "URL": "https://x.com/PSCupdates/status/1870436247866347626",
        "Date": "21/12/2024",
        "Text": "“Most people with a conscience here have found that the coverage is frankly despicable and certainly not up to our editorial standards.”\nComprehensive analysis from \n@owenjonesjourno\n of BBC's systemic Pro Israel bias.",
        "Weight": 4,
        "Id": 130
    },
    {
        "URL": "https://x.com/derJamesJackson/status/1870269950490800609",
        "Date": "21/12/2024",
        "Text": "The terrorist supported Greater Israel  https://x.com/noamagid/statu/noamagid/status/1870213776726790265…",
        "Weight": 9,
        "Id": 132
    },
    {
        "URL": "https://x.com/ScotNational/status/1870167924293411139",
        "Date": "20/12/2024",
        "Text": "'The BBC’s coverage of Israel’s genocide in Gaza is “frankly despicable”.\n\n'The person I’m quoting here is a BBC journalist, one of 13 whistleblowers who spoke to me as part of a newly published investigation.' \n\n\n@owenjonesjourno\n shares all ",
        "Weight": 13,
        "Id": 137
    },
    {
        "URL": "https://x.com/Hamza_a96/status/1870152101206053337",
        "Date": "20/12/2024",
        "Text": "If you read one thing over the weekend, let it be this thorough investigation by \n@owenjonesjourno\n for \n@DropSiteNews\n on the systemic pro-Israel bias at the heart of the BBC's despicable coverage in the last 15 months.",
        "Weight": 9,
        "Id": 139
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1805343172723163529",
        "Date": "24/06/2024",
        "Text": "There aren't lies?\n\n1) The Observer was briefed that Thangam Debonnaire could given a place in the Lords if she loses to the Greens.\n\n2) Debonnaire abstained on a ceasefire in Gaza in November.\n\nShe voted for Labour's watered down ceasefire motion *136 days* into the slaughter.",
        "Weight": 4,
        "Id": 142
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870132162474762751",
        "Date": "20/12/2024",
        "Text": "Yes, I'm obsessed with fighting a genocide being facilitated by my government. Guilty!\n\nThis is not something be ashamed of.\n\nIt is the people who stayed silent, or who cheered on this abomination, who should be ashamed.\n\nThey will never scrub the shame away. https://x.com/mccormicky/sta/mccormicky/status/1870124858715127978…",
        "Weight": 5,
        "Id": 145
    },
    {
        "URL": "https://x.com/joanna_allan/status/1870021535240430061",
        "Date": "20/12/2024",
        "Text": "An amazing piece of investigative journalism by \n@owenjonesjourno\n on BBC's despicable coverage of Gaza genocide. It also includes a great analysis of language - would be great to teach with this",
        "Weight": 9,
        "Id": 146
    },
    {
        "URL": "https://x.com/schneiderhome/status/1870118536695197914",
        "Date": "20/12/2024",
        "Text": "Important piece of reporting by \n@owenjonesjourno\n into how the BBC - and particularly the BBC news website - has covered Israel's war on Gaza with systematic bias towards Israel.\n\nLong but worth your time.",
        "Weight": 12,
        "Id": 149
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870102538877550820",
        "Date": "20/12/2024",
        "Text": "I'll stop doing these videos when Israel stops committing genocide with Western complicity.\n\nDeal?",
        "Weight": 9,
        "Id": 152
    },
    {
        "URL": "https://x.com/metca002/status/1870090679348580411",
        "Date": "20/12/2024",
        "Text": "Owen Jones's forensic exposure of the BBC's consistent and ongoing Israeli bias while that country commits war crimes on a daily basis can read here:",
        "Weight": 20,
        "Id": 154
    },
    {
        "URL": "https://x.com/mmachch/status/1870058189305065589",
        "Date": "20/12/2024",
        "Text": "Must read analysis of \n@BBCNews\n bias on Israel/Palestine & staff pushback: “We’ve never known the racism to be so overt,” “Most people with a conscience here have found that the coverage is frankly despicable and certainly not up to our editorial standards.”",
        "Weight": 8,
        "Id": 155
    },
    {
        "URL": "https://x.com/Ben_Wray1989/status/1870096212554068217",
        "Date": "20/12/2024",
        "Text": "An absolute indictment of the BBC's coverage of the #GazaGenocide. The pro-Israel bias is systemic and shocking. The BBC is read the world over so it's deplorable coverage has a global impact.",
        "Weight": 18,
        "Id": 156
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870060937690132668",
        "Date": "20/12/2024",
        "Text": "Wild.\n\nAs well as abusing the very real evil of antisemitism, this man is calling for me to be hanged like Nazi leader Julius Streicher.",
        "Weight": 5,
        "Id": 160
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870058563021779289",
        "Date": "20/12/2024",
        "Text": "During one angry BBC editorial meeting, Deborah Turness - the CEO of BBC News - interjected;\n\n\"We’ve got to all remember that this all started on 7 October.\"\n\nBBC staff were \"livid\" - and the former head of the BBC World Service rebuked her \n\nhttps://dropsitenews.com/p/bbc-civil-war-gaza-israel-biased-coverage…",
        "Weight": 8,
        "Id": 162
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870047694326034796",
        "Date": "20/12/2024",
        "Text": "In BBC coverage, mentions of Israeli and Palestinians deaths competed for space since 7th October.\n\nThat's despite far more Palestinian deaths.\n\nThere's one exception - a huge spike in the mentions of Palestinian deaths in early April.\n\nThe reason for this should disturb you.",
        "Weight": 24,
        "Id": 164
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870047698188996895",
        "Date": "20/12/2024",
        "Text": "So the only time you get a spike in the mention of Palestinian deaths by the BBC is because several Westerners were killed, and a Palestinian was killed alongside them.\n\nWhat a hideously chilling indictment of how the BBC considers the value of life.",
        "Weight": 8,
        "Id": 165
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1870047699719880791",
        "Date": "20/12/2024",
        "Text": "You can read our full investigation into the BBC's internal revolt over its pro-Israel coverage ",
        "Weight": 9,
        "Id": 166
    },
    {
        "URL": "https://x.com/jeremyscahill/status/1870030993437942113",
        "Date": "20/12/2024",
        "Text": "It's really incredible that this is BBC World's online Middle East editor.\n\nRead \n@owenjonesjourno\n new exposé for \n@DropSiteNews\n on the civil war in the BBC over its Gaza coverage:\n\nhttps://dropsitenews.com/p/bbc-civil-war-gaza-israel-biased-coverage…",
        "Weight": 12,
        "Id": 173
    },
    {
        "URL": "https://x.com/DropSiteNews/status/1869871810021343708",
        "Date": "19/12/2024",
        "Text": "Here’s the price Owen Jones is paying for holding the BBC accountable. Nearly £20,000 in legal fees for exposing how their coverage of Israel’s genocide in Gaza is often just “systematic Israeli propaganda.” https://x.com/owenjonesjourn/owenjonesjourno/status/1869863334398636214…",
        "Weight": 21,
        "Id": 177
    },
    {
        "URL": "https://x.com/BrianKMurphy2/status/1869853006663160076",
        "Date": "19/12/2024",
        "Text": "Owen Jones investigation of the BBC’s coverage of Israel’s unrelenting assault on Gaza, based on interviews with 13 journalists and other BBC staffers,  offering remarkable insights into how senior BBC figures  skewed stories in favor of Israel.",
        "Weight": 12,
        "Id": 179
    },
    {
        "URL": "https://x.com/DropSiteNews/status/1869827373883097454",
        "Date": "19/12/2024",
        "Text": "NEW from \n@DropSiteNews\n: The BBC's Civil War Over Gaza\n\nA landmark investigation by \n@owenjonesjourno\n into BBC’s Gaza coverage. Interviews with 13 journalists and staffers reveal how senior figures skewed stories for Israel and dismissed internal objections",
        "Weight": 12,
        "Id": 187
    },
    {
        "URL": "https://x.com/jeremyscahill/status/1869825844841197738",
        "Date": "19/12/2024",
        "Text": " The BBC is facing an internal revolt over its reporting on Israel’s war on Gaza.\n\nIn a \n@DropSiteNews\n exclusive, \n@owenjonesjourno\n spoke to 13 current and former BBC staffers.",
        "Weight": 8,
        "Id": 188
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1869825284196958297",
        "Date": "19/12/2024",
        "Text": "The BBC is in civil war over Israel and Palestine.\n\nBBC journalists are in revolt over what they call \"systematic Israeli propaganda\" churned out by the Corporation.\n\nMy exclusive investigative piece for \n@DropSiteNews\n ",
        "Weight": 16,
        "Id": 189
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1869782184737083641",
        "Date": "19/12/2024",
        "Text": "Israel's genocide in Gaza is a multi-pronged offensive against the viable existence of the Palestinian people.\n\nAs \n@hrw\n conclude, depriving Palestinians of adequate access to water is just one genocidal act.\n\nThose with power and influence who refuse to speak out are a disgrace. https://x.com/hrw/status/186/hrw/status/1869609986222968873…",
        "Weight": 25,
        "Id": 196
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1869782976491671650",
        "Date": "19/12/2024",
        "Text": "At the beginning of the genocide, \n@Keir_Starmer\n backed Israel's right to cut off water to Gaza.\n\nNow \n@hrw\n have concluded the attack on water is itself a genocidal act.\n\nStarmer must never be allowed to wash the shame away.",
        "Weight": 13,
        "Id": 197
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1869784136891936990",
        "Date": "19/12/2024",
        "Text": "Or what about \n@EmilyThornberry\n?\n\nWhen asked if Israel was cutting off water was against international law, she said \"Israel has an absolute right to defend itself.\"\n\nThis is now established as an act of genocide.\n\nShe will never wash the shame away.",
        "Weight": 13,
        "Id": 198
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1869707649564188732",
        "Date": "19/12/2024",
        "Text": "Israeli soldiers are competing with each other of how many civilians they can kill in Gaza.\n\nThey are then classifying their victims as 'terrorists'.\n\nWhat does it take until everyone accepts this is genocide. Literally what.\n\nhttps://haaretz.com/israel-news/2024-12-18/ty-article-magazine/.premium/idf-soldiers-expose-arbitrary-killings-and-rampant-lawlessness-in-gazas-netzarim-corridor/00000193-da7f-de86-a9f3-fefff2e50000…",
        "Weight": 35,
        "Id": 201
    },
    {
        "URL": "https://x.com/AssalRad/status/1869267000075374916",
        "Date": "18/12/2024",
        "Text": "We really went from “Israel wouldn’t attack a hospital” to Israel relentlessly attacks hospitals so much that most of the media ignores it’s even happening.",
        "Weight": 8,
        "Id": 203
    },
    {
        "URL": "https://x.com/IhabHassane/status/1869496849255813544",
        "Date": "18/12/2024",
        "Text": "HORRIBLE: This Israeli army drone-fired bullet was removed yesterday from the body of a 7-year-old injured child in Gaza. The bullet had penetrated his left chest and lodged in his back, causing a spinal cord injury that left him permanently paralyzed.",
        "Weight": 12,
        "Id": 214
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1869477088266518818",
        "Date": "18/12/2024",
        "Text": "The BBC news website stands accused by its own journalists of systematic pro-Israel bias.\n\nTomorrow, my detailed investigation based on the testimonies of 12 BBC journalists is published by \n@DropSiteNews\n.\n\nAnd here's the story that started the investigation off.",
        "Weight": 9,
        "Id": 216
    },
    {
        "URL": "https://x.com/Palestine_UN/status/1869436505913233854",
        "Date": "18/12/2024",
        "Text": "At the Security Council meeting today, on Res. 2334, Ambassador Dr. Riyad Mansour rejected the antisemitism accusation and deflection:",
        "Weight": 3,
        "Id": 219
    },
    {
        "URL": "https://x.com/NaksBilal/status/1868992933170757721",
        "Date": "17/12/2024",
        "Text": "Israel’s pariah status will only deepen as the months go on; it’s impossible to overstate how deeply unliked Israel is in the UK, which is often confused with the position of some elites who believe there is NatSec strategic benefit to allying with a country accused of genocide.",
        "Weight": 13,
        "Id": 221
    },
    {
        "URL": "https://x.com/derJamesJackson/status/1869312391412117985",
        "Date": "18/12/2024",
        "Text": "Bild describes these messages of Palestinian Lives Matter and Never Again for Everyone as “hidden Jew-hate”",
        "Weight": 6,
        "Id": 223
    },
    {
        "URL": "https://x.com/LailaAlarian/status/1869148223040082314",
        "Date": "17/12/2024",
        "Text": "Ok this is wild. As Israeli bombs shredded Palestinian bodies in attacks on UNRWA schools where displaced people were sheltering, \n@nytimes\n published Israeli claims the schools were used by Hamas. But it never verified the documents it claims prove this.",
        "Weight": 24,
        "Id": 224
    },
    {
        "URL": "https://x.com/muhammadshehad2/status/1869317023957963152",
        "Date": "18/12/2024",
        "Text": "Israeli bombs are VAPORIZING the bodies of Gazan victims, UN confirms\n\nUN's OCHA recorded an incident where dozens of bodies were vaporized by Israeli bombs dropped on \"the safe humanitarian zone\" just \"like Nagasaki\"\n\nSimilar incidents previously reported by 1st responders",
        "Weight": 20,
        "Id": 225
    },
    {
        "URL": "https://x.com/Alonso_GD/status/1869201849167057345",
        "Date": "18/12/2024",
        "Text": "The State of Palestine had nothing to do with Oct 7 and, in fact, unlike Israel, despite facing attacks by Israeli terrorist groups that kill, injure & attack its citizens, it has not invoked a right to attack Israel in retaliation and kill tens of thousands of its people",
        "Weight": 25,
        "Id": 228
    },
    {
        "URL": "https://x.com/NourNaim88/status/1869093683213328628",
        "Date": "17/12/2024",
        "Text": "\"Salsabeel\nAseel\nHadeel\nBaraa\nMohammed\"\n\nMy friend Nasreen Shteiwi’s children, all killed together by the Israeli army in #Gaza. Nasreen and her husband are critically injured and urgently need treatment abroad.\n\nSPEECHLESS ",
        "Weight": 12,
        "Id": 232
    },
    {
        "URL": "https://x.com/Hamza_a96/status/1869138990638768365",
        "Date": "17/12/2024",
        "Text": "Remember this? This was as Israel lied about Hamas control centres before raiding Al-Shifa Hospital and turning it into a mass grave.\n\nDon’t ever forget the role British journalists played in enabling Israel’s genocide.",
        "Weight": 17,
        "Id": 233
    },
    {
        "URL": "https://x.com/KimJohnsonMP/status/1868968076966056246",
        "Date": "17/12/2024",
        "Text": "The UK refused entry for medical treatment to Ahmed - a 4 year old from Gaza who lost both his legs and most of his family in an Israeli air strike.\n\nHe’s now receiving vital treatment in Italy; why won’t the UK offer the same?\n\nOver 50 MPs have written to the Prime Minister ",
        "Weight": 12,
        "Id": 238
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1869031443869118784",
        "Date": "17/12/2024",
        "Text": "The reason Ireland is taking its stance on Israel/Palestine is straightforward:\n\nIreland was conquered, colonised, murderously subjugated, starved by the British.\n\nThat breeds a level of empathy and solidarity beyond most other European nations, many of which were colonisers.",
        "Weight": 13,
        "Id": 239
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1869032777309671497",
        "Date": "17/12/2024",
        "Text": "Israel's cheerleaders keep opportunistically claiming that opponents of Israel's depraved crimes are antisemitic.\n\nThis is grossly irresponsible, because antisemitism is an extremely real evil, and their cynicism will lead some to dangerously conclude antisemitism doesn't exist.",
        "Weight": 19,
        "Id": 240
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1869033110501048606",
        "Date": "17/12/2024",
        "Text": "We're being told Ireland is doing more than other Western nations to take a stand against one of the most obscene crimes of our age because it is racist.\n\nA classic case study in the attempt by Israel's apologists to turn the world on its head.",
        "Weight": 6,
        "Id": 241
    },
    {
        "URL": "https://x.com/DropSiteNews/status/1868784820056473675",
        "Date": "16/12/2024",
        "Text": "NEW from \n@DropSiteNews\n: The Last Two Weeks Have Been the Most Dire in Gaza War: Hospital Director\n\nKamal Adwan Hospital in northern Gaza \"will turn into a graveyard for everyone inside\" amid ongoing Israeli attacks. \n\nStory by Herman Gill (\n@darkchild417\n)",
        "Weight": 16,
        "Id": 252
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868726309851185231",
        "Date": "16/12/2024",
        "Text": "This cynical attempt to conflate Israel's crimes and Jewish people is disgustingly irresponsible behaviour.",
        "Weight": 10,
        "Id": 255
    },
    {
        "URL": "https://x.com/MariamBarghouti/status/1868413323789922627",
        "Date": "15/12/2024",
        "Text": "So much footage I have seen come out of Gaza is mothers yelling\n\nوين ولادي؟\n\n“Where are my children?”",
        "Weight": 4,
        "Id": 257
    },
    {
        "URL": "https://x.com/rozina_ali/status/1867992391325544876",
        "Date": "14/12/2024",
        "Text": "Gaza is currently facing what many experts call an “amputee crisis”: it has the biggest cohort of children amputees in history. Now it appears that the last remaining orthopedic surgeon has been killed",
        "Weight": 4,
        "Id": 258
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868650128703430742",
        "Date": "16/12/2024",
        "Text": "My months long investigative report on the BBC’s coverage of Israel and Palestine drops this week.\n\nIt is based on interviews with several BBC journalists, and devastating data. \n\nIt will explain why we end up with diabolical framing like this. \n\nStay tuned \n@DropSiteNews",
        "Weight": 8,
        "Id": 261
    },
    {
        "URL": "https://x.com/leylahamed/status/1868582483471843357",
        "Date": "16/12/2024",
        "Text": "Khaled’s birthday, which he shared with his granddaughter Reem, is next week. She would have been 5 years old.\n\nIsrael killed him today. https://x.com/leylahamed/sta/leylahamed/status/1732170382021419313…",
        "Weight": 4,
        "Id": 264
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868632834120044706",
        "Date": "16/12/2024",
        "Text": "Israel's most depraved lie has been utterly buried by a devastating new report.\n\nNew post ",
        "Weight": 4,
        "Id": 266
    },
    {
        "URL": "https://x.com/LailaAlarian/status/1868446659912540211",
        "Date": "16/12/2024",
        "Text": "This many Palestinians being killed in one day doesn’t merit a breaking news alert. It’s barely a footnote. We have lost our humanity.",
        "Weight": 8,
        "Id": 269
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868595344591982970",
        "Date": "16/12/2024",
        "Text": "It is screamingly obvious that both the US and Israel preferred for Assad to stay in power in his permanently weakened state.",
        "Weight": 4,
        "Id": 270
    },
    {
        "URL": "https://x.com/OmarBaddar/status/1868487209277358434",
        "Date": "16/12/2024",
        "Text": "Killing dozens of Palestinians & stealing Syrian land is basically an average Sunday for Israel.\n\nThere will be a reckoning for all this one day.",
        "Weight": 12,
        "Id": 271
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868429992193057097",
        "Date": "15/12/2024",
        "Text": "Genuine solidarity with the oppressed is unconditional, always.",
        "Weight": 5,
        "Id": 276
    },
    {
        "URL": "https://x.com/Ahmed_hassan_za/status/1868422710671642900",
        "Date": "15/12/2024",
        "Text": "This light is not sunrise in Syria. This is light from an Israeli bomb explosion.",
        "Weight": 8,
        "Id": 277
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868408231825113355",
        "Date": "15/12/2024",
        "Text": "\"Deep disagreements\" such as \"Israel wants to keep committing genocide\" and \"Ireland wants Israel to stop committing genocide\".",
        "Weight": 18,
        "Id": 279
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868395329726681523",
        "Date": "15/12/2024",
        "Text": "Israel wants Palestinians gone from Gaza and the West Bank, and works backwards from that point, assessing what it thinks it can get away with to that end at each moment.",
        "Weight": 16,
        "Id": 281
    },
    {
        "URL": "https://x.com/tksshawa/status/1868026069242024405",
        "Date": "14/12/2024",
        "Text": "Whether that has actually helped Palestinians is another question, but the sentiment is a product of the world’s failure to intervene against Israeli apartheid and genocide. It’s a condemnation of the international community as a whole that has abandoned palestinians.",
        "Weight": 29,
        "Id": 282
    },
    {
        "URL": "https://x.com/mattlieb/status/1868009997743075521",
        "Date": "14/12/2024",
        "Text": "This is incredible. British Christian lady meets chabadniks for the first time and thinks she’s the victim of an antisemitic hate crime ",
        "Weight": 3,
        "Id": 287
    },
    {
        "URL": "https://x.com/BenJamalpsc/status/1868316510965645583",
        "Date": "15/12/2024",
        "Text": "He's really not bothering to hide anymore the conflation of antisemitism with action to hold Israel to account for its crimes. Tho he tries to cloak his clear intent here behind a spurious argument that the State of Ireland and \n@amnesty\n are trying to change the definition of ...",
        "Weight": 9,
        "Id": 288
    },
    {
        "URL": "https://x.com/ori_goldberg/status/1868299291263197448",
        "Date": "15/12/2024",
        "Text": "Irish followers, I hope you wear Israel's decision to shut down its embassy in Dublin as a badge of honor. Ireland's commitment to truth and justice stands in stark contrast to my country's flight from morals and humanity. You are our true friends. Erin go Bragh ",
        "Weight": 4,
        "Id": 289
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868290458214183270",
        "Date": "15/12/2024",
        "Text": "It should be Western countries who are closing their embassies in Israel.",
        "Weight": 4,
        "Id": 290
    },
    {
        "URL": "https://x.com/SaulStaniforth/status/1868272066706964665",
        "Date": "15/12/2024",
        "Text": "Hadash MP \n@ofercass\n explains to \n@owenjonesjourno\n how legislation to amend Israeli Basic Law will effectively ban candidates standing for election who are critical of Israels genocide, apartheid & the ongoing occupation.\n\nWatch the full interview here: https://youtube.com/watch?v=_Tc1Yw3-8Yc…",
        "Weight": 22,
        "Id": 291
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868272752924201062",
        "Date": "15/12/2024",
        "Text": "Israel's invasion of Syria exposes its impunity and Western hypocrisy.\n\nA masterclass, as ever, on the current horrors from \n@OmarBaddar\n \n\nhttps://youtube.com/watch?v=QxyWktTm0fs…",
        "Weight": 4,
        "Id": 292
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868242979334619374",
        "Date": "15/12/2024",
        "Text": "“I fear for my life”.\n\nThe incredibly courageous Israeli politician \n@ofercass\n talks to me about the horror of Israeli fascism \n\nhttp://youtu.be/_Tc1Yw3-8Yc",
        "Weight": 16,
        "Id": 295
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1868225110781682042",
        "Date": "15/12/2024",
        "Text": "Looking forward to the most celebrated Palestinian historian being savaged as an imperialist lackey by a certain type of Western edgelord",
        "Weight": 4,
        "Id": 296
    },
    {
        "URL": "https://x.com/muhammadshehad2/status/1867855519328694631",
        "Date": "14/12/2024",
        "Text": "Israel murdered every single person in this picture; the whole Habbash family.\n\nAhmad (back to the left) was my engineering classmate & friend. He was extremely considerate, sweet, polite & decent.\n\nIsrael bombed the family in a refugee tent!",
        "Weight": 8,
        "Id": 300
    },
    {
        "URL": "https://x.com/Hamza_a96/status/1867723803255877954",
        "Date": "14/12/2024",
        "Text": "“Palestinians say” - f*** you \n@BBC",
        "Weight": 8,
        "Id": 301
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1867696522282119599",
        "Date": "13/12/2024",
        "Text": "Here, Emily Thornberry says Labour should push a commitment to arrest Netanyahu if he comes to the UK.\n\nLaudable stuff, but at the very start of Israel's genocide, \n@EmilyThornberry\n legitimised the very war crimes detailed in Netanyahu's arrest warrant.",
        "Weight": 21,
        "Id": 304
    },
    {
        "URL": "https://x.com/paulwellerHQ/status/1867548871976538390",
        "Date": "13/12/2024",
        "Text": "Today's the day... 'Gig For Gaza', a humanitarian fundraiser will be taking place at the \n@O2AcademyBrix\n ",
        "Weight": 4,
        "Id": 305
    },
    {
        "URL": "https://x.com/Charles_Lister/status/1867625195847995815",
        "Date": "13/12/2024",
        "Text": "NEW -- the #Assad-appointed #Syria Ambassador to the UN has issued his first letter to the UNSC whilst acting under the authority of the #HTS-led transition.\n\nIt's a formal complaint regarding #Israel's violation of sovereignty & the 1974 agreement.",
        "Weight": 4,
        "Id": 307
    },
    {
        "URL": "https://x.com/NaksBilal/status/1867630259669246147",
        "Date": "13/12/2024",
        "Text": "The Permanent Representative of Syria to the UN, on instruction from the new HTS-led government, has called on the UN Security Council to “take firm and immediate measures to oblige Israel to stop its ongoing attacks on Syrian territory […] and immediately withdraw.”",
        "Weight": 4,
        "Id": 308
    },
    {
        "URL": "https://x.com/ragipsoylu/status/1867627978869342357",
        "Date": "13/12/2024",
        "Text": "New Syrian government files a complaint to the UN Security Council, criticising the Israeli occupation near Golan Heights and the airstrikes targeting the civilian and military sites",
        "Weight": 13,
        "Id": 309
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1867483731901960196",
        "Date": "13/12/2024",
        "Text": "“Fringe cranks”?\n\nIf a moral giant like Gideon Levy is a “fringe crank” in today’s Israel, that’s a damning indictment of Israel and a badge of honour for him.",
        "Weight": 8,
        "Id": 312
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1867571755939713530",
        "Date": "13/12/2024",
        "Text": "Apparently I’m “the fringe of a fringe”.\n\nWhich is presumably why polling shows a large majority of Britons think Israel is guilty of war crimes, all arms sales should end, and Netanyahu should be arrested.\n\nPresumably why my videos have such a big reach? (The original complaint)",
        "Weight": 16,
        "Id": 314
    },
    {
        "URL": "https://x.com/SaulStaniforth/status/1867489467885396271",
        "Date": "13/12/2024",
        "Text": "The people history won't be kind to are the people who said nothing (or cheered) while Israel committed genocide. And that's not Owen Jones.",
        "Weight": 9,
        "Id": 316
    },
    {
        "URL": "https://x.com/BritPalCommitt/status/1867260169744527522",
        "Date": "12/12/2024",
        "Text": "Today BPC & UK Gaza Community held an urgent press conference about the catastrophic situation in northern Gaza, breaking the media blackout - that Israel’s systematic targeting of journalists has produced - with firsthand witness testimony from Gazans and healthcare workers.",
        "Weight": 16,
        "Id": 318
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1867519699241869645",
        "Date": "13/12/2024",
        "Text": "Which headings could come from the 'far-right' as well as 'far-left'?\n\nThe one accurately referring to the Israeli Finance Minister arguing Israel should halve Gaza's population?\n\nOr the one about the Israeli government backing a pro-Nazi Romanian politician?\n\nWhich ones?",
        "Weight": 26,
        "Id": 319
    },
    {
        "URL": "https://x.com/talhagin/status/1867468237015068847",
        "Date": "13/12/2024",
        "Text": "This video isn't from Gaza.\n\nIt was filmed in Baghdad, Iraq, as a skit by an Instagram user (x_hayder_r), on December 8, 2024.\n\nAlso, a showcase of how I verified the origin of the footage -  https://x.com/JewsAreTheGOAT/JewsAreTheGOAT/status/1867310253504864309…",
        "Weight": 12,
        "Id": 320
    },
    {
        "URL": "https://x.com/airwars/status/1867247313061818725",
        "Date": "12/12/2024",
        "Text": "NEW: How does the scale of harm in Gaza compare to other conflicts?\n\nOur new report presents a unique analysis of where and how thousands of civilians were killed in the first 25 days in Gaza - and how these patterns are unprecedented in modern warfare.",
        "Weight": 8,
        "Id": 321
    },
    {
        "URL": "https://x.com/History__Speaks/status/1867278421853970471",
        "Date": "12/12/2024",
        "Text": "1/20 The most important research on the \"war\" in Gaza—for which I was honoured to be a peer reviewer—was just published by \n@airwars\n. \n\nThis details their findings, which in my view expose the murderous and likely genocidal nature of the IAF's October 2023 bombing campaign.",
        "Weight": 4,
        "Id": 323
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1867326348521615424",
        "Date": "12/12/2024",
        "Text": "I would prefer not to focus on my government being complicit in genocide. \n\nIf Israel stops committing genocide and murderously oppressing Palestinians, my videos about this obscenity will stop.\n\nThis seems like a fair deal!",
        "Weight": 22,
        "Id": 325
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1867326857231970404",
        "Date": "12/12/2024",
        "Text": "The critique here is that my content about this utter abomination reaches a large audience.\n\nYes, it does, and cheerleaders of Israel’s genocidal onslaught can keep crying about it.",
        "Weight": 4,
        "Id": 326
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1867327593948553647",
        "Date": "12/12/2024",
        "Text": "“The problem with you, Owen, is you condemn genocide too loudly and too frequently.”\n\nYou know what, I’ll wear the criticism",
        "Weight": 5,
        "Id": 327
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1867325668532662749",
        "Date": "12/12/2024",
        "Text": "If the Israeli army were treated as “them”, this kind of footage would provoke mass nausea.\n\nBut the Israeli army is treated as “us”. And so there isn’t.",
        "Weight": 16,
        "Id": 328
    },
    {
        "URL": "https://x.com/suhasinih/status/1867017170674200643",
        "Date": "12/12/2024",
        "Text": "\"Like there was normal life next to Nazi extermination camps as well...Israelis are blind to the suffering right next to them in Gaza\": Levy",
        "Weight": 17,
        "Id": 331
    },
    {
        "URL": "https://x.com/Hipcescu/status/1867123224687137210",
        "Date": "12/12/2024",
        "Text": "Gaza is \"the size of east London, and is an apocalyptic wasteland; and yet just over the barrier, people are living rich, Western lives - going to sushi restaurants, dancing in clubs, getting drunk, going to festivals, doing their jobs.\"",
        "Weight": 4,
        "Id": 336
    },
    {
        "URL": "https://x.com/NaksBilal/status/1867240211442520233",
        "Date": "12/12/2024",
        "Text": "This is what Israel is trying to incite in northeastern/eastern Syria by the way.",
        "Weight": 4,
        "Id": 337
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1867235500228001840",
        "Date": "12/12/2024",
        "Text": "And what will you do when Israel continues to crush UNRWA into the dust while slaughtering its staff?\n\nOh, you’ll keep selling it weapons and then maybe do another sadface tweet for Israeli officials to have a good laugh at",
        "Weight": 12,
        "Id": 339
    },
    {
        "URL": "https://x.com/MacaesBruno/status/1867173846211776884",
        "Date": "12/12/2024",
        "Text": "I have a very hard time taking the people denouncing Assad’s abuses seriously if the same people have been silent for more than a year on Israel’s abuses. It’s just performance or careerism. No principles there",
        "Weight": 4,
        "Id": 340
    },
    {
        "URL": "https://x.com/DropSiteNews/status/1866943522609463346",
        "Date": "11/12/2024",
        "Text": "HTS spokesman Obeida Arnaout is asked by Channel 4 News about Israel’s strikes on over 300 sites in Syria (latest update: 480 strikes). He refused to denounce Israel’s massive airstrikes and ground incursions. When pressed, he offered vague, general comments.",
        "Weight": 8,
        "Id": 344
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866960900650869162",
        "Date": "11/12/2024",
        "Text": "Gaza and The Zone Of Interest.\n\nI will never forget this exchange with Gideon Levy for as long as I live.",
        "Weight": 4,
        "Id": 353
    },
    {
        "URL": "https://x.com/muhammadshehad2/status/1866742293325369543",
        "Date": "11/12/2024",
        "Text": "Bashar rescued from Assad's torture dungeons in Syria promptly reminded me of Badr, released from Israel's torture camp Sde Tieman\n\nBoth have seen hell on earth!\n\nOur pain is one, our freedom is one. Thrilled for our Syrian sisters & brothers, & hope our freedom will soon follow",
        "Weight": 4,
        "Id": 356
    },
    {
        "URL": "https://x.com/muhammadshehad2/status/1866867374760263735",
        "Date": "11/12/2024",
        "Text": "Just watched Jolani's full CNN interview; remarkable, but 2 words were strikingly missing: Israel & Gaza.\n\nExtremely unusual for an Arab leader to not even pay lip service to the Palestinian cause.\n\nThe interviewer mentioned Israel in passing, Jolani rushed to another topic!",
        "Weight": 16,
        "Id": 357
    },
    {
        "URL": "https://x.com/bartov_omer/status/1866754094611747166",
        "Date": "11/12/2024",
        "Text": "Why I resigned as chairman of Amnesty Israel",
        "Weight": 4,
        "Id": 361
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866851036574650610",
        "Date": "11/12/2024",
        "Text": "1) Assad wasn’t armed and backed by the West.\n\nIsrael’s genocide is directly facilitated by our governments. Hence the protests.\n\n2) The ICC has no jurisdiction in Syria because it’s not a member state. Palestine is, hence jurisdiction.\n\nYou’re welcome!",
        "Weight": 13,
        "Id": 363
    },
    {
        "URL": "https://x.com/mattduss/status/1866829472697118852",
        "Date": "11/12/2024",
        "Text": "Important to remember that with the fall of Assad and the crippling of Iran's resistance axis, for the US's  Middle East partners the key existential threat remains the same: Arab democracy.",
        "Weight": 2,
        "Id": 364
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866827623508173185",
        "Date": "11/12/2024",
        "Text": "Israel has invaded Syria.\n\nHere is another war of aggression - facilitated by Western governments and Western media outlets.",
        "Weight": 4,
        "Id": 366
    },
    {
        "URL": "https://x.com/flying_rodent/status/1866792039804965273",
        "Date": "11/12/2024",
        "Text": "I see we’re now at “Sky News wants jihadists to have a chemical weapon arsenal”. Do I hear a “BBC is praying for Iran to develop nuclear warheads”? Anyone? Going once, going twice",
        "Weight": 2,
        "Id": 368
    },
    {
        "URL": "https://x.com/LailaAlarian/status/1866633311227171077",
        "Date": "10/12/2024",
        "Text": "I know the world has decided that mass killing Palestinians is acceptable and not newsworthy but Anas reports that tonight has been one of the most difficult nights in north Gaza, from fire belt attacks to the killing of 30 members of a family outside of Kamal Adwan hospital.",
        "Weight": 12,
        "Id": 372
    },
    {
        "URL": "https://x.com/Hamza_a96/status/1866457658452312084",
        "Date": "10/12/2024",
        "Text": "Sky News reporting on Israel invading and bombing Syria using “Israel says” and “Israel denies”. \n\nIs this journalism?",
        "Weight": 12,
        "Id": 374
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866619903773463011",
        "Date": "10/12/2024",
        "Text": "There is no military value in blowing up the remnants of buildings in an apocalyptic wasteland.\n\nThe aim is clear: to eradicate Gaza of Palestinians forever.",
        "Weight": 12,
        "Id": 375
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866612119392882838",
        "Date": "10/12/2024",
        "Text": "Israel has invaded Syria - and sought to crush the defensive capabilities of any new government.\n\nAll facilitated by Western governments and media outlets.\n\nNew post ",
        "Weight": 4,
        "Id": 376
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866579645904171508",
        "Date": "10/12/2024",
        "Text": "Interesting to be getting lots of 'why don't you go to Syria and live under HTS, see how long you last!\"\n\nLeaving aside that I don't support HTS, after a year of 'why don't you go to Gaza etc', is it really necessary to replicate every single Israeli talking point so crudely?",
        "Weight": 12,
        "Id": 377
    },
    {
        "URL": "https://x.com/DCIPalestine/status/1866562174048424002",
        "Date": "10/12/2024",
        "Text": "Her name was Dunia Abu Mohsen. She survived an Israeli airstrike that killed her family in Gaza, only to die days later when Israel shelled the hospital she was recovering in. We illuminated her story across London for #HumanRightsDay. This is genocide.",
        "Weight": 21,
        "Id": 378
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866565855443628290",
        "Date": "10/12/2024",
        "Text": "Remember Muhammed Bhar, the Palestinian man with Down's Syndrome who was killed by a dog set on him by the Israeli army?",
        "Weight": 12,
        "Id": 379
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866550800446832826",
        "Date": "10/12/2024",
        "Text": "Latest on “Israel wanted a fatally weakened Assad regime to fall”",
        "Weight": 4,
        "Id": 381
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866541298854879544",
        "Date": "10/12/2024",
        "Text": "Israel has invaded Syria.\n\nThe failure of the Western media to refer to an invasion is nothing other than disinformation.\n\nA lie by omission is still a lie. You are being lied to.",
        "Weight": 4,
        "Id": 383
    },
    {
        "URL": "https://x.com/marcowenjones/status/1866513968443089262",
        "Date": "10/12/2024",
        "Text": "\"Not only did Syria not play an active role in the \"resistance front,\" but Assad prevented pro-Iranian militias from attacking Israel from its territory and ignored Israel's airstrikes on Iranian targets in Syria\" https://haaretz.com/middle-east-news/2024-12-10/ty-article/.premium/iran-may-be-disappointed-at-assads-forced-exit-but-it-still-hasnt-given-up-on-syria/00000193-ad9a-d79d-a397-bf9b5a830000…",
        "Weight": 18,
        "Id": 386
    },
    {
        "URL": "https://x.com/mehdirhasan/status/1866253679986184234",
        "Date": "09/12/2024",
        "Text": "\"The message to Israel is that this needs to stop, What we are seeing in the Golan is a violation of the 1974 agreement. This is a very serious issue.\"\n\nThe UN's Syria Special Envoy tells me on 'Mehdi Unfiltered' that Israel's unlawful actions in Syria need to stop.",
        "Weight": 8,
        "Id": 387
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866487248210067541",
        "Date": "10/12/2024",
        "Text": "This is so screamingly obvious.\n\nIsrael preferred the pre-uprising status quo: a permanently weakened Assad regime.\n\nThey fear the potential of a post-Assad Syria, which is why they are destroying the military capabilities they left untouched under Assad.",
        "Weight": 4,
        "Id": 388
    },
    {
        "URL": "https://x.com/Nassreddin2002/status/1866000239120797797",
        "Date": "09/12/2024",
        "Text": "How can one see this and still be like: Israel only wants peace?\n\nUnprovoked attack on Syrian soil, the same day a regime has ended\n\nAnd to all tankies out there, apparently Israel is more afraid for a free Syria than an Assadist Syria. So put down that “Israel supports them” bs",
        "Weight": 12,
        "Id": 390
    },
    {
        "URL": "https://x.com/omarAlshogre/status/1865803335007429021",
        "Date": "08/12/2024",
        "Text": "The Israeli occupation and expansion in southern Syria is an important crime to end. We celebrate the fall of Assad and we don’t forget that he’s not the only oppressor.",
        "Weight": 18,
        "Id": 392
    },
    {
        "URL": "https://x.com/CentreDelas/status/1866463466661335177",
        "Date": "10/12/2024",
        "Text": "\"This is the most confessed crime in history, from Israeli leaders, politically and miltarily, down to soldiers who keep posting their crimes on TikTok\"\n\nListen to \n@owenjonesjourno\n and \n@olgarodriguezfr\n about genocide in Gaza",
        "Weight": 19,
        "Id": 393
    },
    {
        "URL": "https://x.com/ajplus/status/1866261804831142275",
        "Date": "09/12/2024",
        "Text": "“We wish for the genocide to end and experience your [liberation].” \n\nUnder Israel’s unrelenting bombardment, Palestinians in Gaza are celebrating Syria’s liberation after decades of oppression.",
        "Weight": 21,
        "Id": 397
    },
    {
        "URL": "https://x.com/jeremycorbyn/status/1866186517124710544",
        "Date": "09/12/2024",
        "Text": "As the people of Syria come out of the horrors of war, torture and imprisonment, I asked the Foreign Secretary what he was doing to protect the rights of Kurdish people, and whether he would call for an end to Israel's illegal occupation of the Golan Heights.",
        "Weight": 9,
        "Id": 403
    },
    {
        "URL": "https://x.com/Nassreddin2002/status/1866410553364668697",
        "Date": "10/12/2024",
        "Text": "Israel's army is only 25 km away from Damascus\n\nWhy are we allowing this rogue state to invade yet another country, without any kind of provocation?\n\nIsrael is now the biggest threat to peace and future stability in Syria and the West is just watching.",
        "Weight": 8,
        "Id": 404
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866163396401352774",
        "Date": "09/12/2024",
        "Text": "Israel has invaded Syria. \n\nWestern politicians have refused to condemn it - and have even backed it - and Western media outlets won’t even call it what it is.",
        "Weight": 4,
        "Id": 413
    },
    {
        "URL": "https://x.com/iyad_elbaghdadi/status/1866041132364566566",
        "Date": "09/12/2024",
        "Text": "Israel's immediate reaction to the fall of the Assad regime is mass bombardment of Syrian army bases and expansion into Syrian territory. This tells you two things:",
        "Weight": 4,
        "Id": 415
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1866145788205912180",
        "Date": "09/12/2024",
        "Text": "Israel repeatedly bombed Syria under Assad, without Assad firing a single shot against Israel, so what now?\n\nDo you honestly think the fall of Assad lacks popular support?\n\nAnd talk about projection. I'm a lifelong socialist. You were an actual Liberal Democrat for years.",
        "Weight": 8,
        "Id": 418
    },
    {
        "URL": "https://x.com/chiefchimpanzee/status/1864637061103305017",
        "Date": "05/12/2024",
        "Text": "Remember Sha’ban the 19 year old who was burned alive in the tent in October? Along with his mum? The one that David Mencer called Pallywood?\n\nWell his sister and brother died from their wounds too, and now more of the family has been wiped out by the IDF\n\nhttps://news.sky.com/story/heartbreaking-story-behind-video-of-young-man-burnt-to-death-in-medical-compound-after-israeli-strike-13234035…",
        "Weight": 8,
        "Id": 421
    },
    {
        "URL": "https://x.com/tksshawa/status/1864707034383253885",
        "Date": "05/12/2024",
        "Text": "When we hear about quadcopter/drone attacks, people tend to assume the killing is automated - a dystopian nightmare in its own right. But an Israeli drone operator saw a child in a wheel chair outside a hospital and opened fire. The act of pulling the trigger was a human one. https://x.com/DropSiteNews/s/DropSiteNews/status/1864704101285756952…",
        "Weight": 8,
        "Id": 425
    },
    {
        "URL": "https://x.com/3lfares/status/1864750907944001786",
        "Date": "05/12/2024",
        "Text": "Assadists in the replies are mad because a Palestinian in Gaza doesn’t stand up for Bashar al-Assad’s murderous regime",
        "Weight": 8,
        "Id": 426
    },
    {
        "URL": "https://x.com/NaksBilal/status/1864721187101630595",
        "Date": "05/12/2024",
        "Text": "Look at the way ‘pro-Palestine’ Tankies and Assadists are in the replies attacking Motasem, a Palestinian journalist currently battling through the genocide in Gaza, because he expressed happiness for Syrians who are almost free of a criminal regime not unlike Israel’s.",
        "Weight": 26,
        "Id": 427
    },
    {
        "URL": "https://x.com/haaretzcom/status/1864606891659456737",
        "Date": "05/12/2024",
        "Text": "A CNN report from Gaza played on Israel's Channel 13 showed starving women being crushed by desperate masses. But in Israel, people are still shocked by \"ethnic cleansing\" accusations / Yasmin Levy",
        "Weight": 12,
        "Id": 428
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1864740741815185411",
        "Date": "05/12/2024",
        "Text": "Would they go so far as to say the Israel state hasn’t committed war crimes at all?\n\nHow would they define a war crime?\n\nDo they think all the genocidal statements made by Israeli leaders and officials were just letting off steam?\n\nGenuinely curious",
        "Weight": 29,
        "Id": 430
    },
    {
        "URL": "https://x.com/Hamza_a96/status/1864455064330322381",
        "Date": "04/12/2024",
        "Text": "The BBC has no article on the Palestinians that were burnt alive in Gaza today as Israel bombed the al-Mawasi tent encampment. \n\nInstead, they’ve relegated it to a few lines in this article about the retrieval of an Israeli hostage. \n\nThe hierarchy of humanity for all to see.",
        "Weight": 24,
        "Id": 433
    },
    {
        "URL": "https://x.com/kadishjosh/status/1864596655695151518",
        "Date": "05/12/2024",
        "Text": "The “entertainers” doing shows in Tel Aviv over the last year say a lot about the genocidal mania that has swept Israeli society and Israel’s growing isolation — we went from drag queens to folks like Douglas Murray, Ben Shapiro, and Michael Rapaport.",
        "Weight": 13,
        "Id": 436
    },
    {
        "URL": "https://x.com/NaksBilal/status/1864586830735122683",
        "Date": "05/12/2024",
        "Text": "Assad was helping to free Palestine by imprisoning Palestinian refugees apparently.\n\nWould be laughable if it wasn’t so tragic.",
        "Weight": 8,
        "Id": 437
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1864638147457368220",
        "Date": "05/12/2024",
        "Text": "Apologists for Assad are now calling me 'Jihadi Jones', which is the exact same epithet I've had deployed against me by Israeli cheerleaders for the last 14 months.",
        "Weight": 8,
        "Id": 442
    },
    {
        "URL": "https://x.com/IhabHassane/status/1864513253205778683",
        "Date": "05/12/2024",
        "Text": "Khalil, along with his mother, was killed today in an Israeli airstrike on Al-Mawasi, Khan Yunis. His Facebook bio read, “One day, we will leave Gaza.”\n\nHamas has reduced the dreams of Gazan people to nothing more than the hope of escape.",
        "Weight": 20,
        "Id": 444
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1864452443607585126",
        "Date": "04/12/2024",
        "Text": "Israel is burning Palestinians alive in their tents, as it pounds an already apocalyptic wasteland, after 14 months of never ending slaughter.\n\nThis horror is now entirely normalised. \n\nNobody will ever listen to Western claims about morality ever again.",
        "Weight": 12,
        "Id": 447
    },
    {
        "URL": "https://x.com/PDeepdive/status/1863541495925453076",
        "Date": "02/12/2024",
        "Text": "\"JUST DO IT NOW!\"\n\nFormer Speechwriter for UN Secretary General Ban Ki-moon \n@MarkSeddon1962\n Demands the UN to Immediately Take Aid into Gaza.\n\n\n@AlnaouqA",
        "Weight": 4,
        "Id": 448
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1864393712802882045",
        "Date": "04/12/2024",
        "Text": "There was mass outrage from Joe Biden and the Western media about claims of beheaded Israeli babies on 7th October.\n\nThese claims were obscene lies.\n\nMeanwhile these same people express zero outrage at the relentless beheading of actual babies by Israeli weapons. https://x.com/HossamShabat/s/HossamShabat/status/1864382818396057979…",
        "Weight": 16,
        "Id": 453
    },
    {
        "URL": "https://x.com/jeremyscahill/status/1864387252542927286",
        "Date": "04/12/2024",
        "Text": "Anas reports that this is the moment Israeli strikes hit the tent encampment for displaced people in Al Mawasi. At least 20 people killed",
        "Weight": 8,
        "Id": 454
    },
    {
        "URL": "https://x.com/ori_goldberg/status/1864363453621674421",
        "Date": "04/12/2024",
        "Text": "Yet again Israel bombs the \"safe zone\" of Al-Mawasi, where it had forced Gazans to go without any kind of humanitarian aid. We are oblivious. The only reality we grant the Palestinians is the desire to kill us. The only reality we allow ourselves is their genocide.",
        "Weight": 21,
        "Id": 455
    },
    {
        "URL": "https://x.com/dahliasc/status/1864317070969634826",
        "Date": "04/12/2024",
        "Text": "Why there's no excuse for Israelis not knowing what's happening in Gaza - my analysis.",
        "Weight": 15,
        "Id": 456
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1864361978451365925",
        "Date": "04/12/2024",
        "Text": "The so-called 'ceasefire' in Lebanon was a farce from the start, rigged in favour of Israel.\n\nAnd Israel went and systematically violated it anyway.\n\nNew post ",
        "Weight": 8,
        "Id": 457
    },
    {
        "URL": "https://x.com/Etanetan23/status/1864033868719771706",
        "Date": "03/12/2024",
        "Text": "I spoke to the Committee to Protect Journalists as violence against journalists in Gaza reaches unprecedented levels. \n\n“They are being targeted not because they are criminals, but because they are practicing journalism.” \n@haaretzcom\n \n@pressfreedom",
        "Weight": 4,
        "Id": 458
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1864294916085493792",
        "Date": "04/12/2024",
        "Text": "If you want a refresher on who this guy is:\n\nHe declared that every baby in Gaza is \"an enemy\" on Israeli television earlier this year.",
        "Weight": 12,
        "Id": 462
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1864286400092270907",
        "Date": "04/12/2024",
        "Text": "My timeline is currently full of Palestinian accounts, and Syrian exiles who've spent the last 14 months focusing on Israel's genocide, emphasising Assad is a war criminal\n\nAnd then on the other hand, Western edgelords revising history to portray Assad as anti-imperialist fighter",
        "Weight": 13,
        "Id": 465
    },
    {
        "URL": "https://x.com/ori_goldberg/status/1863933791858786328",
        "Date": "03/12/2024",
        "Text": "1/ Israel is shocked to hear that our newly appointed military attachè to Belgium, Col. Moshe Tetro, who served as coordinator of IDF civilian-related activities in Gaza, may be investigated for war crimes. He authorized and denied food entry into Gaza. --->",
        "Weight": 24,
        "Id": 467
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1863913966381994030",
        "Date": "03/12/2024",
        "Text": "Israel is openly committing to perpetrating war crimes in Lebanon.\n\nBut given the Western media has refused to frame its coverage around a million previous Israeli confessions of war crimes, don't expect them to start doing it now.",
        "Weight": 36,
        "Id": 470
    },
    {
        "URL": "https://x.com/tamaraqiblawi/status/1863648661042802979",
        "Date": "02/12/2024",
        "Text": "A UNIFIL source tells CNN that Israel has breached its ceasefire agreement with Lebanon \"approximately 100\" times since the truce went into effect last Wednesday.",
        "Weight": 4,
        "Id": 477
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1863635336997277816",
        "Date": "02/12/2024",
        "Text": "Those of us who condemned Israel’s destruction of hospitals can, and will, denounce this as a grave war crime. \n\nHow are those of you who armed Israel - or stayed silent - as it destroyed hospitals going to speak out with any credibility?\n\nYour moral authority is dead",
        "Weight": 13,
        "Id": 480
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1863632582291734583",
        "Date": "02/12/2024",
        "Text": "Oh, a letter!\n\nI’m sure that’ll sort it out! \n\nIsrael has spent 14 months starving, besieging and carpet bombing Gaza.\n\nBut now Netantahyu is getting a politely written letter he’ll no doubt see the error of his ways and U-turn in seconds.\n\nIf only we’d thought of this sooner!",
        "Weight": 8,
        "Id": 481
    },
    {
        "URL": "https://x.com/matnashed/status/1863539909862068459",
        "Date": "02/12/2024",
        "Text": "Overnight, so called \"anti-Imperialists\" who instrumentalise the Pal cause to boost their popularity, return to whitewash the history of Assad's war crimes.\n\nMeanwhile, liberals who stay mum about Israel's genocide in Gaza regain their moral conscious as Syria re-enters the news.",
        "Weight": 25,
        "Id": 483
    },
    {
        "URL": "https://x.com/democracynow/status/1863580972479832066",
        "Date": "02/12/2024",
        "Text": "\"My brother slowed down the ethnic cleansing of north Gaza, and that's why he was taken out.\"\n\nWe mourn Mahmoud Almadhoun, who co-founded and helped run the Gaza Soup Kitchen, feeding Palestinians during Israel's brutal blockade. He was \"targeted and assassinated\" this weekend.",
        "Weight": 20,
        "Id": 485
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1863553189439541499",
        "Date": "02/12/2024",
        "Text": "If you denounce Assad, you're likely to get denounced as a pro-imperialist stooge by some\n\nThis would leave the vast majority of Palestinians labelled as 'pro-imperialist'\n\nPolling after the Syrian Revolution found 83% backed it, with just 9% backing Assad\nhttps://pcpsr.org/en/node/210",
        "Weight": 8,
        "Id": 488
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1863542661107310908",
        "Date": "02/12/2024",
        "Text": "Unless you’re Israel or Joe Biden’s son",
        "Weight": 4,
        "Id": 492
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1863535843987583395",
        "Date": "02/12/2024",
        "Text": "Those who cheered on and facilitated Israel's genocide must face a reckoning.\n\nIf they do not, then they will keep marching from crime scene to crime scene, their trail of death and destruction never ending.\n\nRead and subscribe here  https://owenjones.news/p/israel-is-ethnic-cleansing-gaza-admits…",
        "Weight": 17,
        "Id": 493
    },
    {
        "URL": "https://x.com/AssalRad/status/1863313435104333948",
        "Date": "01/12/2024",
        "Text": "\"Sedatives by the crate\": How Israelis can help their pets deal with the anxiety of war / Moshe Gilad\nhttps://haaretz.com/israel-news/2024-11-30/ty-article-magazine/.premium/sedatives-by-the-crate-how-israelis-can-help-their-pets-deal-with-the-anxiety-of-war/00000193-6ea9-d7ae-ad9f-eeafb6810000…",
        "Weight": 26,
        "Id": 494
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1863352060277608471",
        "Date": "01/12/2024",
        "Text": "Even the former head of Israel's army says Israel is perpetrating ethnic cleansing and war crimes.\n\nEverything opponents of Israel's genocidal onslaught said from the start has been proven hideously right.\n\nThe cheerleaders face total moral disgrace ",
        "Weight": 24,
        "Id": 497
    },
    {
        "URL": "https://x.com/IhabHassane/status/1863264990603419717",
        "Date": "01/12/2024",
        "Text": "Jabalia, Northern Gaza.  \nEthnic cleansing.",
        "Weight": 4,
        "Id": 500
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1862948988682428736",
        "Date": "30/11/2024",
        "Text": "From the start, those of us who opposed Israel's genocidal onslaught pointed to ethnic cleansing.\n\nWe were smeared and attacked as a result.\n\nHere's what I said on 13th October 2023.\n\nIsrael's former army chief now says it's ethnic cleansing.\n\nEverything we said was right.",
        "Weight": 8,
        "Id": 504
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1862936382458511423",
        "Date": "30/11/2024",
        "Text": "Israel's genocide makes terrorist violence in the West all but inevitable.\n\nAnyone stating this obvious truth will be smeared by those who facilitated the biggest radicalisation event in history.\n\nTough. It's the truth. New post\n\nhttps://owenjones.news/p/israels-genocide-makes-terrorist…",
        "Weight": 28,
        "Id": 506
    },
    {
        "URL": "https://x.com/NaksBilal/status/1862845302694146444",
        "Date": "30/11/2024",
        "Text": "Yaron Friedman writing for Israeli outlet, Maariv, says that Syria falling into the hands of the rebels bodes badly for Israel, arguing that Assad “is still the least bad from Israel’s point of view”.",
        "Weight": 16,
        "Id": 511
    },
    {
        "URL": "https://x.com/MacaesBruno/status/1862755232486232172",
        "Date": "30/11/2024",
        "Text": "Ex-IDF chief: Israel prefers that Assad stay in power | The Times of Israel",
        "Weight": 8,
        "Id": 512
    },
    {
        "URL": "https://x.com/NaksBilal/status/1862879714920034338",
        "Date": "30/11/2024",
        "Text": "Is there a reason why people do not ask this of Assad, who is in control of state materiel, manpower and the geographical areas next to the Golan Heights, but instead ask the people being bombed by Assad who are stationed over 500km away from Gaza?",
        "Weight": 4,
        "Id": 516
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1862587303262138482",
        "Date": "29/11/2024",
        "Text": "83% of plant life in Gaza has been destroyed.\n\nIsrael's genocide is making Gaza uninhabitable - and our media outlets are complicit by suppressing the truth.\n\nNew post ",
        "Weight": 17,
        "Id": 524
    },
    {
        "URL": "https://x.com/mehdirhasan/status/1862317326994927716",
        "Date": "29/11/2024",
        "Text": "Children in Gaza are starving right now because of your vetoes at the UN.",
        "Weight": 4,
        "Id": 526
    },
    {
        "URL": "https://x.com/bentreyf/status/1862442137280749568",
        "Date": "29/11/2024",
        "Text": "Gazans besieged in the northern city of Beit Lahiya describe seeing streets lined with decomposing and crushed corpses, and hearing the cries of those trapped beneath the rubble. With rescue personnel incapacitated, dogs are devouring the bodies.",
        "Weight": 4,
        "Id": 527
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1862552535254409681",
        "Date": "29/11/2024",
        "Text": "Let’s just test this to destruction.\n\nThis is a statement issued by Israeli general Ghassan Alian on 9th October 2023.\n\nHe’s in charge of the IDF’s civilian policies in occupied territories.\n\nDoes this show intent to commit war crimes, Jake?\n\nYes or no will do.",
        "Weight": 20,
        "Id": 528
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1862554804599378174",
        "Date": "29/11/2024",
        "Text": "Israeli’s political and military leaders told the world, from the very start, they were going to commit war crimes.\n\nThey then committed those war crimes every day, live streamed to the world.\n\nThat Israel has committed war crimes is a truth as obvious as “water is wet”.",
        "Weight": 48,
        "Id": 529
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1862554872878403938",
        "Date": "29/11/2024",
        "Text": "An expert in war crimes who believes Israel has not committed war crimes is like a biologist who thinks life began 6,000 years ago, or a physicist who thinks the earth is flat. \n\nThat is, a crank.",
        "Weight": 28,
        "Id": 530
    },
    {
        "URL": "https://x.com/bentreyf/status/1862548276236394675",
        "Date": "29/11/2024",
        "Text": "Shocking: experts in international law horrified by war crimes",
        "Weight": 12,
        "Id": 531
    },
    {
        "URL": "https://x.com/carnecrudaradio/status/1862542041861038109",
        "Date": "29/11/2024",
        "Text": "¿Por qué nadie hace nada por detener a Israel? \nEl periodista británico \n@owenjonesjourno\n responde a esta pregunta en un programa junto al \n@CentreDelas\n  \n\nPuedes ver o escuchar el podcast completo aquí: https://bit.ly/CENTREDELASBcnCCTour…",
        "Weight": 4,
        "Id": 532
    },
    {
        "URL": "https://x.com/MosabAbuToha/status/1862419644855812188",
        "Date": "29/11/2024",
        "Text": "Heartbreaking as always. This time my uncle Said Abu Toha, 83 years old and husband of my aunt, was found killed in the street in Gaza. Said went missing on Nov 5.\nI’m heartbroken. This list is growing. Shame on the world.",
        "Weight": 4,
        "Id": 534
    },
    {
        "URL": "https://x.com/3lfares/status/1862271349865025757",
        "Date": "28/11/2024",
        "Text": "The vast majority of Palestinians think Bashar al-Assad is a piece of shit  \n\nAre most Palestinians ”pro-Israel” according to you? ",
        "Weight": 25,
        "Id": 535
    },
    {
        "URL": "https://x.com/piercepenniless/status/1862136876213182540",
        "Date": "28/11/2024",
        "Text": "Given the unwillingness of much of the press to be forthright about Palestine, and Britain's diplomatic and military complicity, it is both rational and important that it is so central to \n@owenjonesjourno\n's work of late. The implicit argument is grim as well. >",
        "Weight": 4,
        "Id": 542
    },
    {
        "URL": "https://x.com/AyyashMohannad/status/1862175586850156848",
        "Date": "28/11/2024",
        "Text": "We're supposed to believe this pathological liar of a state when it claims it detected \"terrorist activity\" & attacked in response.\n\nWhat \"ceasefire\" means for Israel is that it gets to kill more Lebanese people & destroy more Lebanese villages without any resistance in return.",
        "Weight": 9,
        "Id": 544
    },
    {
        "URL": "https://x.com/SaulStaniforth/status/1862145992532828521",
        "Date": "28/11/2024",
        "Text": "\"I understand especially when you are Jewish or Palestinian or Arab why you feel so connected to this conflict and really being hurt and upset... I don't understand why you are so angry about that\"",
        "Weight": 8,
        "Id": 547
    },
    {
        "URL": "https://x.com/jackseale/status/1862106032408776843",
        "Date": "28/11/2024",
        "Text": "The New European, sensible and moderate as ever: \"it is remarkable\" for a commentator to focus on Gaza because, like, they're British? And it's not happening in Britain? This makes them basically the same as rightwing demagogues! I am very smart",
        "Weight": 4,
        "Id": 550
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1862100784013296074",
        "Date": "28/11/2024",
        "Text": "I see I've made the 'Shit List' of the magazine of choice for very divorced dads.\n\nIts editor has always been a big fan of mine.\n\nHere's how he responded when I went on Question Time in 2012 and opposed Israel's onslaught against Gaza - and mentioned being violently mugged.",
        "Weight": 8,
        "Id": 551
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1862102999406956740",
        "Date": "28/11/2024",
        "Text": "So, as I suspected, \n@TheNewEuropean\n's objection is my work on Israel's genocide in Gaza.\n\nWhy is it remarkable that I'd oppose my government's complicity in genocide?\n\n(The description of the tweet is wilfully disingenuous, of course)",
        "Weight": 18,
        "Id": 553
    },
    {
        "URL": "https://x.com/ZackPolanski/status/1861776951452524699",
        "Date": "27/11/2024",
        "Text": "Who ever said in disguse?\n\nWe have a Labour Prime Minister tweeting pictures about deals with BlackRock whilst choosing policies that keep children in poverty,  demonise people on benefits & continue to arm a genocide.\n\nLabours absolute lurch to the right is no disguise.",
        "Weight": 5,
        "Id": 557
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1861807110205411471",
        "Date": "27/11/2024",
        "Text": "Legally illiterate from Macron, and he knows it.\n\nNeither Russia nor Israel are \"a party to the court\".\n\nUkraine and Palestine are. The ICC issued arrest warrants for crimes committed in these signatory states.\n\nThe West continues trashing an already imploding international order",
        "Weight": 10,
        "Id": 562
    },
    {
        "URL": "https://x.com/halalflow/status/1861547739231740022",
        "Date": "26/11/2024",
        "Text": "This Giving Tuesday, support independent journalism. \n@DropSiteNews\n has delivered outstanding reporting on Pakistan, Gaza, & Lebanon. Consider donating : \"A group of our most dedicated supporters has already committed $100,000 in matching funds\"",
        "Weight": 4,
        "Id": 563
    },
    {
        "URL": "https://x.com/TameeOliveFern/status/1861478375157629258",
        "Date": "26/11/2024",
        "Text": "They beat a Palestinian to death, in the context of 76+ years of brutal occupation & apartheid, and she calls it “overreactions” ",
        "Weight": 9,
        "Id": 564
    },
    {
        "URL": "https://x.com/ZackPolanski/status/1861440499061543055",
        "Date": "26/11/2024",
        "Text": "This is so utterly ludicrous.\n\nWhy would the Jewish Labour movement - a group standing alongside a government enabling genocide - comment on training within the Green Party?\n\nWho do they think they are? As if they're some moral authority when they've got Luke Akehurst as an MP!",
        "Weight": 9,
        "Id": 565
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1861528005106946245",
        "Date": "26/11/2024",
        "Text": "Very revealing from Israel's President.\n\nHe says: \"It must be clear The State of Israel will defend its citizens any time, any place, any way.\"\n\nWell, no actually.\n\nYou can't launch military actions \"any way\". You can't commit war crimes.\n\nWhich you know, but keep doing anyway.",
        "Weight": 20,
        "Id": 566
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1861520030162137282",
        "Date": "26/11/2024",
        "Text": "Israel's apologists sink further into the gutter.\n\nA gruesome combination here of lies, distortions, omissions and atrocity denial. \n\nAnd a toxic and frankly unhinged conflation of the Israeli state and the Jewish people.",
        "Weight": 16,
        "Id": 567
    },
    {
        "URL": "https://x.com/Alonso_GD/status/1861408144770978098",
        "Date": "26/11/2024",
        "Text": "Yes but see Palestine is, and the war crimes and crimes against humanity you have cheered on for over a year were committed in Palestine. This is not complicated.",
        "Weight": 22,
        "Id": 568
    },
    {
        "URL": "https://x.com/KenRoth/status/1861406671756501190",
        "Date": "26/11/2024",
        "Text": "If Israeli generals want to avoid International Criminal Court war-crime charges themselves, they had better start resisting illegal orders from the top to bomb and starve Palestinian civilians in Gaza. I explain:",
        "Weight": 16,
        "Id": 569
    },
    {
        "URL": "https://x.com/ftvhope/status/1861399502705320169",
        "Date": "26/11/2024",
        "Text": "10 ISRAELI AIRSTRIKES ON DAHYE IN BEIRUT RN AT THE SAME TIME ",
        "Weight": 8,
        "Id": 570
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1861372185878626698",
        "Date": "26/11/2024",
        "Text": "1,410 entire Palestinian families exterminated by Israel. \n\nFrom babies and teenagers to parents to great grandparents.\n\nIf one extended family was wiped out in Britain, it would be headline news for weeks.\n\nIt’s happened 1,410 times in Gaza, with a much smaller population.",
        "Weight": 12,
        "Id": 573
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1861375370177442227",
        "Date": "26/11/2024",
        "Text": "This Tory activist is a sociopath. \n\nThere is in fact overwhelming evidence of Israel using Palestinians as human shields:\n\nhttps://cnn.com/cnn/2024/10/24/middleeast/palestinians-human-shields-israel-military-gaza-intl…\n\nGiven Gaza has been razed to the ground, claiming the slaughter of entire families is due to “human shields” is deranged nonsense",
        "Weight": 32,
        "Id": 574
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1861345580305240383",
        "Date": "26/11/2024",
        "Text": "Trump's choice for US Ambassador to Israel, Mike Huckabee, says those deemed Israel's \"enemies\" are cursed by God.\n\nThat means this devout evangelical Christian thinks Christian Palestinians are cursed by God \n\nhttps://owenjones.news/p/donald-trumps-fanatical-pro-israeli…",
        "Weight": 29,
        "Id": 577
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1861333454580793367",
        "Date": "26/11/2024",
        "Text": "This is Israel's finance minister advocating to \"thin out\" Gaza's population to halve it within two years.\n\nIsrael's leaders could not have been clearer about their intent, all the way through this horror.\n\nThat our media refused to frame their coverage accordingly is a scandal.",
        "Weight": 12,
        "Id": 578
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1861327077225505169",
        "Date": "26/11/2024",
        "Text": "Even more Tory voters than not support the arrest of Benjamin Netanyahu if he sets foot in Britain.\n\nOpposition is, overall, a fringe opinion.\n\nThe political and media consensus behind Israel’s genocidal mayhem never reflected the views of the British public.",
        "Weight": 4,
        "Id": 579
    },
    {
        "URL": "https://x.com/dandoon_danya/status/1861067422138028034",
        "Date": "25/11/2024",
        "Text": "What a disgusting headline from the paper of genocide the New York Times. \"Surviving Gaza\"? As if Gaza is itself the genocidal force that is maiming children and not the zionist settler state that is hellbent on erasing and disabling Palestinians inside and outside of Gaza.",
        "Weight": 30,
        "Id": 586
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1861059046620406152",
        "Date": "25/11/2024",
        "Text": "Donald Trump has appointed multiple pro-Israel fanatics to his administration.\n\nBiden already facilitated Israel's genocide from day one.\n\nTrump will escalate it further.\n\nNew post - subscribe here ",
        "Weight": 18,
        "Id": 590
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1861030643745862041",
        "Date": "25/11/2024",
        "Text": "If the ICC arrest warrants are so meaningless - then why is the Israeli state panicking about them?\n\nMy interview with the ever brilliant \n@Alonso_GD\n on why the arrest warrants show the world order is being transformed.\n\nWatch here! \n\nhttps://youtube.com/watch?v=RApBgp4JjSc…",
        "Weight": 8,
        "Id": 592
    },
    {
        "URL": "https://x.com/PeterCronau/status/1860804131621122413",
        "Date": "24/11/2024",
        "Text": "Western media \n@ABCnews\n won’t touch this story\n\n Israel allying with ISIS affiliated militants to starve Gaza\n“Even though some of the clans' members are involved in terrorism & some are even affiliated with extremist organizations like Islamic State”",
        "Weight": 8,
        "Id": 597
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860836405036867902",
        "Date": "25/11/2024",
        "Text": "Erasing the fact that Palestinians in, say, Gaza or the West Bank have no say over their Israeli oppression, being elected by your own people doesn’t given you a mandate to commit war crimes and crimes against humanity against other people.",
        "Weight": 34,
        "Id": 598
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860800903063691410",
        "Date": "24/11/2024",
        "Text": "I’m not religious, but if I was these depraved pricks would be haunted by the souls of the slaughtered Palestinians they dehumanised until the end of time",
        "Weight": 8,
        "Id": 601
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860787301644726704",
        "Date": "24/11/2024",
        "Text": "You can tell someone lacks a moral compass and they’re trying to avoid angering a progressive audience they depend on for clicks when they make Israel’s genocide about Netanyahu.\n\nSure, pretend this deranged depravity is all about one bogeyman to escape searching questions",
        "Weight": 9,
        "Id": 606
    },
    {
        "URL": "https://x.com/kadishjosh/status/1859469785001509326",
        "Date": "21/11/2024",
        "Text": "The Israeli opposition",
        "Weight": 8,
        "Id": 607
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860746745694539985",
        "Date": "24/11/2024",
        "Text": "Israel is allying to ISIS affiliated criminal gangs to starve Gaza.\n\nYou can read about this in the Israeli press.\n\nWhy isn't this splashed on front pages in the West?\n\nNew post ",
        "Weight": 16,
        "Id": 612
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860441167164322082",
        "Date": "23/11/2024",
        "Text": "This is a classic example of projection from Israeli newspaper Yedioth Ahronoth.\n\nAccuses the ICC of gangsterism, as it threatens gangsterism.\n\nThe final sentence in the article?:\n\n\"The court must know that it has no choice but to withdraw the warrants, or else.\"",
        "Weight": 8,
        "Id": 615
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860437975416328289",
        "Date": "23/11/2024",
        "Text": "Journalists at big media outlets often get very snotty about smaller rivals.\n\nYou can see that in attacks on \n@ScotNational\n.\n\nBut The National is one of the only outlets to tell the truth about Israel's genocide.\n\nSo where does that leave the big outlets?",
        "Weight": 9,
        "Id": 616
    },
    {
        "URL": "https://x.com/Alonso_GD/status/1860319362701279343",
        "Date": "23/11/2024",
        "Text": "The “dangerous precedent” narrative is so tired. This isn’t new. Dozens of countries have prosecuted leaders for atrocity crimes. Israel isn’t the exception. The exception is impunity; usually reserved for the West. They are mad that they are not being granted said exceptionality",
        "Weight": 6,
        "Id": 619
    },
    {
        "URL": "https://x.com/TimaSa713/status/1859658780881138170",
        "Date": "21/11/2024",
        "Text": "Oct7 justifies everything, any means to get to Hamas, even if it's on top of the bodies of 14k children. We have no right to call that out because *they* started it. But this same argument was used to justify Oct7. Either the civilians on the other side are people or they are not",
        "Weight": 4,
        "Id": 620
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860355606789386240",
        "Date": "23/11/2024",
        "Text": "Israel is plotting to colonise Gaza.\n\nThis is all being openly discussed in the Israeli media.\n\nIt is a damning indictment that Israeli newspapers offer more details of what's actually happening than newspapers in, say, the US or UK.\n\nNew post ",
        "Weight": 24,
        "Id": 621
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860340921843204116",
        "Date": "23/11/2024",
        "Text": "I dare say that my articles infuriate readers who are, say, Christian or non-believers too.\n\nWhat is exactly is meant by \n@JewishNewsUK\n here?\n\nThat I have written articles which are antisemitic? Where?\n\nTry answering without offering up \"challenging Israel's war crimes.\"",
        "Weight": 23,
        "Id": 624
    },
    {
        "URL": "https://x.com/ScotNational/status/1860263773854138678",
        "Date": "23/11/2024",
        "Text": "'The Western media treated deceit, deflection and gaslighting by Israel’s authorities as though they were credible, despite objective overwhelming evidence about their never-ending lies' // \n@owenjonesjourno\n ",
        "Weight": 4,
        "Id": 627
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860052787343818791",
        "Date": "22/11/2024",
        "Text": "This really sums it up.\n\nWhen it comes to the misdemeanours of the poor, Keir Starmer will speak up.\n\nWhen it comes to the genocidal mayhem being perpetrated by a Western ally - Israel - with British weapons and support, Keir Starmer will stay silent.",
        "Weight": 4,
        "Id": 632
    },
    {
        "URL": "https://x.com/GaryLineker/status/1860019708667527549",
        "Date": "22/11/2024",
        "Text": "This: Sport may be a blunt tool of social change, but it’s time to take a stand against Israel | Sport politics | The Guardian",
        "Weight": 4,
        "Id": 633
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860048638011146298",
        "Date": "22/11/2024",
        "Text": "Apologists for Israel have sought to redefine genocide to mean \"immediately exterminate all members of an ethnic group\".\n\nBy this definition, there has never been a genocide in human history.",
        "Weight": 14,
        "Id": 634
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1860014413073514983",
        "Date": "22/11/2024",
        "Text": "No wonder Keir Starmer had gone quiet.\n\nThe ICC arrest warrants against Israeli leaders leave him exposed as an accomplice to genocide.\n\nNew post ",
        "Weight": 13,
        "Id": 639
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1859971504685125652",
        "Date": "22/11/2024",
        "Text": "Hungary is ruled by Europe's most antisemitic regime.\n\nThe fact this quasi-dictatorship is Europe's first government to invite Benjamin Netanyahu to visit in solidarity underpins, again, that basic fact:\n\nCheerleading Israeli war crimes and opposing antisemitism aren't the same.",
        "Weight": 26,
        "Id": 641
    },
    {
        "URL": "https://x.com/maryam_dh/status/1859911706572402990",
        "Date": "22/11/2024",
        "Text": "‘Israel’s genocidal onslaught is the most obscene example of how western supremacy is riddled with grotesque hypocrisies.’ By ⁦\n@owenjonesjourno\n⁩",
        "Weight": 4,
        "Id": 644
    },
    {
        "URL": "https://x.com/PhilipProudfoot/status/1859576815272046955",
        "Date": "21/11/2024",
        "Text": "Keep adding evidence to \n@archivegenocide\n -- we have over 40,000 permanently stored examples of political and journalistic complicity.",
        "Weight": 5,
        "Id": 646
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1859756550350569503",
        "Date": "22/11/2024",
        "Text": "Israeli leaders who support war crimes oppose accountability for the said war crimes.\n\nMore as we have it!",
        "Weight": 32,
        "Id": 648
    },
    {
        "URL": "https://x.com/MarkKersten/status/1859704943491547553",
        "Date": "21/11/2024",
        "Text": "\"Today’s decision could prove to be a sea change, where the west’s “double standards and conditional commitment to international law will be put to the highest test at the hands of an emerging global south”. - \n@Alonso_GD\n  https://theguardian.com/commentisfree/2024/nov/21/icc-arrest-warrants-israel-atrocities-benjamin-netanyahu-yoav-gallant?CMP=Share_iOSApp_Other… via \n@owenjonesjourno\n #ICC",
        "Weight": 4,
        "Id": 650
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1859698584146567475",
        "Date": "21/11/2024",
        "Text": "When the ICC took action against Putin’s war crimes, Starmer issued this rousing tweet.\n\nNow the ICC issues arrest warrants against Britain’s ally, nothing.\n\nThis man is a moral disgrace, and there’s no evidence he sees Palestinians as humans with lives of any worth whatsoever.",
        "Weight": 20,
        "Id": 654
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1859685208980910406",
        "Date": "21/11/2024",
        "Text": "No one cares.\n\nThe litmus test is whether you oppose some of the worst crimes of our age, not whether you like Netanyahu or not.\n\nYou failed the test. You go down in a history, if you’re remembered at all, as a monster.\n\nYour choice. Your decision. Your consequences https://x.com/JewishWonk/sta/JewishWonk/status/1859659943353384972…",
        "Weight": 10,
        "Id": 655
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1859695024277241975",
        "Date": "21/11/2024",
        "Text": "What angers me most here is how irresponsible this behaviour is.\n\nAntisemitism is a grave evil. It is on the rise. It must be fought.\n\nThis attempt to redefine it to mean “opposing war crimes” is literally dangerous.",
        "Weight": 15,
        "Id": 656
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1859662455468851482",
        "Date": "21/11/2024",
        "Text": "Arrest warrants have been issued against Israel’s leaders for one of the worst crimes of our age.\n\nBut it’s not just Netanyahu and Gallant who should fear accountability.\n\nWestern politicians and media outlets facilitated this abomination.\n\nNew column ",
        "Weight": 6,
        "Id": 661
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1859600975264104886",
        "Date": "21/11/2024",
        "Text": "The Western media covered up Israel's explicit promises to commit grave war crime from day one.\n\nThis is the biggest journalistic scandal in modern history.\n\nToday, I'm launching my new project - BattleLines.\n\nClick to subscribe - and read the damning evidence for yourself.",
        "Weight": 9,
        "Id": 662
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1859602946947776667",
        "Date": "21/11/2024",
        "Text": "You can sign up to my Subst*ck, BattleLines, here.\n\nOne of the things I will be doing here is holding the Western media to account.\n\nThat includes for facilitating genocide ",
        "Weight": 5,
        "Id": 663
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1859575623364002077",
        "Date": "21/11/2024",
        "Text": "As the ICC finally issues arrest warrants for Israel’s leaders, here’s a promise.\n\nFor those who helped facilitate Israel’s genocide - Western politicians, media outlets, and journalists:\n\nWe will not rest until you are held accountable for the crime you helped commit.",
        "Weight": 13,
        "Id": 664
    },
    {
        "URL": "https://x.com/ryangrim/status/1859438680236003767",
        "Date": "21/11/2024",
        "Text": "The only Democrat to vote to restrict weapons shipments to Israel, from a state Trump won, up for reelection this coming cycle, is Jon Ossoff of Georgia",
        "Weight": 4,
        "Id": 665
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1859272133316079840",
        "Date": "20/11/2024",
        "Text": "Joe Biden is a lameduck president.\n\nHe can do what he wants without political consequences.\n\nHe’s chosen to veto a ceasefire because he is and always was an enthusiastic supporter and facilitator of Israel’s genocide.",
        "Weight": 9,
        "Id": 668
    },
    {
        "URL": "https://x.com/LailaAlarian/status/1858837134116892850",
        "Date": "19/11/2024",
        "Text": "Photos like this aren’t viral and don’t generate more outrage because of anti-Palestinian bigotry",
        "Weight": 4,
        "Id": 671
    },
    {
        "URL": "https://x.com/DropSiteNews/status/1858993891082674618",
        "Date": "19/11/2024",
        "Text": "We’ve added English subtitles to the video of the Mayor of Amsterdam expressing regret for using the words “pogrom” and “Jew-hunt” to describe the recent clashes in her city.",
        "Weight": 2,
        "Id": 674
    },
    {
        "URL": "https://x.com/DropSiteNews/status/1859140061171679479",
        "Date": "20/11/2024",
        "Text": "Owen Jones discusses Drop Site News’ latest report on how Israel is facilitating the looting of the meager aid it allows into Gaza.\n\nYou can read the Drop Site story in full here: https://dropsitenews.com/p/gaza-security-forces-ambush-gang?utm_campaign=post&utm_medium=web…\n\n\n@owenjonesjourno\n Youtube video: https://youtu.be/pPahBbPUN1c?si=Rh6uugIZYS5C5vUw…",
        "Weight": 12,
        "Id": 680
    },
    {
        "URL": "https://x.com/martinshawx/status/1858578627434344564",
        "Date": "18/11/2024",
        "Text": "Watch this video - everything Keir Starmer said about Vukovar is true many times over of Gaza today. Starmer knows it’s genocide.",
        "Weight": 9,
        "Id": 681
    },
    {
        "URL": "https://x.com/HossamShabat/status/1858675959265653203",
        "Date": "19/11/2024",
        "Text": "Israeli forces have prohibited the entry of tents into Gaza. As a result, people are living in makeshift shelters made of plastic and blankets, which have all been flooded due to the heavy rain.",
        "Weight": 12,
        "Id": 685
    },
    {
        "URL": "https://x.com/LaraFriedmanDC/status/1858856101216768357",
        "Date": "19/11/2024",
        "Text": "Conflating AIPAC & Jews — like conflating Israel & Jews — is textbook antisemitism.",
        "Weight": 15,
        "Id": 686
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1858872097407213798",
        "Date": "19/11/2024",
        "Text": "Israel is erasing Palestine from existence.\n\nYou’re not only failing to impose sanctions on them, you’re providing weapons to help them do so.",
        "Weight": 8,
        "Id": 687
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1858615103798866380",
        "Date": "18/11/2024",
        "Text": "The Israeli state slaughtered all of her beautiful cats.\n\nOur priority must be saving Palestinian humans, of course.\n\nBut I'm hardly alone in wondering how many defenceless animals have been slaughtered by Israel.\n\nWhere are all the animal welfare advocates?",
        "Weight": 16,
        "Id": 688
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1858859515707281720",
        "Date": "19/11/2024",
        "Text": "Read this from Gaza.\n\nDon't look away",
        "Weight": 4,
        "Id": 689
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1858631911851073727",
        "Date": "18/11/2024",
        "Text": "All journalists who speak out over Palestine get their careers threatened. \n\nMany of the journalists who don’t speak out just don’t care about Palestinians or see them as humans. \n\nThe rest are just cowards.",
        "Weight": 12,
        "Id": 690
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1858630143578628291",
        "Date": "18/11/2024",
        "Text": "Both Israel and its far right Western allies, are - in practise - working together to whip up anti-Muslim and anti-Arab racism in the West.\n\nThis is a rising threat to social cohesion that isn’t being addressed at all.",
        "Weight": 4,
        "Id": 691
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1858626610020151331",
        "Date": "18/11/2024",
        "Text": "Putin vetoing a resolution to protect civilian in Sudan is indeed shameful.\n\nThe problem is you’re arming and facilitating a genocide in Palestine, so you have literally no moral authority.\n\nYou helped burn down what remained of an international order, and now weep over the ashes",
        "Weight": 9,
        "Id": 692
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1858533745852035091",
        "Date": "18/11/2024",
        "Text": "This is just astonishing.\n\nThe Mayor of Amsterdam described the events in Amsterdam as a \"pogrom\".\n\nNow she retracts that, regrets erasing violence by Maccabi Tel Aviv fans - and how the narrative was used to demonise Dutch Muslims and Arabs.",
        "Weight": 1,
        "Id": 697
    },
    {
        "URL": "https://x.com/mo7medjbour/status/1858239255006306537",
        "Date": "17/11/2024",
        "Text": "Imagine Palestinian women are going through this process without anesthesia or painkillers, having to get up almost immediately to carry out evacuation orders immediately afterwards and move from one displacement to another",
        "Weight": 4,
        "Id": 700
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1858241342343688417",
        "Date": "17/11/2024",
        "Text": "Genocides are invariably justified by a belief that their victims pose an existential threat.\n\n“Either we kill them, or they will kill us”.\n\nThis is literally a cliched genocidal rationale throughout history.",
        "Weight": 5,
        "Id": 702
    },
    {
        "URL": "https://x.com/Hamza_a96/status/1858125369426981236",
        "Date": "17/11/2024",
        "Text": "Massacre after massacre in Gaza but the world seems to have moved on. Shameful.",
        "Weight": 4,
        "Id": 703
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1858200029061697746",
        "Date": "17/11/2024",
        "Text": "They’re going to call the Pope Hamas aren’t they",
        "Weight": 4,
        "Id": 704
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1858199234983374972",
        "Date": "17/11/2024",
        "Text": "Even for many opposed to Israel’s rampage, I wonder if a part of it goes like this: what Israel is doing can’t possibly really be as depraved as the evidence says, because it’s a Western ally, and if it was all true, you couldn’t see the West the same way ever again.",
        "Weight": 8,
        "Id": 706
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1857902403967684615",
        "Date": "16/11/2024",
        "Text": "You could literally use this argument to justify the 1994 Rwandan genocide.\n\nYou don’t see anyone saying “the Rwandan Patriotic Front brought the genocide on their own people by invading from Uganda in 1990.”\n\nYou would rightly regard them as depraved if they did",
        "Weight": 10,
        "Id": 709
    },
    {
        "URL": "https://x.com/3lfares/status/1857884808099119327",
        "Date": "16/11/2024",
        "Text": "”We didn’t commit a genocide but also look how good we are at doing genocide”",
        "Weight": 10,
        "Id": 711
    },
    {
        "URL": "https://x.com/Heidi__Matthews/status/1857413865497153662",
        "Date": "15/11/2024",
        "Text": "This is northern Gaza. Simply wanton destruction, a scorched earth policy with no conceivable military purpose. All the legal terms we’ve been using—necessity, distinction, proportionality—fall like dead leaves at our feet. That this is indulged by the west is soul twisting.",
        "Weight": 4,
        "Id": 714
    },
    {
        "URL": "https://x.com/KhalilJeries/status/1857864862442959051",
        "Date": "16/11/2024",
        "Text": "While you are at it Mr. Ambassador maybe you can explain to us why would it be “ the promise of God” for the zionist militants to ethnically cleanse Christians from their villages and in some cases destroy their churches in 1948 to establish a majority Jewish state?",
        "Weight": 9,
        "Id": 715
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1857876368975081765",
        "Date": "16/11/2024",
        "Text": "What are the private military contractors going to do when they discover Palestinians won’t accept being trapped in “gated communities” for all eternity",
        "Weight": 8,
        "Id": 716
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1857413551964504181",
        "Date": "15/11/2024",
        "Text": "The Western media erased the racist violence of Tel Aviv Maccabi hooligans in Amsterdam.\n\nThose thugs naturally felt emboldened, that they could get away with anything.\n\nHere are the consequences in Paris.",
        "Weight": 1,
        "Id": 728
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1857415760198402487",
        "Date": "15/11/2024",
        "Text": "There is a significant possibility these Israeli soldiers have been directly involved in war crimes and crimes against humanity.\n\nYet here they are, freely traveling to foreign countries to attack foreign citizens at football matches.",
        "Weight": 22,
        "Id": 729
    },
    {
        "URL": "https://x.com/paulwellerHQ/status/1856624650437939348",
        "Date": "13/11/2024",
        "Text": "Just Announced: More Artists for Gig for Gaza \n\nWe’re thrilled to announce that \n@Palomafaith\n has joined the lineup with rapper \n@Lowkey0nline\n hosting the evening. Alongside incredible performances, the night will also feature guest speakers and short films at \n@O2AcademyBrix\n\n\n1/3",
        "Weight": 4,
        "Id": 733
    },
    {
        "URL": "https://x.com/VictorKattan/status/1857165552713666904",
        "Date": "14/11/2024",
        "Text": "My thoughts on Sir Keir Starmer’s unhelpful comments in Parliament yesterday when he was responding to a question from an MP about genocide in Gaza.\n\n#Gaza \n#Gaza_Under_Attack \n#GazaGenocide‌",
        "Weight": 26,
        "Id": 734
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1857362084104749201",
        "Date": "15/11/2024",
        "Text": "They can’t even put “Israeli soldiers” here.\n\nInstead they become an intriguing new category, “people believed to be soldiers”",
        "Weight": 8,
        "Id": 735
    },
    {
        "URL": "https://x.com/marcowenjones/status/1857063163809718392",
        "Date": "14/11/2024",
        "Text": "Incredible really, \n@FRANCE24\n point out that \n@WSJ\n \n@BBCNewsnight\n and \n@CBSNews\n are still using the footage from \n@iAnnetnl\n - claiming it depicts antisemitism attacks when in fact it shows Maccabi Tel Aviv fans chasing and attacking Amsterdam residents. https://youtube.com/watch?v=cU4BLql_AhU…",
        "Weight": 4,
        "Id": 738
    },
    {
        "URL": "https://x.com/iAnnetnl/status/1857158164983976161",
        "Date": "14/11/2024",
        "Text": "It has now been more than 4 days since I complained to Sky News, and to their reporter Alice Porter, about the misuse of my footage of Maccabi Tel Aviv fans in Amsterdam on November 7. \n\nThey have not even had the courtesy to reply. \n\nShameful. \n@SkyNews\n @AlicePorterTV",
        "Weight": 1,
        "Id": 739
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1857164570793529373",
        "Date": "14/11/2024",
        "Text": "Keir Starmer declared Israel is not committing genocide.\n\nHere is slapped down by a legal expert who actually knows what he’s talking about",
        "Weight": 9,
        "Id": 740
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1857162172482146381",
        "Date": "14/11/2024",
        "Text": "How about you test this theory by fighting for Israel’s genocidal onslaught to end so I will disappear.\n\nPS: opposing depraved atrocities doesn’t make you antisemitic, however much you scream otherwise",
        "Weight": 7,
        "Id": 742
    },
    {
        "URL": "https://x.com/muhammadshehad2/status/1856997447538491743",
        "Date": "14/11/2024",
        "Text": "Netanyahu's office were warned about Hamas' Oct 7 attack at least 4 hours in advance & chose to do nothing\n\nThen Netanyahu's office spent 13 months blackmailing with \"embarrassing documentation\" the intelligence officer that warned them to keep silent, & now the story broke out",
        "Weight": 4,
        "Id": 743
    },
    {
        "URL": "https://x.com/yeojoonhan/status/1857096282281574456",
        "Date": "14/11/2024",
        "Text": "Right now, this is also the platform from which civilians from Gaza are reaching out for help and donations. Each individual has invested months and months earning our trust and accruing followers. We must not abandon them. Take this guy, for example:\nhttps://x.com/SakherEmad849/status/1852389366619852967…",
        "Weight": 4,
        "Id": 744
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1857110564314751140",
        "Date": "14/11/2024",
        "Text": "Israel has concluded that its Western patrons will let it do what it wants.\n\nThat there is no crime too obscene or too depraved.\n\nAnd Israel is absolutely right.",
        "Weight": 8,
        "Id": 746
    },
    {
        "URL": "https://x.com/mehdirhasan/status/1856934462002479204",
        "Date": "14/11/2024",
        "Text": "The BBC online headline team can’t stop/won’t stop running interference for the Israelis.",
        "Weight": 11,
        "Id": 754
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1857024832895914057",
        "Date": "14/11/2024",
        "Text": "Germany has facilitated Israel's genocide from day one.\n\nNow over 1,000 academics, civil servants and public figures have signed a letter demanding this obscenity ends.\n\nDelighted to interview \n@hanna_altaher\n and \n@Melaniebelizi\n \n\nhttps://youtube.com/watch?v=w8hX9TKqeO0…",
        "Weight": 9,
        "Id": 756
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1857025540009427236",
        "Date": "14/11/2024",
        "Text": "Here's the letter demanding that Germany stops facilitating the annihilation of the Palestinian people ",
        "Weight": 4,
        "Id": 757
    },
    {
        "URL": "https://x.com/ryangrim/status/1856715097101508681",
        "Date": "13/11/2024",
        "Text": "\"The video has been removed.\"\n\nSo the Times realized a video they claimed was showing Israelis getting beaten up actually showed the opposite, so they removed the video. Why not leave the video in and just make it accurate?",
        "Weight": 11,
        "Id": 760
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856749608543621546",
        "Date": "13/11/2024",
        "Text": "The official Western narrative on Israel's genocidal mayhem will not die.\n\nNo matter how obscene the crime, how depraved the atrocity, this fortress will not fall.\n\nNew column on how the West keeps a grotesque reality at bay ",
        "Weight": 4,
        "Id": 761
    },
    {
        "URL": "https://x.com/zarahsultana/status/1856713784619876447",
        "Date": "13/11/2024",
        "Text": "Last October, the Prime Minister told LBC that \"Israel does have that right [to cut food, water & power from Gaza].\"\n\nToday, in the Chamber, he claimed he’s \"well aware of the definition of genocide\" & that's why he’s \"never referred to [Gaza] as a genocide.\"\n\nWe won’t forget.",
        "Weight": 22,
        "Id": 763
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856738040481247352",
        "Date": "13/11/2024",
        "Text": "Here's the thing.\n\nWhenever you get smeared with a false claim of antisemitism - I dunno, you object to Israeli hooligans beating people up, or Israeli soldiers shooting kids in the head - click on their profile.\n\nYou will almost always come across a sewer of racism.",
        "Weight": 19,
        "Id": 764
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856738045585715377",
        "Date": "13/11/2024",
        "Text": "The attempt to smear the left as antisemitic - for opposing genocide, apartheid and occupation - has another function.\n\nIt deflects attention away from the actual key danger.\n\nLike the world's last superpower now having antisemites in high office?",
        "Weight": 13,
        "Id": 765
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856738047695450155",
        "Date": "13/11/2024",
        "Text": "These are dark times, where the powerful try to make us believe up is down and left is right.\n\nThe attempt to turn the world on its head is seen in the campaign to claim that the real hateful extremists as those who oppose genocide.\n\nWe are fighting for justice, and plain reality",
        "Weight": 5,
        "Id": 766
    },
    {
        "URL": "https://x.com/marcowenjones/status/1856711381770236006",
        "Date": "13/11/2024",
        "Text": "Wait why was the video removed, rather than just correcting the fact Israeli fans were doing the chasing ",
        "Weight": 8,
        "Id": 770
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856693885692416432",
        "Date": "13/11/2024",
        "Text": "The New York Times presented footage of Maccabi Tel Aviv fans attacking people in Amsterdam as evidence of what was being described as a pogrom against Jewish people.\n\nHow many will have watched the footage and concluded that, compared to those who read this belated correction?",
        "Weight": 5,
        "Id": 771
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856656490372694301",
        "Date": "13/11/2024",
        "Text": "According to an Israeli newspaper, Maaccabi Tel Aviv fans roamed Amsterdam seeking Palestinians to “beat up”.\n\nYou have been lied to about what happened.\n\nIt’s as simple as that \n\nhttps://youtu.be/-eD-eEibXpg",
        "Weight": 17,
        "Id": 773
    },
    {
        "URL": "https://x.com/jeremyscahill/status/1856455944395190665",
        "Date": "12/11/2024",
        "Text": "As the Biden administration continues to abet Israel’s starvation campaign in Gaza, please read this dispatch from \n@AbubakerAbedW\n in Deir-al-Balah. A window into daily life amidst the genocide. \n\n\n@DropSiteNews\n \n\nhttps://dropsitenews.com/p/gaza-hunger-israel-restricts-aid…",
        "Weight": 21,
        "Id": 775
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856468178924077422",
        "Date": "12/11/2024",
        "Text": "Notice how this man doesn't list anything factually wrong with what I said.\n\nThat's because he has only bile and lies here, rather than facts.\n\nIt's a fact Maccabi Tel Aviv fans engaged in widespread violence, while chanting genocidal slogans and relishing the slaughter of kids.",
        "Weight": 1,
        "Id": 776
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856466281282584711",
        "Date": "12/11/2024",
        "Text": "Hi \n@ben_rumsby\n\n\nI know The Telegraph is Fox News for English saloon bar bigots, but get your facts right.\n\n1) My interview was several weeks after October 7\n\n2) It was with Raz Segal, Israeli-American associate professor of Holocaust and genocide studies\n\nhttps://telegraph.co.uk/football/2024/11/12/gary-lineker-bbc-motd-exit-nazi-germany-legacy-podcasts/…",
        "Weight": 18,
        "Id": 777
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856446906102128920",
        "Date": "12/11/2024",
        "Text": "Israel publicly declared it would impose a total siege on Gaza on 9th October 2023.\n\nYoav Gallant, defence minister, declared a total siege on “human animals”.\n\nThe general in charge of the occupied territories said this the same day.\n\nIt wasn’t subtle? Why are you surprised?",
        "Weight": 8,
        "Id": 778
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856447599990968402",
        "Date": "12/11/2024",
        "Text": "To work out what Israel was going to do to Gaza, you didn’t need to be a prophet, expert or genius.\n\nYou just had to take what Israeli leaders and officials said literally.\n\nThat turned out to be the most accurate guide to what would happen to Gaza.",
        "Weight": 20,
        "Id": 779
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856447957731606887",
        "Date": "12/11/2024",
        "Text": "But our media outlets not only failed to frame their coverage around the stated intent of Israeli leaders and officials.\n\nIn most cases, they buried these statements - or didn’t cover them at all.\n\nThis is a key reason why Western outlets are complicit in genocide.",
        "Weight": 13,
        "Id": 780
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856432094844743767",
        "Date": "12/11/2024",
        "Text": "You know what’s so unbelievably obnoxious about this?\n\nGary Lineker was most vilified on the issue of Palestine because he shared my interview with Raz Segal.\n\nWho is… an Israeli-American associate professor of Holocaust and genocide studies.",
        "Weight": 20,
        "Id": 782
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856431262489293272",
        "Date": "12/11/2024",
        "Text": "The repeated extermination of entire extended families.\n\nIt sounds like genocide, because it is in fact genocide.",
        "Weight": 10,
        "Id": 783
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856418849354133912",
        "Date": "12/11/2024",
        "Text": "Yet more evidence of what happened in Amsterdam emerges.\n\nIt turns out that violence *the night before the match* involving Maccabi Tel Aviv fans was so bad that \n\n1) 10 Maccabi fans were arrested \n\n2) The match was nearly called off \n\nAll scrubbed from original Western coverage.",
        "Weight": 1,
        "Id": 785
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856394656252342694",
        "Date": "12/11/2024",
        "Text": "Israel has ethnically cleansed northern Gaza - and announced it to the world.\n\nYet the Western media still refuses to describe one of the worst crimes of our age for what it is.\n\nMeanwhile, those who pointed out Israel's murderous intent have been demonised and defamed.",
        "Weight": 14,
        "Id": 786
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856383363344675221",
        "Date": "12/11/2024",
        "Text": "This is a British surgeon recounting Israel's deliberate targeting of children in Gaza.\n\nIt doesn't matter how obscene the crime, how overwhelming the evidence: the official narrative on Israel and Palestine simply will not budge.",
        "Weight": 16,
        "Id": 787
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856354936117944756",
        "Date": "12/11/2024",
        "Text": "She filmed Tel Aviv Maccabi fans attacking Dutch residents.\n\nWestern media outlets - including the BBC - then took her footage, and portrayed it as Maccabi fans being attacked.\n\nMy interview with \n@iAnnetnl\n ",
        "Weight": 1,
        "Id": 789
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856348594619752644",
        "Date": "12/11/2024",
        "Text": "In the second paragraph of this Israeli article, it says:\n\n\"10 Maccabi Tel Aviv fans were roaming the train looking for a Palestinian to 'beat up' (their words. They didn't find one.\"\n\nThis is in an article alleging an antisemitic pogrom?\n\nWhat. The. Fuck.",
        "Weight": 16,
        "Id": 790
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856349119092273587",
        "Date": "12/11/2024",
        "Text": "So this Israeli newspaper confirms that mobs of Maccabi Tel Aviv hooligans were looking for Palestinians to beat up in Amsterdam.\n\nWhy is this missing from all the Western media coverage.\n\nWhat is going on here.",
        "Weight": 17,
        "Id": 791
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856350070117220753",
        "Date": "12/11/2024",
        "Text": "\"Arab fans were denied entry.\"\n\nI beg your pardon?\n\nAnd, factually speaking, there were not just several Israeli soldiers there.\n\nAccording to the Jerusalem Post, Mossad accompanied Maccabi Tel Aviv.",
        "Weight": 9,
        "Id": 792
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856325130915590174",
        "Date": "12/11/2024",
        "Text": "This is utterly surreal.\n\nThis is from the Israeli newspaper Yedioth Ahronoth.\n\nRead the headline, the subheading... and then the first paragraph.\n\nYou. Cannot. Make This. Shit. Up.\n\n(https://ynetnews.com/article/hk4ijctb1e…)",
        "Weight": 8,
        "Id": 793
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856321120959414402",
        "Date": "12/11/2024",
        "Text": "This is a news editor at Sky News.\n\nThis was filmed just prior to 7th October, and in the call is Mark Regev, former Israeli Ambassador to the UK, who became one of the chief spokespeople of the Israeli state since 7/10.",
        "Weight": 16,
        "Id": 794
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856114690260140379",
        "Date": "11/11/2024",
        "Text": "Here the Israeli finance minister declares the West Bank will be annexed.\n\nHere's where this is heading:\n\nGaza violently emptied of its population.\n\nThe Palestinian population strangled in the West Bank, with life ever more unbearable.\n\nHistoric Palestine purged of Palestinians.",
        "Weight": 28,
        "Id": 798
    },
    {
        "URL": "https://x.com/owenjonesjourno/status/1856116592465027567",
        "Date": "11/11/2024",
        "Text": "Here's what I think may happen:\n\nDonald Trump grants Israel annexation of the West Bank in exchange for Israel winding down its full scale onslaught against Gaza (in favour of quieter gradual strangulation) so he can present the latter as a win.",
        "Weight": 12,
        "Id": 799
    }
]