[
{
    "URL": "https://x.com/trackingisrael/status/1863983409464307727",
    "Date": "03/12/2024",
    "Text": "Israeli French reservist Yair Pardo, of the Artillery Corps Magen’s 9260th Battalion, shared footage of the relentless shelling of Gaza’s neighbourhoods during his participation in the ongoing genocide.",
    "Weight": 17,
    "Id": 0
},
{
    "URL": "https://x.com/trackingisrael/status/1863640556519281141",
    "Date": "02/12/2024",
    "Text": "An Israeli soldier from the 271st Combat Engineering Battalion posted a story on his social media account, offering off-duty Israelis access to Rafah City.\n\nThese actions allow ordinary, unregistered former soldiers to enter Gaza and potentially commit crimes.",
    "Weight": 27,
    "Id": 1
},
{
    "URL": "https://x.com/trackingisrael/status/1863619859898122260",
    "Date": "02/12/2024",
    "Text": "An Israeli-Russian reservist from the 7th Armoured Brigade documents the destruction of a displaced Lebanese vehicle by a D9 bulldozer during the invasion of Bint Jbiel village in southern Lebanon.",
    "Weight": 8,
    "Id": 2
},
{
    "URL": "https://x.com/trackingisrael/status/1862969813787627703",
    "Date": "30/11/2024",
    "Text": "An Israeli tank commander of the 401st Armoured Brigade captured the ethnic cleansing of hundreds of Palestinian families at gunpoint in the Jabalia refugee camp in northern Gaza.",
    "Weight": 16,
    "Id": 3
},
{
    "URL": "https://x.com/trackingisrael/status/1862957648150204665",
    "Date": "30/11/2024",
    "Text": "American Israeli sniper Joshua Boone, a member of the Golani Brigade's Reconnaissance Unit (Sayeret Golani), participated in the Gaza genocide.",
    "Weight": 17,
    "Id": 4
},
{
    "URL": "https://x.com/trackingisrael/status/1862949992228438200",
    "Date": "30/11/2024",
    "Text": "Israeli soldiers from the 601st Combat Engineering Battalion, \"Asaf,\" documented and posted their detonation of displaced Palestinians' homes and mosques in central Gaza Strip areas during the Gaza genocide.",
    "Weight": 29,
    "Id": 5
},
{
    "URL": "https://x.com/trackingisrael/status/1862892314785431903",
    "Date": "30/11/2024",
    "Text": "Israeli reservists from the 5280th Combat Engineer Battalion of the Alexandroni Brigade celebrate and dance while detonating displaced Lebanese towns in southern Lebanon.",
    "Weight": 8,
    "Id": 6
},
{
    "URL": "https://x.com/trackingisrael/status/1862599562663227489",
    "Date": "29/11/2024",
    "Text": "An Israeli American woman has proudly shared footage of her son detonating Palestinian neighbourhoods during his reserve service in the 271st Combat Engineering Battalion during the Gaza genocide.",
    "Weight": 21,
    "Id": 7
},
{
    "URL": "https://x.com/trackingisrael/status/1862590240910680087",
    "Date": "29/11/2024",
    "Text": "Israeli soldier Yosef, from the Nahal Brigade's 931st Infantry Battalion, boasted about setting fire to the homes of displaced Palestinians and filmed himself firing grenades at residential neighbourhoods for fun during his involvement in the genocide.",
    "Weight": 21,
    "Id": 8
},
{
    "URL": "https://x.com/trackingisrael/status/1862561515460530504",
    "Date": "29/11/2024",
    "Text": "Israeli soldiers from the Kfir Brigade's 97th Infantry Battalion, 'Netzah Yehuda,' recorded themselves celebrating as they detonated Palestinian homes from within a mosque they had desecrated during the Gaza genocide.",
    "Weight": 21,
    "Id": 9
},
{
    "URL": "https://x.com/trackingisrael/status/1862240125586972676",
    "Date": "28/11/2024",
    "Text": "American Israeli Chaim Meisels, served as a captain in the Bislamach Brigade's 450th Infantry Battalion during the Gaza genocide.\n\nAfter his participation, he returned and met American Congressman Mike Lawler and Representative Mike Johnson, who praised his involvement.",
    "Weight": 17,
    "Id": 10
},
{
    "URL": "https://x.com/trackingisrael/status/1862232980552286408",
    "Date": "28/11/2024",
    "Text": "This Israeli American reservist from the Kfir Brigade filmed himself desecrating and throwing a copy of the Holy Qur'an while storming and destroying displaced Palestinian homes during his participation in the Gaza genocide.",
    "Weight": 21,
    "Id": 11
},
{
    "URL": "https://x.com/trackingisrael/status/1862232983614218745",
    "Date": "28/11/2024",
    "Text": "Before being deployed to Gaza, he served in the occupied West Bank, where he also uploaded images showing the abduction of Palestinians from their homes in the middle of the night.\n\nDavid justified his actions as being for the purpose of hastening the arrival of the 'Messiah'.",
    "Weight": 12,
    "Id": 12
},
{
    "URL": "https://x.com/trackingisrael/status/1862215105556914528",
    "Date": "28/11/2024",
    "Text": "Israeli Sergeant Nadav, from the 7107th Combat Engineering Battalion 'Raz,' documented and shared on social media his experience of participating in the decimation and destruction of displaced Palestinians' homes during the Gaza genocide.",
    "Weight": 25,
    "Id": 13
},
{
    "URL": "https://x.com/trackingisrael/status/1861515612062724185",
    "Date": "26/11/2024",
    "Text": "This Israeli sergeant from the 603rd Combat Engineering Battalion 'Lahav' arrived today in Dubai for a vacation following his participation in the Gaza genocide, during which he filmed himself detonating a mosque.",
    "Weight": 17,
    "Id": 14
},
{
    "URL": "https://x.com/trackingisrael/status/1861493808770224291",
    "Date": "26/11/2024",
    "Text": "Israeli soldier Shay Fridman, of Golani 12th Infantry Battalion, filmed himself and other soldiers indiscriminately shooting at Palestinian homes for amusement in Khan Yunis.\n\nHe also filmed the detonation of neighborhoods and the destruction of property during the Gaza genocide.",
    "Weight": 21,
    "Id": 15
},
{
    "URL": "https://x.com/trackingisrael/status/1861151344435900765",
    "Date": "25/11/2024",
    "Text": "Israeli reservist Major Ido Borger, a sergeant in the 603rd Engineer Battalion \"Lahav\" of the 7th Armored Brigade, expressed pride in supervising the detonation of extensive neighborhoods in northern Gaza during the genocide.",
    "Weight": 17,
    "Id": 16
},
{
    "URL": "https://x.com/trackingisrael/status/1861137560241627383",
    "Date": "25/11/2024",
    "Text": "Israeli reservist Ido Darvish, a commander in the Golani Brigade's 12th Infantry Battalion, shared images documenting his involvement in the invasion of southern Lebanon.\n\nOne of the images depicts a soldier boasting while wearing the clothes of a displaced Lebanese woman.",
    "Weight": 8,
    "Id": 17
},
{
    "URL": "https://x.com/trackingisrael/status/1861131335118606602",
    "Date": "25/11/2024",
    "Text": "Israeli reservist Tomer Ankori, from the Golani Brigade's 51st Infantry Battalion, documented his involvement in the invasion of southern Lebanese towns.\n\nAmong the images he shared was one showing them flaunting money looted from a home in Meiss Ej-Jabal.",
    "Weight": 8,
    "Id": 18
},
{
    "URL": "https://x.com/trackingisrael/status/1861111578528997687",
    "Date": "25/11/2024",
    "Text": "Due to recent and unfortunate demands to halt our efforts in exposing Israeli soldiers involved in the Gaza genocide, the Israel Genocide Tracker team feels it is necessary to clarify our position to our followers and the public.",
    "Weight": 26,
    "Id": 19
},
{
    "URL": "https://x.com/trackingisrael/status/1860790269815275914",
    "Date": "24/11/2024",
    "Text": "Israeli Russian soldier Idan Teper, of the Givati Brigade's 424th Infantry Battalion 'Shaked,' documented his participation in the Gaza genocide.",
    "Weight": 17,
    "Id": 20
},
{
    "URL": "https://x.com/trackingisrael/status/1860790274680660461",
    "Date": "24/11/2024",
    "Text": "Idan shared numerous photos on his social media account depicting his fellow soldiers engaging in unethical behavior and war crimes.",
    "Weight": 12,
    "Id": 21
},
{
    "URL": "https://x.com/trackingisrael/status/1860790278132539759",
    "Date": "24/11/2024",
    "Text": "Soldiers from this battalion were among the most notorious during the Gaza genocide. Idan was part of the same squad that raided Al-Taqwa Mosque in Gaza City, posing for pictures as they set it on fire.\n\nFor the full thread, follow us on Telegram.",
    "Weight": 13,
    "Id": 22
},
{
    "URL": "https://x.com/trackingisrael/status/1860776591376240853",
    "Date": "24/11/2024",
    "Text": "Israeli Italian soldier Harel Divon, of the Nahal Brigade's 931st Infantry Battalion 'Shaham,' documented his participation in the invasion of southern Lebanon.\n\nDivon also took part in the Gaza genocide, particularly in the Jabalia refugee camp.",
    "Weight": 17,
    "Id": 23
},
{
    "URL": "https://x.com/trackingisrael/status/1860762905722954224",
    "Date": "24/11/2024",
    "Text": "Israeli Ukrainian soldier Daniel Raxovic Leontiev, of the Nahal Brigade's 931st Infantry Battalion 'Shaham,' served in the occupied West Bank and participated in raids on Palestinian homes during the genocide in Gaza.",
    "Weight": 21,
    "Id": 24
},
{
    "URL": "https://x.com/trackingisrael/status/1860762909158039614",
    "Date": "24/11/2024",
    "Text": "He took a selfie using a mirror inside a Palestinian home during one of the raids.",
    "Weight": 4,
    "Id": 25
},
{
    "URL": "https://x.com/trackingisrael/status/1860756819175461040",
    "Date": "24/11/2024",
    "Text": "Israeli soldier Ilay Fredi, of South American origin, serving in the Golani Brigade's 12th Infantry Battalion 'Barak,' documented his participation in the invasion of southern Lebanon.",
    "Weight": 8,
    "Id": 26
},
{
    "URL": "https://x.com/trackingisrael/status/1860749272926314591",
    "Date": "24/11/2024",
    "Text": "Israeli French Rabbi David Zenou, of the Alexandroni Brigade's 9203rd Infantry Battalion, participated in the Gaza genocide and also in the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 27
},
{
    "URL": "https://x.com/trackingisrael/status/1860749276130791525",
    "Date": "24/11/2024",
    "Text": "He regularly gave live lectures on YouTube during his active service in Gaza and Lebanon, during which he justified the atrocities committed against Palestinians and Arabs in general.",
    "Weight": 12,
    "Id": 28
},
{
    "URL": "https://x.com/trackingisrael/status/1860739013033828579",
    "Date": "24/11/2024",
    "Text": "Israeli American soldier Dror Adir, of the Givati Brigade's 424th Infantry Battalion 'Shaked,' has been identified as having participated in the genocide in Gaza.",
    "Weight": 17,
    "Id": 29
},
{
    "URL": "https://x.com/trackingisrael/status/1860739016313696674",
    "Date": "24/11/2024",
    "Text": "The squad Dror was part of has been involved in numerous war crimes, including setting homes and mosques on fire.",
    "Weight": 12,
    "Id": 30
},
{
    "URL": "https://x.com/trackingisrael/status/1860729072126452196",
    "Date": "24/11/2024",
    "Text": "Israeli soldier Itay Efrati, serving in the 601st Combat Engineering Battalion 'Asaf,' documented his involvement in looting the homes of displaced and killed Palestinians before demolishing them during the ongoing genocide in Gaza.",
    "Weight": 25,
    "Id": 31
},
{
    "URL": "https://x.com/trackingisrael/status/1860729075322573073",
    "Date": "24/11/2024",
    "Text": "He posted a video, laughing as he burned Palestinians' passports and pictures in Rafah, while looting neighborhoods prior to their demolition.",
    "Weight": 10,
    "Id": 32
},
{
    "URL": "https://x.com/trackingisrael/status/1860710115751403888",
    "Date": "24/11/2024",
    "Text": "Israeli Uzbek soldier David Pavlov, of the 7th Armored Brigade's 603rd Combat Engineering Battalion 'Lahav,' was severely wounded by the resistance while rigging displaced Palestinians' homes with explosives for detonation during the Gaza genocide.",
    "Weight": 25,
    "Id": 33
},
{
    "URL": "https://x.com/trackingisrael/status/1860705623978991783",
    "Date": "24/11/2024",
    "Text": "Israeli French soldier Jonathan Amzallag, of the Golani Brigade's 51st Infantry Battalion, documented his participation in the Gaza genocide and the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 34
},
{
    "URL": "https://x.com/trackingisrael/status/1860704692411511042",
    "Date": "24/11/2024",
    "Text": "Israeli soldier Avishay Dahari, of Indian origin, mocked Palestinians they kidnapped on his social media while serving in the 442nd Territorial Brigade 'Samaria' in the occupied West Bank during the ongoing Gaza genocide.",
    "Weight": 25,
    "Id": 35
},
{
    "URL": "https://x.com/trackingisrael/status/1860427908168208435",
    "Date": "23/11/2024",
    "Text": "Israeli Filipino reservist John Cyrus, of the Artillery Corps 215th Artillery Brigade 'Amud HaEsh,' took part in and documented the relentless shelling of Gaza neighborhoods, writing messages on the shells before firing them.",
    "Weight": 12,
    "Id": 36
},
{
    "URL": "https://x.com/trackingisrael/status/1860425618308903391",
    "Date": "23/11/2024",
    "Text": "Israeli reservist Nadav Cohen, a company commander of \"Tzama\" D9 bulldozers of the 601st Combat Engineering Battalion 'Asaf,' said he was privileged to have taken part in the demolition of thousands of Palestinian homes while serving in the genocide in Gaza.",
    "Weight": 21,
    "Id": 37
},
{
    "URL": "https://x.com/trackingisrael/status/1860421506880163870",
    "Date": "23/11/2024",
    "Text": "Israeli soldier Adi Daniel, of Givati Brigade's 424th Infantry Battalion 'Shaked,' participated in the Gaza genocide.",
    "Weight": 17,
    "Id": 38
},
{
    "URL": "https://x.com/trackingisrael/status/1860419125169795227",
    "Date": "23/11/2024",
    "Text": "Israeli coach Roee Liderman, of German origin, served in Givati Brigade's 424th Infantry Battalion, 'Shaked,' during the Gaza genocide.",
    "Weight": 17,
    "Id": 39
},
{
    "URL": "https://x.com/trackingisrael/status/1860410475508310362",
    "Date": "23/11/2024",
    "Text": "Israeli soldier Tal Raz, of Givati's 424th Infantry Battalion, 'Shaked,' was identified in a video, not shared by him personally, shooting grenades at Palestinian homes for fun during his participation in the Gaza genocide.",
    "Weight": 21,
    "Id": 40
},
{
    "URL": "https://x.com/trackingisrael/status/1860403956968566807",
    "Date": "23/11/2024",
    "Text": "Israeli British reservist Zohar Uriel Hindi, of the Kfir Brigade's 92nd Infantry Battalion 'Shimshon,' documented and posted his involvement in the Gaza Genocide.",
    "Weight": 17,
    "Id": 41
},
{
    "URL": "https://x.com/trackingisrael/status/1860354759728721964",
    "Date": "23/11/2024",
    "Text": "Israeli reservist Netanel Sofer, of the Nahal Brigade 932nd Infantry Battalion 'Granit', documented his participation in the Gaza Genocide and the invasion of southern Lebanon towns.",
    "Weight": 17,
    "Id": 42
},
{
    "URL": "https://x.com/trackingisrael",
    "Date": "03/10/2024",
    "Text": "American Israeli Shay Zadh documents the war crimes he committed while serving in the Israeli army in Gaza on his social media platforms.",
    "Weight": 32,
    "Id": 43
},
{
    "URL": "https://x.com/trackingisrael/status/1854977725305401386",
    "Date": "08/11/2024",
    "Text": "Israeli American reservist Yeari Gilboa served as a gunner in the Paratroopers Brigade during the genocide in Gaza.",
    "Weight": 17,
    "Id": 44
},
{
    "URL": "https://x.com/trackingisrael/status/1854977729667776543",
    "Date": "08/11/2024",
    "Text": "He posted videos of himself emptying ammunition by firing at displaced Palestinians' homes for amusement. \n\nYeari Gilboa was also identified as having served in the invasion of southern Lebanon with the 9255th Paratroopers Battalion.",
    "Weight": 8,
    "Id": 45
},
{
    "URL": "https://x.com/trackingisrael/status/1860341878085841340",
    "Date": "23/11/2024",
    "Text": "Israeli American reservist Tomer Snapir, of the 35th Paratroopers Brigade, documented his participation in the invasion of southern Lebanon towns.\n\nFor the full thread, please join our Telegram channel.",
    "Weight": 8,
    "Id": 46
},
{
    "URL": "https://x.com/trackingisrael/status/1860064287114645881",
    "Date": "22/11/2024",
    "Text": "Israeli reservist Zahi Malul, of the Givati Brigade's 435th Infantry Battalion 'Rotem,' served in the genocide in Gaza.",
    "Weight": 17,
    "Id": 47
},
{
    "URL": "https://x.com/trackingisrael/status/1860053592625020986",
    "Date": "22/11/2024",
    "Text": "Israeli American reservist Shimon Bauer was identified as having served in the Givati Brigade during the Gaza genocide.",
    "Weight": 17,
    "Id": 48
},
{
    "URL": "https://x.com/trackingisrael",
    "Date": "19/09/2024",
    "Text": "\"I was not in Gaza, but I was close.\"\n\nIsraeli artillery officer Mori Masrati boasted that he was involved in the relentless shelling of Gaza, where thousands of Palestinian civilians were killed in the continuous, unstoppable bombardment.",
    "Weight": 20,
    "Id": 49
},
{
    "URL": "https://x.com/trackingisrael/status/1860048754029838420",
    "Date": "22/11/2024",
    "Text": "Israeli American combat medic Asaf Ben David, of the Givati Brigade's 435th Infantry Battalion 'Rotem,' served in the Gaza genocide.",
    "Weight": 17,
    "Id": 50
},
{
    "URL": "https://x.com/trackingisrael/status/1860048758052127003",
    "Date": "22/11/2024",
    "Text": "The battalion took group photos inside a displaced Palestinian home in Khan Yunis after occupying it, vandalizing it with racist and genocidal graffiti.",
    "Weight": 4,
    "Id": 51
},
{
    "URL": "https://x.com/trackingisrael/status/1860045874514264325",
    "Date": "22/11/2024",
    "Text": "Israeli soldier Dorel Shriki, of French origin, documented and posted about his service in the Nahal Brigade's 932nd Infantry Battalion 'Granit' during the Gaza genocide.",
    "Weight": 17,
    "Id": 52
},
{
    "URL": "https://x.com/trackingisrael/status/1860045878490464279",
    "Date": "22/11/2024",
    "Text": "During their invasion of displaced Palestinians' homes in Rafah, he posted images of himself flipping off a picture of the late Palestinian leader Yasser Arafat.",
    "Weight": 14,
    "Id": 53
},
{
    "URL": "https://x.com/trackingisrael/status/1860045882412138620",
    "Date": "22/11/2024",
    "Text": "Despite being an infantry rifleman, Dorel shared images of himself firing a machine gun and a sniper rifle for amusement, highlighting the lack of discipline within the occupation army during the genocide.",
    "Weight": 10,
    "Id": 54
},
{
    "URL": "https://x.com/trackingisrael/status/1860039325276340357",
    "Date": "22/11/2024",
    "Text": "Israeli American reservist Noam Korkus, of the Kfir Brigade's infamous 97th Infantry Battalion 'Netzah Yehuda,' participated in the Gaza genocide.",
    "Weight": 17,
    "Id": 55
},
{
    "URL": "https://x.com/trackingisrael/status/1859996906040291687",
    "Date": "22/11/2024",
    "Text": "Israeli trader and reservist Afik Peer, of Kfir Brigade's 92nd Infantry Battalion 'Shimshon,' posted on his trading accounts about serving in the occupied West Bank during the Gaza genocide, calling his participation a \"privilege.\"",
    "Weight": 17,
    "Id": 56
},
{
    "URL": "https://x.com/trackingisrael/status/1859991509187416239",
    "Date": "22/11/2024",
    "Text": "Israeli soldier Yonathan Turgeman, of North African origin, served in the 46th Armored Battalion 'Shelah' of the 401st Brigade during the Gaza genocide.",
    "Weight": 17,
    "Id": 57
},
{
    "URL": "https://x.com/trackingisrael/status/1859986485845647839",
    "Date": "22/11/2024",
    "Text": "Israeli German reservist Ron Bauer, an officer in the 261st Infantry Brigade and a sergeant in the Kfir Brigade's 92nd Infantry Battalion known as 'Shimshon,' served during the Gaza genocide.",
    "Weight": 17,
    "Id": 58
},
{
    "URL": "https://x.com/trackingisrael/status/1859986490140537300",
    "Date": "22/11/2024",
    "Text": "After completing their service in the Gaza genocide, Bauer, along with fellow soldiers from his brigade and others, took a vacation in South Africa.",
    "Weight": 9,
    "Id": 59
},
{
    "URL": "https://x.com/trackingisrael/status/1859703232127434973",
    "Date": "21/11/2024",
    "Text": "Israeli American reservist Peleg Gan-Tal, of the Combat Engineering Corps' 601st Battalion 'Asaf,' complained that the genocide in Gaza ruined his vacation to Spain, stating that he \"blew up the strip\" in retaliation.",
    "Weight": 17,
    "Id": 60
},
{
    "URL": "https://x.com/trackingisrael/status/1859694403490881627",
    "Date": "21/11/2024",
    "Text": "Israeli reservist Ron Hason, of the Golani Brigade's 631st Patrol Battalion, documented his service in the Gaza genocide and the invasion of southern Lebanon.\n\nHe vandalized displaced Palestinians' homes by spray-painting love messages on their walls for his girlfriend.",
    "Weight": 25,
    "Id": 61
},
{
    "URL": "https://x.com/trackingisrael/status/1859682618217992218",
    "Date": "21/11/2024",
    "Text": "Israeli Italian reservist Ryan Emrani of the Paratroopers Brigade served in the invasion of southern Lebanon in the 9263rd Battalion.",
    "Weight": 8,
    "Id": 62
},
{
    "URL": "https://x.com/trackingisrael/status/1859679793308107236",
    "Date": "21/11/2024",
    "Text": "Israeli Ukrainian soldier Richard Babaev (Babayev) of the Givati Brigade's 432nd Infantry Battalion 'Tzabar' said he was privileged to have served in the Israeli army during its genocide in Gaza.",
    "Weight": 25,
    "Id": 63
},
{
    "URL": "https://x.com/trackingisrael/status/1859671060423282844",
    "Date": "21/11/2024",
    "Text": "Israeli reservist Yuval Shabtay, of the Kfir Brigade's 93rd Patrol Battalion 'Haruv,' documented his service in raids in the occupied West Bank during the genocide in Gaza.",
    "Weight": 17,
    "Id": 64
},
{
    "URL": "https://x.com/trackingisrael/status/1859671064449778156",
    "Date": "21/11/2024",
    "Text": "He posted an image of the battalion using a Palestinian flag as their \"new carpet.\"",
    "Weight": 4,
    "Id": 65
},
{
    "URL": "https://x.com/trackingisrael/status/1859661225493410236",
    "Date": "21/11/2024",
    "Text": "Israeli reservist David Shereshevsky, of Polish origin, served in the Givati Brigade's 432nd Infantry Battalion 'Tzabar' during the genocide in Gaza.",
    "Weight": 17,
    "Id": 66
},
{
    "URL": "https://x.com/trackingisrael/status/1859650313889906790",
    "Date": "21/11/2024",
    "Text": "Israeli Georgian reservist Lishay Mirilashvili of the Givati Brigade's 424th Infantry Battalion 'Shaked' boasted about kidnapping Palestinians during his service in the occupied West Bank during the Gaza genocide.",
    "Weight": 25,
    "Id": 67
},
{
    "URL": "https://x.com/trackingisrael/status/1859637235533979673",
    "Date": "21/11/2024",
    "Text": "Israeli American soldier Yakir Sason of the Kfir Brigade, 93rd Patrol Battalion 'Haruv,' documented his service in raiding Palestinian homes in the occupied West Bank during the genocide in Gaza.",
    "Weight": 21,
    "Id": 68
},
{
    "URL": "https://x.com/trackingisrael/status/1859629358626849188",
    "Date": "21/11/2024",
    "Text": "Israeli reservist Shlomi Aharon, a company commander in the Nahal Brigade, documented his participation in the Gaza genocide, sharing images of himself wearing the clothes of displaced or killed Palestinians while raiding their homes.",
    "Weight": 25,
    "Id": 69
},
{
    "URL": "https://x.com/trackingisrael/status/1859629365488910351",
    "Date": "21/11/2024",
    "Text": "Humorously making videos of knocking on the door of a destroyed Palestinian home in Khan Yunis.",
    "Weight": 4,
    "Id": 70
},
{
    "URL": "https://x.com/trackingisrael/status/1859621134821470650",
    "Date": "21/11/2024",
    "Text": "Israeli reservist Roi Haimovich of the 35th Paratroopers Brigade, 202nd Paratroopers Battalion 'Tzapa,' participated in the Gaza genocide.\n\nRoi Haimovich is currently vacationing in Vietnam with other friends who also participated in the Gaza genocide.",
    "Weight": 26,
    "Id": 71
},
{
    "URL": "https://x.com/trackingisrael/status/1858979659360465348",
    "Date": "19/11/2024",
    "Text": "Israeli Eritrean soldier Moshe Avata, of the Givati Brigade 424th Infantry Battalion 'Shaked,' participated in the genocide in Gaza.",
    "Weight": 17,
    "Id": 72
},
{
    "URL": "https://x.com/trackingisrael/status/1858979663470833975",
    "Date": "19/11/2024",
    "Text": "He showcased the home of displaced Palestinians that they occupied during their invasion of Khan Yunis, which they vandalized with genocidal and racist slurs.",
    "Weight": 8,
    "Id": 73
},
{
    "URL": "https://x.com/trackingisrael/status/1858973138626982172",
    "Date": "19/11/2024",
    "Text": "Israeli reservist Daniel Davidi, of Moroccan origin, posted a photo from inside Yarine UN Public School in northern Lebanon, where he vandalized its walls with his Golani battalion's logos.",
    "Weight": 8,
    "Id": 74
},
{
    "URL": "https://x.com/trackingisrael/status/1858965910469701755",
    "Date": "19/11/2024",
    "Text": "Israeli reservist Noam Koren, a software engineer at the American AI startup Stealth, served in the Gaza genocide as part of Givati Brigade's 435th Infantry Battalion 'Rotem.'\n\nHe captioned the album he uploaded marking the end of his service: \"A bit of flat Gaza.\"",
    "Weight": 21,
    "Id": 75
},
{
    "URL": "https://x.com/trackingisrael/status/1858957201160769618",
    "Date": "19/11/2024",
    "Text": "Israeli soldiers from the Givati Brigade occupied the UNRWA Jabalia Health Centre, raised their flags over it after forcibly expelling hundreds of displaced families and the wounded, ethnically cleansing them, before setting the center on fire.",
    "Weight": 8,
    "Id": 76
},
{
    "URL": "https://x.com/trackingisrael/status/1858952706091868384",
    "Date": "19/11/2024",
    "Text": "Israeli soldier Sahar Ayash, of Givati Brigade's 424th Infantry Battalion 'Shaked,' documented his participation in the genocide in Gaza.\n\nSahar posed for a selfie wearing lingerie belonging to displaced or killed Palestinian women while looting their homes in Jabalia.",
    "Weight": 21,
    "Id": 77
},
{
    "URL": "https://x.com/trackingisrael/status/1858940958173524126",
    "Date": "19/11/2024",
    "Text": "Israeli American soldier Ori Farazon (Farajun), of Givati's Brigade 432nd Infantry Battalion 'Tzabar', posted an image of setting displaced Palestinians' homes on fire during his participation in the genocide in Gaza.",
    "Weight": 25,
    "Id": 78
},
{
    "URL": "https://x.com/trackingisrael/status/1858931062572830886",
    "Date": "19/11/2024",
    "Text": "Israeli Druze reservist Omry Atalla, of Givati's 432nd Infantry Battalion 'Tzabar', documented his participation in the genocide in Gaza.",
    "Weight": 17,
    "Id": 79
},
{
    "URL": "https://x.com/trackingisrael/status/1858931066100236493",
    "Date": "19/11/2024",
    "Text": "A few weeks ago, he posted footage of the Battalion's occupation of Rafah Crossing with Egypt, making jokes about Egypt allowing them to occupy the 'Philadelphi Corridor'.",
    "Weight": 7,
    "Id": 80
},
{
    "URL": "https://x.com/trackingisrael/status/1858922456914030728",
    "Date": "19/11/2024",
    "Text": "Israeli Uzbek reservist Amir Igronov, of Givati's 432nd Infantry Battalion 'Tzabar', vandalized the walls of Al-Azhar University in Gaza with his name and his girlfriend's before detonating it during his participation in the genocide.",
    "Weight": 17,
    "Id": 81
},
{
    "URL": "https://x.com/trackingisrael/status/1858915011239821522",
    "Date": "19/11/2024",
    "Text": "Israeli soldier Omri Partush, of the 188th Barak Armor Brigade, 53rd Armored Battalion 'Sufa', celebrated the end of his military service while participating in the Gaza genocide.",
    "Weight": 17,
    "Id": 82
},
{
    "URL": "https://x.com/trackingisrael/status/1858909287650635892",
    "Date": "19/11/2024",
    "Text": "Israeli soldier Nadav Ofir, of the Givati Brigade 432nd Infantry Battalion 'Tzabar', identified to have served in the Gaza genocide.\n\nNadav admitted to participating in the attack on Al-Shifa Hospital in April, calling it a life-changing event that made him want to end his life.",
    "Weight": 17,
    "Id": 83
},
{
    "URL": "https://x.com/trackingisrael/status/1858909291476025708",
    "Date": "19/11/2024",
    "Text": "It is important to mention that hundreds of Palestinians, including women and children, doctors and nurses, were excavated from multiple mass graves in Al-Shifa Hospital following the withdrawal of Israeli occupation forces.",
    "Weight": 21,
    "Id": 84
},
{
    "URL": "https://x.com/trackingisrael/status/1858902065130410279",
    "Date": "19/11/2024",
    "Text": "Israeli reservist Evyatar Cohen, Givati Brigade 432nd Infantry Battalion 'Tzabar', identified to have served in the Gaza genocide.",
    "Weight": 17,
    "Id": 85
},
{
    "URL": "https://x.com/trackingisrael/status/1858895373995020381",
    "Date": "19/11/2024",
    "Text": "Israeli reservist Yosi Hadad, of the 401st Armored Brigade, documented his involvement in the ongoing Gaza genocide.",
    "Weight": 17,
    "Id": 86
},
{
    "URL": "https://x.com/trackingisrael/status/1858895377350459471",
    "Date": "19/11/2024",
    "Text": "His battalion took over the homes of displaced Palestinians in Khan Yunis, vandalizing their properties for amusement. They showcased paintings created by displaced or killed children before setting the homes ablaze.",
    "Weight": 8,
    "Id": 87
},
{
    "URL": "https://x.com/trackingisrael/status/1858617090715816133",
    "Date": "18/11/2024",
    "Text": "Israeli reservist Raz Goffer, of Russian origin, served in the Givati Brigade's 424th Infantry Battalion 'Shaked' during the Gaza genocide.\n\nFollowing their participation in the genocide, Raz Goffer and other soldiers from various battalions went on vacation to South America.",
    "Weight": 22,
    "Id": 88
},
{
    "URL": "https://x.com/trackingisrael/status/1858607461525041434",
    "Date": "18/11/2024",
    "Text": "Israeli reservist Guy Giladi, a tank commander in the 7th Armored Brigade 'Saar me-Golan', documented his involvement in the ongoing genocide in Gaza.",
    "Weight": 17,
    "Id": 89
},
{
    "URL": "https://x.com/trackingisrael/status/1858600707005313074",
    "Date": "18/11/2024",
    "Text": "Israeli Ethiopian reservist Alfa Shahar, a sergeant in the 460th Armored 'Bnei Or' Brigade, documented his involvement in the ongoing genocide in Gaza.\n\nHe shared an image of Al-Azhar University in Gaza City, just days before it was detonated.",
    "Weight": 21,
    "Id": 90
},
{
    "URL": "https://x.com/trackingisrael/status/1858589112443285746",
    "Date": "18/11/2024",
    "Text": "Israeli reservist Shalev Avitan, of Portuguese origin, from the Givati Brigade, 432nd Infantry Battalion 'Tzabar,' documented and posted about his participation in the Gaza genocide.",
    "Weight": 17,
    "Id": 91
},
{
    "URL": "https://x.com/trackingisrael/status/1858589115886731768",
    "Date": "18/11/2024",
    "Text": "Shalev is currently active in the same battalion, participating in the ethnic cleansing of Palestinians in the Jabalia refugee camp in northern Gaza.",
    "Weight": 12,
    "Id": 92
},
{
    "URL": "https://x.com/trackingisrael/status/1858571688322969691",
    "Date": "18/11/2024",
    "Text": "Israeli reservist Yosef Yerushalmi, a sergeant in the Kfir Brigade during the Gaza genocide, also served in the 5280th Combat Engineer Battalion of the Alexandroni Brigade during the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 93
},
{
    "URL": "https://x.com/trackingisrael/status/1858571691905216545",
    "Date": "18/11/2024",
    "Text": "They vandalized a memorial for fallen resistance fighters from previous Israeli invasions, writing Hebrew slurs on it before detonating the entire village and celebrating the explosion.",
    "Weight": 8,
    "Id": 94
},
{
    "URL": "https://x.com/trackingisrael/status/1858562585940852763",
    "Date": "18/11/2024",
    "Text": "Israeli sergeant Ravid Boaz, of Spanish origin, from the Nahal Brigade’s 50th Infantry Battalion 'Bazelet,' documented his involvement in the Gaza genocide and the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 95
},
{
    "URL": "https://x.com/trackingisrael/status/1858547350337134863",
    "Date": "18/11/2024",
    "Text": "Israeli American reservist Ido Rabeno, a tank commander in the 401st Armored Brigade 'Iron Trails,' documented his service in the Gaza genocide.",
    "Weight": 17,
    "Id": 96
},
{
    "URL": "https://x.com/trackingisrael/status/1858541456358576498",
    "Date": "18/11/2024",
    "Text": "Israeli Druze reservist Ali Obide, from the Givati Brigade, 432nd Infantry Battalion 'Tzabar,' is currently serving in the ongoing genocide in Gaza.",
    "Weight": 17,
    "Id": 97
},
{
    "URL": "https://x.com/trackingisrael/status/1858541460217274629",
    "Date": "18/11/2024",
    "Text": "Recently, \n@tamerqdh\n posted videos of Ali setting fire to agricultural plastic houses in Rafah and assaulting aid truck drivers who were transporting supplies to starving Palestinians.",
    "Weight": 10,
    "Id": 98
},
{
    "URL": "https://x.com/trackingisrael/status/1858252260129595433",
    "Date": "17/11/2024",
    "Text": "Israeli American web developer Daniel Ohayon, from Givati Brigade's 432nd Infantry Battalion 'Tzabar,' participated in the Gaza genocide.",
    "Weight": 17,
    "Id": 99
},
{
    "URL": "https://x.com/trackingisrael/status/1858248510690464086",
    "Date": "17/11/2024",
    "Text": "Israeli reservist Benzi Izhack, from Givati's 424th Infantry Battalion 'Shaked,' documented and shared his participation in the genocide in Gaza.",
    "Weight": 17,
    "Id": 100
},
{
    "URL": "https://x.com/trackingisrael/status/1858245236562317537",
    "Date": "17/11/2024",
    "Text": "Due to censorship algorithms on X and Zionist legal pressure to shut down our account exposing their war criminals, we invite you to follow us on Telegram for uncensored updates on Israeli soldiers involved in the genocide in Gaza and Lebanon.",
    "Weight": 22,
    "Id": 101
},
{
    "URL": "https://x.com/trackingisrael/status/1858233205360300538",
    "Date": "17/11/2024",
    "Text": "Israeli reservist Roi Hajaj, from Givati's 424th Infantry Battalion 'Shaked,' documented and posted his participation in the genocide in Gaza.",
    "Weight": 17,
    "Id": 102
},
{
    "URL": "https://x.com/trackingisrael/status/1858233209432981831",
    "Date": "17/11/2024",
    "Text": "Roi and his fellow soldiers from the same brigade went on vacation to Thailand after their participation in the genocide.",
    "Weight": 5,
    "Id": 103
},
{
    "URL": "https://x.com/trackingisrael/status/1858228127807451645",
    "Date": "17/11/2024",
    "Text": "Israeli Ukrainian reservist Nikita Korolyov, from the Givati Brigade 424th Infantry Battalion 'Shaked,' documented and posted his participation in the genocide in Gaza.",
    "Weight": 17,
    "Id": 104
},
{
    "URL": "https://x.com/trackingisrael/status/1858224985317212508",
    "Date": "17/11/2024",
    "Text": "Israeli Druze soldier Tameer Msalha served in the Givati 424th Infantry Battalion 'Shaked' during the Gaza genocide.",
    "Weight": 17,
    "Id": 105
},
{
    "URL": "https://x.com/trackingisrael/status/1858221583807938864",
    "Date": "17/11/2024",
    "Text": "Israeli German reservist Moshe Schnaiderman, from the Givati 424th Infantry Battalion \"Shaked,\" documented and shared his participation in the Gaza genocide.",
    "Weight": 17,
    "Id": 106
},
{
    "URL": "https://x.com/trackingisrael/status/1858197807888204039",
    "Date": "17/11/2024",
    "Text": "Israeli Ukrainian soldier Max Seryi, from Givati's 432nd Infantry Battalion 'Tzabar,' posted a video of himself firing a grenade at Palestinians' homes in Khan Yunis for fun during the genocide.",
    "Weight": 21,
    "Id": 107
},
{
    "URL": "https://x.com/trackingisrael/status/1858192186363285923",
    "Date": "17/11/2024",
    "Text": "Israeli reservist Hagay Biton, of Bulgarian origin, served as a sniper in the Golani Brigade during raids in the occupied West Bank and the Gaza genocide.\n\nAfter participating in the genocide, Hagay and other soldiers from the same battalion took a vacation to Colombia.",
    "Weight": 22,
    "Id": 108
},
{
    "URL": "https://x.com/trackingisrael/status/1858180403808330010",
    "Date": "17/11/2024",
    "Text": "Israeli reservist Eliyahu Meiri, from the Golani Brigade's 13th Infantry Battalion \"Gideon,\" posted images from inside displaced Lebanese civilians' homes during the invasion of southern Lebanon.",
    "Weight": 8,
    "Id": 109
},
{
    "URL": "https://x.com/trackingisrael/status/1858173407117918572",
    "Date": "17/11/2024",
    "Text": "Israeli reservist Ilay Zakay, of Spanish origin, served in the Givati Brigade battalion during the genocide in Gaza.",
    "Weight": 17,
    "Id": 110
},
{
    "URL": "https://x.com/trackingisrael/status/1858161062207468012",
    "Date": "17/11/2024",
    "Text": "Israeli reservist Almog Elkayam, a Sergeant Major of Moroccan descent in the Givati Brigade’s 432nd Infantry Battalion 'Tzaba,' documented and shared his involvement in the Gaza genocide.",
    "Weight": 17,
    "Id": 111
},
{
    "URL": "https://x.com/trackingisrael/status/1857887984705745090",
    "Date": "16/11/2024",
    "Text": "Israeli Russian reservist Yegorka Gindelevich, also known as 'Medved Baloo,' has been identified as having served in the Givati Brigade's 846th Battalion during the genocide in Gaza.",
    "Weight": 17,
    "Id": 112
},
{
    "URL": "https://x.com/trackingisrael/status/1857880845467414743",
    "Date": "16/11/2024",
    "Text": "Israeli Ukrainian photographer Bogdan Khrystenko served as a sniper in the Nahal Brigade's 931st Infantry Battalion, 'Shaham,' documenting his participation in the Gaza genocide during his reserve service.",
    "Weight": 17,
    "Id": 113
},
{
    "URL": "https://x.com/trackingisrael/status/1857880849250705694",
    "Date": "16/11/2024",
    "Text": "After his participation in the genocide, Bogdan went on vacation to the United States and Britain.",
    "Weight": 5,
    "Id": 114
},
{
    "URL": "https://x.com/trackingisrael/status/1857880852803498467",
    "Date": "16/11/2024",
    "Text": "During his service, he shared a schedule of the Brigade's success in ethnically cleansing Palestinians from northern Gaza areas.",
    "Weight": 12,
    "Id": 115
},
{
    "URL": "https://x.com/trackingisrael/status/1857870053141524500",
    "Date": "16/11/2024",
    "Text": "Israeli-American reservist Yoad Shochat documented his participation in the Gaza genocide. He served as a sniper in the Paratroopers Brigade’s 890th Battalion, 'Efea.'\n\nOne of the images he shared shows him using a mosque they raided as a sniping post.",
    "Weight": 17,
    "Id": 116
},
{
    "URL": "https://x.com/trackingisrael/status/1857861034075369510",
    "Date": "16/11/2024",
    "Text": "Israeli athlete Elishay Levi marketed his personal gym campaign during his participation in the Gaza genocide.\n\nHe served his reserve duty in the 35th Paratroopers Brigade’s 890th Battalion, both in Gaza and during the invasion of southern Lebanon.",
    "Weight": 21,
    "Id": 117
},
{
    "URL": "https://x.com/trackingisrael/status/1857853213048774736",
    "Date": "16/11/2024",
    "Text": "Israeli reservist Amit Tsabari documented his participation in the genocide in Gaza with the Paratroopers Brigade’s 890th Battalion.",
    "Weight": 17,
    "Id": 118
},
{
    "URL": "https://x.com/trackingisrael/status/1857846543551750246",
    "Date": "16/11/2024",
    "Text": "Israeli sergeant Idan Michael commanded the 7086th Combat Engineering Battalion \"Alon\" of the Engineering Corps during the invasion in Khan Yunis.",
    "Weight": 8,
    "Id": 119
},
{
    "URL": "https://x.com/trackingisrael/status/1857841368577589658",
    "Date": "16/11/2024",
    "Text": "Israeli reservist Eyal Aviram, served in the 512th Paran Brigade during the Gaza genocide.",
    "Weight": 17,
    "Id": 120
},
{
    "URL": "https://x.com/trackingisrael/status/1857838259411263952",
    "Date": "16/11/2024",
    "Text": "Israeli reservist Ofek Maatuf, a Habbani Jewish of Yemeni origin, boasted about sniping Palestinians while smoking a shisha while serving as a sniper in the Givati Brigade's 424th Infantry Battalion, \"Shaked,\" during the Gaza genocide.",
    "Weight": 29,
    "Id": 121
},
{
    "URL": "https://x.com/trackingisrael/status/1857834730495803547",
    "Date": "16/11/2024",
    "Text": "Israeli reservist David Por served as a gunner in the Givati Brigade's 424th Infantry Battalion, \"Shaked,\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 122
},
{
    "URL": "https://x.com/trackingisrael/status/1857831236875461063",
    "Date": "16/11/2024",
    "Text": "Israeli reservist Avraham Otmazgin, of Moroccan origin, served in the Givati Brigade's 424th Infantry Battalion, \"Shaked,\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 123
},
{
    "URL": "https://x.com/trackingisrael/status/1857527875253006390",
    "Date": "15/11/2024",
    "Text": "Israeli French reservist Yankel Hoze served as a sniper in the 35th Paratroopers Brigade’s 890th Battalion, known as \"Efea,\" during the Gaza genocide and the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 124
},
{
    "URL": "https://x.com/trackingisrael/status/1857527879095234773",
    "Date": "15/11/2024",
    "Text": "During his service in the occupied West Bank, he posted an image through his rifle’s scope, aiming at Palestinian civilians, with the caption: \"How much more.\"",
    "Weight": 4,
    "Id": 125
},
{
    "URL": "https://x.com/trackingisrael/status/1857520432733184052",
    "Date": "15/11/2024",
    "Text": "Israeli reservist Ori Tiram from the 35th Paratroopers Brigade’s 890th Battalion documented his participation in the Gaza genocide and the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 126
},
{
    "URL": "https://x.com/trackingisrael/status/1857520440270282952",
    "Date": "15/11/2024",
    "Text": "He uploaded footage of himself shooting grenades at Palestinian homes, seemingly for fun, and also uploaded the detonation of Matmoura village.",
    "Weight": 4,
    "Id": 127
},
{
    "URL": "https://x.com/trackingisrael/status/1857515790213460039",
    "Date": "15/11/2024",
    "Text": "Israeli reservist Nadav Tzubery served in the Paratroopers Brigade’s 890th Battalion during the Gaza genocide and the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 128
},
{
    "URL": "https://x.com/trackingisrael/status/1857508473887482055",
    "Date": "15/11/2024",
    "Text": "Israeli reservist Rotem Gelman, from the 890th Paratroopers Battalion \"Efea,\" served in the occupied West Bank and Gaza genocide, posting images of Palestinians kidnapped during night raids in the occupied West Bank.",
    "Weight": 25,
    "Id": 129
},
{
    "URL": "https://x.com/trackingisrael/status/1857500012613132325",
    "Date": "15/11/2024",
    "Text": "Israeli Brazilian reservist Shai Levinbuk, serving in the Golani Brigade's 51st Infantry Battalion \"HaBok'im HaRishon,\" celebrated the completion of his military service during his involvement in the Gaza genocide.",
    "Weight": 17,
    "Id": 130
},
{
    "URL": "https://x.com/trackingisrael/status/1857500016044069296",
    "Date": "15/11/2024",
    "Text": "After participating in the genocide, he took a vacation to South America.",
    "Weight": 5,
    "Id": 131
},
{
    "URL": "https://x.com/trackingisrael/status/1857493783362826504",
    "Date": "15/11/2024",
    "Text": "Israeli musician Noam Pahima, known as DJ NP, wrote in the caption of pictures he posted that he was privileged to have taken part in the genocide in Gaza. \n\nHe served in the 35th Paratroopers Brigade’s 890th Battalion during the invasion of Gaza City and Khan Yunis.",
    "Weight": 21,
    "Id": 132
},
{
    "URL": "https://x.com/trackingisrael/status/1857488610473422925",
    "Date": "15/11/2024",
    "Text": "Due to censorship algorithms on X and reports that our posts are not being reached unless visiting our page, please follow us on Telegram for uncensored tracking of Israeli soldiers involved in the genocide in Gaza and Lebanon.",
    "Weight": 17,
    "Id": 133
},
{
    "URL": "https://x.com/trackingisrael/status/1857484482229715316",
    "Date": "15/11/2024",
    "Text": "Israeli Spanish soldier Yoel Sebastian Garcia proudly posted about his involvement in the Gaza genocide while serving in the Givati Brigade’s 424th Infantry Battalion \"Shaked.\"\n\nFor the full thread, follow us on Telegram.",
    "Weight": 17,
    "Id": 134
},
{
    "URL": "https://x.com/trackingisrael/status/1857484486742528073",
    "Date": "15/11/2024",
    "Text": "He also posted footage of raids on Palestinian homes, terrorizing residents at night in the occupied West Bank, as retaliation for the deaths of his fellow soldiers in Gaza.",
    "Weight": 8,
    "Id": 135
},
{
    "URL": "https://x.com/trackingisrael/status/1857479054297116885",
    "Date": "15/11/2024",
    "Text": "Israeli reservist Sagi Agrest, of Ukrainian origin, is currently serving in the 36th Division of the 7th Armored Brigade \"Saar me-Golan\" during the invasion of southern Lebanon.",
    "Weight": 8,
    "Id": 136
},
{
    "URL": "https://x.com/trackingisrael/status/1857470965577400447",
    "Date": "15/11/2024",
    "Text": "Israeli reservist Itamar Sharabi, of Moroccan origin, filmed himself casually shooting at Gaza with a machine gun during his reserve service in the Givati Brigade’s 435th Infantry Battalion \"Rotem\" during the Gaza genocide.",
    "Weight": 21,
    "Id": 137
},
{
    "URL": "https://x.com/trackingisrael/status/1857460128124989580",
    "Date": "15/11/2024",
    "Text": "Israeli reservist Dan Novikov, of Russian origin, served in the 601st Armored Engineer Battalion \"Asaf\" and documented his role in the invasion and destruction of southern Lebanese towns.",
    "Weight": 8,
    "Id": 138
},
{
    "URL": "https://x.com/trackingisrael/status/1857450809899848018",
    "Date": "15/11/2024",
    "Text": "Israeli lacrosse coach Eyal Biton, a reservist sergeant in the Givati Brigade’s 424th Infantry Battalion \"Shaked,\" documented his participation in the Gaza genocide.",
    "Weight": 17,
    "Id": 139
},
{
    "URL": "https://x.com/trackingisrael/status/1857444659947016387",
    "Date": "15/11/2024",
    "Text": "Aleksandra Margovich, a Ukrainian recruit, was brought to Israel to join the Israeli Military Education and Youth Corps during the Gaza genocide.\n\nAfter completing the training and service, she and dozens of youths from different nationalities returned to their countries.",
    "Weight": 21,
    "Id": 140
},
{
    "URL": "https://x.com/trackingisrael/status/1857444664053297401",
    "Date": "15/11/2024",
    "Text": "Despite not being Jewish, she joined the program and served for weeks in the military logistics corps, raising the possibility that Israel may have used, or plans to use, recruits like these youths in the future.",
    "Weight": 8,
    "Id": 141
},
{
    "URL": "https://x.com/trackingisrael/status/1857166301216579689",
    "Date": "14/11/2024",
    "Text": "Israeli reservist Oshri Barhana, of African origin, served as a sniper in the 35th Paratroopers Brigade’s 890th Battalion, known as \"Efea,\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 142
},
{
    "URL": "https://x.com/trackingisrael/status/1857166305322815655",
    "Date": "14/11/2024",
    "Text": "He shared an image through his rifle’s scope showing Palestinian civilians, including a person in a wheelchair, raising their hands as they fled.",
    "Weight": 4,
    "Id": 143
},
{
    "URL": "https://x.com/trackingisrael/status/1857161325937562022",
    "Date": "14/11/2024",
    "Text": "Israeli Russian reservist Itay Berenzon was identified as having served in the Givati Brigade's 424th Infantry Battalion, 'Shaked,' during the Gaza genocide.",
    "Weight": 17,
    "Id": 144
},
{
    "URL": "https://x.com/trackingisrael/status/1857150616574873917",
    "Date": "14/11/2024",
    "Text": "An Israeli reservist from the 226th Paratroopers Brigade's Engineering Battalion 9255 documented the detonation of Matmoura village during the invasion of southern Lebanon.",
    "Weight": 8,
    "Id": 145
},
{
    "URL": "https://x.com/trackingisrael/status/1857145531975295384",
    "Date": "14/11/2024",
    "Text": "Israeli reservist Ori Ben Dayan served in the 424th Infantry Battalion \"Shaked\" during the Gaza genocide.\n\nHe celebrated the end of his service on the Al-Azhar University campus, which was detonated after their withdrawal, and later vacationed in Italy with his girlfriend.",
    "Weight": 17,
    "Id": 146
},
{
    "URL": "https://x.com/trackingisrael/status/1857142361404616746",
    "Date": "14/11/2024",
    "Text": "Russian teenager Vasia Nikolev, who has not yet acquired Israeli citizenship and does not speak Hebrew, was recruited into Israel's military Education and Youth Corps following the Gaza genocide.\n\nHe is now armed and residing in Israel.",
    "Weight": 25,
    "Id": 147
},
{
    "URL": "https://x.com/trackingisrael/status/1857126689131618650",
    "Date": "14/11/2024",
    "Text": "Israeli-Spanish soldier Eyal Molina documented and posted about his participation in the Givati Brigade's 424th Infantry Battalion \"Shaked\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 148
},
{
    "URL": "https://x.com/trackingisrael/status/1857126693439238232",
    "Date": "14/11/2024",
    "Text": "After completing his reserve service in the genocide, he went on vacation to attend a music festival in Hungary.",
    "Weight": 5,
    "Id": 149
},
{
    "URL": "https://x.com/trackingisrael/status/1857118474071343591",
    "Date": "14/11/2024",
    "Text": "Russian Israeli soldier Egor Balkovenko, from the Givati Brigade's 424th Infantry Battalion \"Shaked,\" served in the occupied West Bank during the ongoing genocide in Gaza.",
    "Weight": 17,
    "Id": 150
},
{
    "URL": "https://x.com/trackingisrael/status/1857118479037649352",
    "Date": "14/11/2024",
    "Text": "Egor moved to Israel following the start of the genocide in Gaza to serve in the army. According to his records, he never settled in Israel and does not speak Hebrew.",
    "Weight": 17,
    "Id": 151
},
{
    "URL": "https://x.com/trackingisrael/status/1857114298134270104",
    "Date": "14/11/2024",
    "Text": "Belarusian Israeli reservist Viera Šandrykava moved to Israel only after the onset of the Gaza genocide, enlisting in pre-military training for teenagers under the army's Education and Youth Corps.",
    "Weight": 21,
    "Id": 152
},
{
    "URL": "https://x.com/trackingisrael/status/1857114302424973347",
    "Date": "14/11/2024",
    "Text": "We will start posting about teenagers who moved to Israel for military purposes during the genocide.\n \nThousands of young people with Jewish ancestry, who have never lived in Israel or spoken Hebrew, moved there for military training and left after their service.",
    "Weight": 17,
    "Id": 153
},
{
    "URL": "https://x.com/trackingisrael/status/1857104509329199188",
    "Date": "14/11/2024",
    "Text": "Israeli French reservist Inon Shachar served in the Givati Brigade's 435th Infantry Battalion, \"Rotem,\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 154
},
{
    "URL": "https://x.com/trackingisrael/status/1857098959354835030",
    "Date": "14/11/2024",
    "Text": "Israeli American reservist Nir Better, a sergeant in the Givati Brigade's 424th Infantry Battalion \"Shaked,\" said he \"had fun\" as he took part in the Gaza genocide.",
    "Weight": 17,
    "Id": 155
},
{
    "URL": "https://x.com/trackingisrael/status/1857092636810633714",
    "Date": "14/11/2024",
    "Text": "Israeli soldiers' online posts depict the ongoing construction of a road barrier, an axis that separates northern Gaza from Gaza City, south of the Jabalia refugee camp.",
    "Weight": 16,
    "Id": 156
},
{
    "URL": "https://x.com/trackingisrael/status/1857092641415970851",
    "Date": "14/11/2024",
    "Text": "The occupation army is seeking to construct an axis similar to Nitsarim in central Gaza, as part of its efforts to ethnically cleanse Palestinians from the north for future settlements.",
    "Weight": 17,
    "Id": 157
},
{
    "URL": "https://x.com/trackingisrael/status/1857089086877503702",
    "Date": "14/11/2024",
    "Text": "Israeli Sergeant Mori Masrati, of European origin, commanded a company in the 282nd Artillery Brigade \"Golan\" during the relentless shelling of Palestinians in Gaza amidst the genocide.",
    "Weight": 25,
    "Id": 158
},
{
    "URL": "https://x.com/trackingisrael/status/1857079096729047066",
    "Date": "14/11/2024",
    "Text": "Israeli reservist Niv Bendely, from the Givati Brigade's 432nd Infantry Battalion \"Tzabar,\" documented his participation in the genocide in Gaza.",
    "Weight": 17,
    "Id": 159
},
{
    "URL": "https://x.com/trackingisrael/status/1857071793514651765",
    "Date": "14/11/2024",
    "Text": "Israeli Ukrainian reservist coach Artur Fara left the front lines in Ukraine to serve in the occupation army in the occupied West Bank during the genocide in Gaza.",
    "Weight": 22,
    "Id": 160
},
{
    "URL": "https://x.com/trackingisrael/status/1857070241798398389",
    "Date": "14/11/2024",
    "Text": "Israeli Argentinian reservist Leonardo Michael Garcia is currently serving in the occupation army in the occupied West Bank.",
    "Weight": 13,
    "Id": 161
},
{
    "URL": "https://x.com/trackingisrael/status/1856440950261784974",
    "Date": "12/11/2024",
    "Text": "Israeli Italian reservist Itay Peretz, a chef, served in the Givati Brigade's 435th Infantry Battalion, \"Rotem,\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 162
},
{
    "URL": "https://x.com/trackingisrael/status/1856440954607063310",
    "Date": "12/11/2024",
    "Text": "Itay celebrated his birthday inside the home of a displaced Palestinian family that his unit had occupied in Gaza.",
    "Weight": 8,
    "Id": 163
},
{
    "URL": "https://x.com/trackingisrael/status/1856435460819607807",
    "Date": "12/11/2024",
    "Text": "Israeli Ukrainian soldier Michael Antonov documented his participation in the Gaza genocide while serving in the Golani Brigade’s 12th Infantry Battalion, \"Barak.\"",
    "Weight": 17,
    "Id": 164
},
{
    "URL": "https://x.com/trackingisrael/status/1856431335478268388",
    "Date": "12/11/2024",
    "Text": "Israeli Italian reservist Giulio Supino has been identified as having served as a combat medic in the Kfir Infantry Brigade's 94th Battalion, \"Duchifat,\" during the invasion of the Jabalia refugee camp in northern Gaza.",
    "Weight": 12,
    "Id": 165
},
{
    "URL": "https://x.com/trackingisrael/status/1856425742940410200",
    "Date": "12/11/2024",
    "Text": "An Israeli soldier recorded the mass demolition of Rafah's neighborhoods from the rooftop of the UNRWA headquarters, currently being used as their military command center in the city.",
    "Weight": 10,
    "Id": 166
},
{
    "URL": "https://x.com/trackingisrael/status/1856373366665429367",
    "Date": "12/11/2024",
    "Text": "Israeli reservist Ran Hoff, of Polish origin, served as a sergeant in the 890th Paratroopers Battalion 'Efea' and participated in the Gaza genocide.",
    "Weight": 17,
    "Id": 167
},
{
    "URL": "https://x.com/trackingisrael/status/1856365862116049210",
    "Date": "12/11/2024",
    "Text": "Israeli Russian soldier Alon Klain served as a sniper in the Givati Brigade in the occupied West Bank during the Gaza genocide.\n\nHe posted an image of himself in occupied Hebron, sniping unarmed youths during raids.",
    "Weight": 17,
    "Id": 168
},
{
    "URL": "https://x.com/trackingisrael/status/1856365866897887241",
    "Date": "12/11/2024",
    "Text": "After finishing his reserve service in Israel, he went on vacation to Georgia.",
    "Weight": 4,
    "Id": 169
},
{
    "URL": "https://x.com/trackingisrael/status/1856360218298396876",
    "Date": "12/11/2024",
    "Text": "Israeli content creator Stav Asraf served in the Givati Brigade’s 432nd Infantry Battalion 'Tzabar' during the Gaza genocide, making humorous videos for his fans from displaced Palestinian homes during his reserve service.",
    "Weight": 21,
    "Id": 170
},
{
    "URL": "https://x.com/trackingisrael/status/1856079555921850868",
    "Date": "11/11/2024",
    "Text": "Israeli Spanish reservist Menachem Baruchi served in the 401st Armored Brigade during the Gaza genocide.",
    "Weight": 17,
    "Id": 171
},
{
    "URL": "https://x.com/trackingisrael/status/1856076884770980165",
    "Date": "11/11/2024",
    "Text": "Israeli reservist Liav Ben Shimol, of Yemeni origin, served in Givati’s 8170th Combat Engineer Battalion \"Gadhan\" and the 432nd Infantry Battalion \"Tzabar\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 172
},
{
    "URL": "https://x.com/trackingisrael/status/1856073326071808364",
    "Date": "11/11/2024",
    "Text": "Israeli Moldovan doctor Daniel Kinus posted proudly about raiding and looting the homes of displaced Lebanese residents while serving in the 202nd Paratroopers Battalion \"Tzapa\" during the invasion of southern Lebanon.",
    "Weight": 8,
    "Id": 173
},
{
    "URL": "https://x.com/trackingisrael/status/1856070556942004522",
    "Date": "11/11/2024",
    "Text": "Israeli reservist Yehonatan Jan documented his role in the Combat Engineering Corps, where he rigged and detonated residential neighborhoods in Gaza during the genocide.",
    "Weight": 17,
    "Id": 174
},
{
    "URL": "https://x.com/trackingisrael/status/1856068298154086670",
    "Date": "11/11/2024",
    "Text": "Israeli reservist Dael Bichacho, currently serving in the Corps of Combat Engineers' 7064th unit, is operating in Jabalia refugee camp, where the unit is separating northern Gaza from Gaza City by demolishing thousands of displaced Palestinians' homes and razing land.",
    "Weight": 24,
    "Id": 175
},
{
    "URL": "https://x.com/trackingisrael/status/1856020295863222605",
    "Date": "11/11/2024",
    "Text": "Israeli reservist Hallelya Amoyal, of North African origin, documented his role in Givati’s 435th Infantry Battalion \"Rotem\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 176
},
{
    "URL": "https://x.com/trackingisrael/status/1856016381621260301",
    "Date": "11/11/2024",
    "Text": "Israeli Major Yevgeny Yarotsky, a Ukrainian nationalist and company commander in the Gaza Division’s 143rd Division \"Firefox,\" led the 630th Infantry Battalion in the invasion of Khan Yunis during the ongoing Gaza genocide.",
    "Weight": 21,
    "Id": 177
},
{
    "URL": "https://x.com/trackingisrael/status/1856009977531347405",
    "Date": "11/11/2024",
    "Text": "Israeli soldier Netanel Hananayev, of Azerbaijani origin, documented his involvement in the Gaza genocide while serving in the Givati Brigade’s 424th Infantry Battalion, \"Shaked.\"",
    "Weight": 17,
    "Id": 178
},
{
    "URL": "https://x.com/trackingisrael/status/1856009982246068568",
    "Date": "11/11/2024",
    "Text": "He posted images of warehouses he set on fire in Gaza City and documented his role in raiding Al-Shifa Hospital in Gaza a few months ago, where hundreds of Palestinians, including doctors, women, and children, were discovered in mass graves after their withdrawal.",
    "Weight": 16,
    "Id": 179
},
{
    "URL": "https://x.com/trackingisrael/status/1855986668806787149",
    "Date": "11/11/2024",
    "Text": "Israeli reservist Gil Shavit, a renowned Italian chef, documented his participation in the systematic detonation of Palestinian homes while serving in the 605th Combat Engineering Battalion, \"HaMahatz,\" during the Gaza Genocide.",
    "Weight": 21,
    "Id": 180
},
{
    "URL": "https://x.com/trackingisrael/status/1855986672380321839",
    "Date": "11/11/2024",
    "Text": "He filmed and posted footage showing the detonation of displaced Palestinians' neighborhoods, celebrating and laughing throughout the explosions.\n\nGil accompanied an Italian journalist embedded with the occupation army in Gaza, translating the army’s falsified propaganda.",
    "Weight": 17,
    "Id": 181
},
{
    "URL": "https://x.com/trackingisrael",
    "Date": "10/11/2024",
    "Text": "Israeli American reservist Itay Bondy, a former Intel Specialist and now a Computer Networking Hardware Product Manager at DriveNets, an Israeli network cloud company, posted about his involvement in the destruction of Gaza, stating his intent to \"finish it right this time.\"",
    "Weight": 20,
    "Id": 182
},
{
    "URL": "https://x.com/trackingisrael/status/1855705663105630425",
    "Date": "10/11/2024",
    "Text": "Israeli reservist Ofek Pinker participated in the Gaza genocide and shared images of himself inside displaced Lebanese homes during his involvement in the invasion of southern Lebanon with the 9255th Paratroopers Battalion.",
    "Weight": 17,
    "Id": 183
},
{
    "URL": "https://x.com/trackingisrael/status/1855698175958421900",
    "Date": "10/11/2024",
    "Text": "Israeli reservist Tzuri Nissan was identified as having served in the 420th Paratroopers Battalion of the Paratroopers Brigade \"Shualei Marom\" during the invasion of Khan Yunis in the Gaza genocide.",
    "Weight": 17,
    "Id": 184
},
{
    "URL": "https://x.com/trackingisrael/status/1855691328623128584",
    "Date": "10/11/2024",
    "Text": "Israeli British reservist Eran Admony served in the Givati Brigade's 424th Infantry Battalion, \"Shaked,\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 185
},
{
    "URL": "https://x.com/trackingisrael/status/1855684456167944635",
    "Date": "10/11/2024",
    "Text": "Israeli reservist Yarden Hemo, of North African origin, served in the Givati Brigade’s 435th Rotem Battalion during the Gaza genocide.",
    "Weight": 17,
    "Id": 186
},
{
    "URL": "https://x.com/trackingisrael/status/1855684460550693192",
    "Date": "10/11/2024",
    "Text": "Yarden was maimed by the resistance in northern Gaza and has since been vacationing in the United States and Europe.",
    "Weight": 4,
    "Id": 187
},
{
    "URL": "https://x.com/trackingisrael/status/1855674297458753635",
    "Date": "10/11/2024",
    "Text": "Israeli American reservist Itay Bondy, a former Intel Specialist and now a Computer Networking Hardware Product Manager at DriveNets, an Israeli network cloud company, posted about his involvement in the destruction of Gaza, stating his intent to \"finish it right this time.\"",
    "Weight": 20,
    "Id": 188
},
{
    "URL": "https://x.com/trackingisrael/status/1855674301606920336",
    "Date": "10/11/2024",
    "Text": "Itay posted his genocidal intent online while serving as a Sergeant in the 605th Combat Engineering Battalion \"HaMahatz,\" a unit specializing in rigging and detonating the homes of displaced Palestinians in the Jabalia refugee camp.",
    "Weight": 8,
    "Id": 189
},
{
    "URL": "https://x.com/trackingisrael/status/1855674305620726235",
    "Date": "10/11/2024",
    "Text": "The unit Itay supervised consisted of soldiers from various Israeli multinational backgrounds, with most of them being Americans and Europeans.",
    "Weight": 8,
    "Id": 190
},
{
    "URL": "https://x.com/trackingisrael/status/1855658275619934659",
    "Date": "10/11/2024",
    "Text": "Israeli American reservist Alon Hover proudly documented and posted his involvement with the Paratroopers Brigade during the genocide in Gaza.\n\nThe battalion took a group picture inside a UNRWA school they invaded in the Jabalia refugee camp weeks ago.",
    "Weight": 17,
    "Id": 191
},
{
    "URL": "https://x.com/trackingisrael/status/1855658279181128010",
    "Date": "10/11/2024",
    "Text": "After completing his reserve service in the genocide, Alon traveled to Vietnam and the Philippines for vacation.",
    "Weight": 5,
    "Id": 192
},
{
    "URL": "https://x.com/trackingisrael/status/1855356197765050584",
    "Date": "09/11/2024",
    "Text": "Israeli Spanish reservist Alon Grunstadt posted images of himself inside displaced Lebanese homes during his participation in the invasion of southern Lebanon with the 9255th Paratroopers Battalion.",
    "Weight": 8,
    "Id": 193
},
{
    "URL": "https://x.com/trackingisrael/status/1855352624326840629",
    "Date": "09/11/2024",
    "Text": "Israeli Ukrainian reservist Danny Lomako documented his participation in the invasion of southern Lebanon with the 9255th Paratroopers Battalion.",
    "Weight": 8,
    "Id": 194
},
{
    "URL": "https://x.com/trackingisrael/status/1855352629796405640",
    "Date": "09/11/2024",
    "Text": "He made a humorous video showing how they turned the kitchen of displaced Lebanese civilians into their own Jewish kitchen.\n\nHis twin, Avner Lomako, also serves in the same battalion. Together, they own the event planning company Lomako Productions.",
    "Weight": 4,
    "Id": 195
},
{
    "URL": "https://x.com/trackingisrael/status/1855343323688648802",
    "Date": "09/11/2024",
    "Text": "Israeli reservist Sharon Simhi from the 900th Infantry Brigade \"Kfir\" bragged about the number of Palestinians they kidnapped and humiliated during raids in the occupied West Bank during the ongoing genocide in Gaza.",
    "Weight": 25,
    "Id": 196
},
{
    "URL": "https://x.com/trackingisrael/status/1855343327702344011",
    "Date": "09/11/2024",
    "Text": "Sharon is obsessed with sharing images of blindfolded, hand-tied Palestinians they kidnapped after field interrogation and torture.\n\nHe boasts that no one can stop them or force him to delete these images.",
    "Weight": 8,
    "Id": 197
},
{
    "URL": "https://x.com/trackingisrael/status/1855337325976260852",
    "Date": "09/11/2024",
    "Text": "Israeli-Mizo reservist Rony Hmar served as a sniper in the 35th Paratroopers Brigade during the Gaza genocide and the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 198
},
{
    "URL": "https://x.com/trackingisrael/status/1855337329914720295",
    "Date": "09/11/2024",
    "Text": "Rony posted videos of his battalion occupying residential areas and shooting from homes of displaced Palestinians.",
    "Weight": 8,
    "Id": 199
},
{
    "URL": "https://x.com/trackingisrael/status/1855331766309163285",
    "Date": "09/11/2024",
    "Text": "Israeli photographer Ilay Mashash documented his reserve service in the 35th Paratroopers Brigade during the Gaza genocide and his participation in the invasion of northern Lebanon.",
    "Weight": 17,
    "Id": 200
},
{
    "URL": "https://x.com/trackingisrael/status/1854992333034463475",
    "Date": "08/11/2024",
    "Text": "Israeli Ukrainian soldier served in the Nahal Brigade's 50th Battalion \"Bazelet\" during the invasion of Jabalia refugee camp.\n\nThe battalion occupied a school after forcibly displacing and kidnapping Palestinian families seeking shelter.",
    "Weight": 12,
    "Id": 201
},
{
    "URL": "https://x.com/trackingisrael/status/1855323690155508118",
    "Date": "09/11/2024",
    "Text": "Israeli Golani reservist Natan Ben-Moyal documented his involvement with the 12th Infantry Battalion, known as \"Barak,\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 202
},
{
    "URL": "https://x.com/trackingisrael/status/1855323693976600756",
    "Date": "09/11/2024",
    "Text": "\"Until Shuja'iyya Burns\" was captured in an image of the battalion during their invasion of the Al-Shuja'iyya neighborhood in central Gaza.",
    "Weight": 4,
    "Id": 203
},
{
    "URL": "https://x.com/trackingisrael/status/1855314779092734454",
    "Date": "09/11/2024",
    "Text": "Israeli reservist Doron Bar, from the Givati Brigade’s 435th Rotem Battalion, has been identified as participating in the Gaza genocide.",
    "Weight": 17,
    "Id": 204
},
{
    "URL": "https://x.com/trackingisrael/status/1855306834577355159",
    "Date": "09/11/2024",
    "Text": "Israeli soldier Ofek Carmon documented his involvement in the Gaza genocide, serving in the Givati Brigade’s 435th Battalion's Latak Unit.\n\nHe posted an image of himself praying beside hand-tied, naked Palestinians they kidnapped during a hospital raid in Khan Yunis.",
    "Weight": 25,
    "Id": 205
},
{
    "URL": "https://x.com/trackingisrael/status/1855306838016704637",
    "Date": "09/11/2024",
    "Text": "The battalion stormed multiple schools, forcibly expelled thousands of displaced Palestinian families, and occupied the buildings.\n\nUpon departure, they set the schools on fire to prevent Palestinians from returning.",
    "Weight": 12,
    "Id": 206
},
{
    "URL": "https://x.com/trackingisrael/status/1855295374782538148",
    "Date": "09/11/2024",
    "Text": "Israeli Russian reservist Richard Shein has been identified as having participated as a sniper in the Givati Brigade during the Gaza genocide. The battalion he served in used a UNRWA school as a sniping outpost.",
    "Weight": 17,
    "Id": 207
},
{
    "URL": "https://x.com/trackingisrael/status/1855295379585270212",
    "Date": "09/11/2024",
    "Text": "After completing his reserve service in the occupation army, Richard took a vacation to Japan.",
    "Weight": 5,
    "Id": 208
},
{
    "URL": "https://x.com/trackingisrael/status/1854984643738493352",
    "Date": "08/11/2024",
    "Text": "Israeli reservist Dean Levi documented his participation in the invasion of southern Lebanon, serving in the 9255th Paratroopers Battalion of the 226th \"Nesher\" Brigade.",
    "Weight": 8,
    "Id": 209
},
{
    "URL": "https://x.com/trackingisrael/status/1854970404890460482",
    "Date": "08/11/2024",
    "Text": "Israeli reservist Roy Hajaj documented his participation in the invasion of southern Lebanon, serving in the 9255th Paratroopers Battalion of the 226th \"Nesher\" Brigade.",
    "Weight": 8,
    "Id": 210
},
{
    "URL": "https://x.com/trackingisrael/status/1854967571671404621",
    "Date": "08/11/2024",
    "Text": "Israeli reservist Ori Shriki served in the Golani Brigade during the ongoing genocide in Gaza.\n\nFollowing his break from reserve duty, he went on a skiing vacation to Gudauri Park in Georgia.",
    "Weight": 17,
    "Id": 211
},
{
    "URL": "https://x.com/trackingisrael/status/1854955354372940058",
    "Date": "08/11/2024",
    "Text": "Israeli reservist Raz Nadav served in the 202nd Paratroopers Battalion \"Viper\" of the Paratroopers Brigade during the invasion of southern Lebanon.\n\nThe battalion took a memorial photo inside one of the homes they raided, stomping on a copy of the Holy Qur'an.",
    "Weight": 8,
    "Id": 212
},
{
    "URL": "https://x.com/trackingisrael/status/1854947528518553764",
    "Date": "08/11/2024",
    "Text": "Israeli reservist Sergeant Aviram Maman, of Moroccan origin, led the 9255th Paratroopers Battalion during the invasion of southern Lebanon towns.",
    "Weight": 8,
    "Id": 213
},
{
    "URL": "https://x.com/trackingisrael/status/1854941831970119953",
    "Date": "08/11/2024",
    "Text": "Israeli American reservist Snir Kiper documented his participation in the invasion of southern Lebanon with the 202nd Paratroopers Battalion \"Viper\" of the Paratroopers Brigade.",
    "Weight": 8,
    "Id": 214
},
{
    "URL": "https://x.com/trackingisrael/status/1854934691331428818",
    "Date": "08/11/2024",
    "Text": "Israeli Russian reservist Alex Gold, a nurse, served as a sniper in the 35th Paratroopers Brigade during the Gaza genocide and the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 215
},
{
    "URL": "https://x.com/trackingisrael/status/1854929148528955544",
    "Date": "08/11/2024",
    "Text": "Israeli reservist Yehuda Bachana, director of Netivyah, a biblical preaching organization, served as a sniper in the 35th Paratroopers Brigade during the Gaza genocide and the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 216
},
{
    "URL": "https://x.com/trackingisrael/status/1854923953476682186",
    "Date": "08/11/2024",
    "Text": "Israeli reservist Agam Vigdor, of Western European origin, served in the Reserve 5th Infantry Brigade \"HaSharon\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 217
},
{
    "URL": "https://x.com/trackingisrael/status/1854918862724383044",
    "Date": "08/11/2024",
    "Text": "Israeli reservist Eliav Klein, served in Golani Battalion 51 in Gaza genocide and the invasion of southern Lebanon, was involved in recent riots of Maccabi Tel Aviv fans in Amsterdam.",
    "Weight": 18,
    "Id": 218
},
{
    "URL": "https://x.com/trackingisrael/status/1854629371321237671",
    "Date": "07/11/2024",
    "Text": "Brazilian Zionist nurse Marcia Pereira volunteered with the Israeli occupation army during the genocide in Gaza, captioning her involvement as \"God's mission.\"",
    "Weight": 27,
    "Id": 219
},
{
    "URL": "https://x.com/trackingisrael/status/1854626424495243733",
    "Date": "07/11/2024",
    "Text": "Israeli soldier Noam Eliraz, of Western European origin, served in the Nahal Brigade's 932nd Infantry Battalion, \"Granit,\" and shared images documenting his involvement in the genocide in Gaza.",
    "Weight": 17,
    "Id": 220
},
{
    "URL": "https://x.com/trackingisrael/status/1854622658828128570",
    "Date": "07/11/2024",
    "Text": "Israeli soldier Lotem Una from Givati's 424th Infantry Battalion, \"Shaked,\" documented his participation in the genocide in Gaza.\n\nLotem's squad posed for a photo inside a mosque they had raided and set on fire.",
    "Weight": 17,
    "Id": 221
},
{
    "URL": "https://x.com/trackingisrael/status/1854613450464338322",
    "Date": "07/11/2024",
    "Text": "Israeli reservist Daniel Eliya said he is \"privileged\" to be part of the Israeli occupation army during the genocide in Gaza.",
    "Weight": 30,
    "Id": 222
},
{
    "URL": "https://x.com/trackingisrael/status/1854609011662111015",
    "Date": "07/11/2024",
    "Text": "Israeli Russian reservist Timosha Georgenberger was identified as having served in the 8105th Paratroopers Battalion of the Ha'Bazak Division during the genocide in Gaza.",
    "Weight": 17,
    "Id": 223
},
{
    "URL": "https://x.com/trackingisrael/status/1854605957088919582",
    "Date": "07/11/2024",
    "Text": "Israeli American reservist Yair Simpson posted about his service in the 35th Paratroopers Brigade during the Gaza genocide.",
    "Weight": 17,
    "Id": 224
},
{
    "URL": "https://x.com/trackingisrael/status/1854605960926429331",
    "Date": "07/11/2024",
    "Text": "Yair went on vacation to attend Coldplay’s festival in Hungary after participating in the genocide.",
    "Weight": 5,
    "Id": 225
},
{
    "URL": "https://x.com/trackingisrael/status/1854599568396042720",
    "Date": "07/11/2024",
    "Text": "Israeli reservist Omri Cohen served in the Paratroopers Brigade, 890th Battalion \"Efea,\" during the Gaza genocide.",
    "Weight": 17,
    "Id": 226
},
{
    "URL": "https://x.com/trackingisrael/status/1854599572363870252",
    "Date": "07/11/2024",
    "Text": "The battalion occupied a school in Al-Zeitoun neighborhood as a military base after forcibly displacing and kidnapping Palestinian families who were seeking shelter there.",
    "Weight": 4,
    "Id": 227
},
{
    "URL": "https://x.com/trackingisrael/status/1854596253142913049",
    "Date": "07/11/2024",
    "Text": "Israeli reservist Ori Amsalem, of Moroccan origin, shared images of their night raids on Palestinian homes and stores in the occupied West Bank during the genocide in Gaza.\n\nHe uploaded a video of himself vandalizing an exchange store in Bethlehem city a few weeks earlier.",
    "Weight": 21,
    "Id": 228
},
{
    "URL": "https://x.com/trackingisrael/status/1854588652220748231",
    "Date": "07/11/2024",
    "Text": "Israeli soldiers from the 7086th Combat Engineer Battalion \"Alon\" documented the detonation of displaced Lebanese homes in the village of Meiss Ej Jabal in southern Lebanon.\n\nThe soldiers celebrated as they sang, \"May your village burn.\"",
    "Weight": 8,
    "Id": 229
},
{
    "URL": "https://x.com/trackingisrael/status/1854586524135764059",
    "Date": "07/11/2024",
    "Text": "Israeli French reservist Hillel Botella, a combat medic in the Nahal Brigade, served during the genocide in Gaza.",
    "Weight": 17,
    "Id": 230
},
{
    "URL": "https://x.com/trackingisrael/status/1854586527881257053",
    "Date": "07/11/2024",
    "Text": "Hillel is currently active in Rafah City, southern Gaza.",
    "Weight": 6,
    "Id": 231
},
{
    "URL": "https://x.com/trackingisrael/status/1854582525290791049",
    "Date": "07/11/2024",
    "Text": "Israeli Mexican reservist Shay Cohen has been identified as having participated in the genocide in Gaza.",
    "Weight": 17,
    "Id": 232
},
{
    "URL": "https://x.com/trackingisrael/status/1854580359502942578",
    "Date": "07/11/2024",
    "Text": "Israeli reservist Bar Shmuel documented and proudly posted his service in the Givati Brigade’s 435th Rotem Battalion during the Gaza genocide.",
    "Weight": 17,
    "Id": 233
},
{
    "URL": "https://x.com/trackingisrael/status/1854576287806783619",
    "Date": "07/11/2024",
    "Text": "Israeli soldier Israel Aharonov, of European origin, served in the occupied West Bank with the infamous 97th Netzah Yehuda Battalion during the genocide in Gaza.\n\nHe posted an image of himself assaulting a Palestinian youth before kidnapping him during the West Bank night raids.",
    "Weight": 25,
    "Id": 234
},
{
    "URL": "https://x.com/trackingisrael/status/1854571092972589443",
    "Date": "07/11/2024",
    "Text": "Israeli American Sergeant Shaked Biton of the Givati Brigade's 435th Infantry Battalion, \"Rotem,\" was injured and had his leg amputated by the resistance during the genocide in Gaza.",
    "Weight": 17,
    "Id": 235
},
{
    "URL": "https://x.com/trackingisrael/status/1854571097028796490",
    "Date": "07/11/2024",
    "Text": "Biton, now a former football player, returned to the United States for vacation and rehabilitation, while at least 1,400 Palestinian athletes were slaughtered and thousands of Palestinians, including children, were amputated by Israel, with few able to seek proper treatment.",
    "Weight": 16,
    "Id": 236
},
{
    "URL": "https://x.com/trackingisrael/status/1854563360982942006",
    "Date": "07/11/2024",
    "Text": "Israeli soldier Shahar Ben Yosef served in the Givati Brigade's 424th Infantry Battalion, \"Shaked,\" during the ongoing genocide in Gaza.",
    "Weight": 17,
    "Id": 237
},
{
    "URL": "https://x.com/trackingisrael/status/1854560167314206939",
    "Date": "07/11/2024",
    "Text": "Israeli Georgian soldier Omer Levani served in the Givati Brigade's 435th Rotem Battalion during the genocide in Gaza.\n\nHe shared images from inside the homes of displaced Palestinians in Al-Bureij Refugee Camp, vandalizing them with genocidal and racist slurs.",
    "Weight": 25,
    "Id": 238
},
{
    "URL": "https://x.com/trackingisrael/status/1854553145361215615",
    "Date": "07/11/2024",
    "Text": "Israeli Russian reservist Yoni Jonathan participated in the Gaza genocide, serving in a Givati battalion during the invasion of Gaza City.",
    "Weight": 21,
    "Id": 239
},
{
    "URL": "https://x.com/trackingisrael/status/1854547440449294757",
    "Date": "07/11/2024",
    "Text": "Israeli reservist Sergeant Israel Kaufman, of Polish origin, served in the Givati Brigade's 8170th Combat Engineer Battalion during the Gaza genocide.",
    "Weight": 21,
    "Id": 240
},
{
    "URL": "https://x.com/trackingisrael/status/1854535726026702871",
    "Date": "07/11/2024",
    "Text": "Israeli soldier Roi Chaet, of Argentinian origin, served in the Givati Brigade's 424th Battalion during the Gaza genocide.\n\nThe soldiers of this battalion boasted about setting fire to hundreds of homes of displaced Palestinians during their raids in central Gaza and Khan Yunis.",
    "Weight": 29,
    "Id": 241
},
{
    "URL": "https://x.com/trackingisrael/status/1854530314183307418",
    "Date": "07/11/2024",
    "Text": "Israeli reservist Inon Ganon documented his participation in the Gaza genocide. He served in the Nahal Brigade's 931st Battalion.",
    "Weight": 17,
    "Id": 242
},
{
    "URL": "https://x.com/trackingisrael/status/1854530318490874114",
    "Date": "07/11/2024",
    "Text": "He took a holiday in Greece during his reserve break and is now deployed in Rafah City.",
    "Weight": 2,
    "Id": 243
},
{
    "URL": "https://x.com/trackingisrael/status/1853905925905473644",
    "Date": "05/11/2024",
    "Text": "Israeli soldier Ilay Trabelsi, of North African origin, served in the Givati Battalion and posted images of his participation in the genocide in Gaza.\n\nOne of the images shows him pointing his rifle at the head of one of the Palestinians they kidnapped from Khan Yunis.",
    "Weight": 25,
    "Id": 244
},
{
    "URL": "https://x.com/trackingisrael/status/1853901731014615051",
    "Date": "05/11/2024",
    "Text": "Israeli soldier Asaf Norani served as a gunner in the 424th Battalion of the Givati Brigade during the ongoing genocide in Gaza.",
    "Weight": 17,
    "Id": 245
},
{
    "URL": "https://x.com/trackingisrael/status/1853901735028212082",
    "Date": "05/11/2024",
    "Text": "Norani posted numerous GoPro footage of himself spraying bullets inside a mosque they raided in Khan Yunis, in addition to indiscriminately opening fire inside displaced Palestinians' homes.",
    "Weight": 8,
    "Id": 246
},
{
    "URL": "https://x.com/trackingisrael/status/1853896267933581409",
    "Date": "05/11/2024",
    "Text": "Israeli soldier Guy Keynan, from the Givati 435th Rotem Battalion, uploaded images of igniting displaced Palestinians' homes in Khan Yunis during his participation in the genocide in Gaza.",
    "Weight": 25,
    "Id": 247
},
{
    "URL": "https://x.com/trackingisrael/status/1853896271989178497",
    "Date": "05/11/2024",
    "Text": "He recorded the forcible displacement of thousands of Palestinians in central Gaza, referring to them as \"those are all sons of b*****,\" while gloating over their misery.",
    "Weight": 12,
    "Id": 248
},
{
    "URL": "https://x.com/trackingisrael/status/1853886605771043305",
    "Date": "05/11/2024",
    "Text": "Israeli soldier Amit Gendler, of Russian origin from the Givati 435th Rotem Battalion, vandalized Palestinian homes he raided while participating in the genocide in Gaza.",
    "Weight": 21,
    "Id": 249
},
{
    "URL": "https://x.com/trackingisrael/status/1853880778591228363",
    "Date": "05/11/2024",
    "Text": "Israeli soldier Daniel Dahan served in the Givati 435th Infantry Battalion \"Rotem\" during the ongoing genocide in Gaza.",
    "Weight": 17,
    "Id": 250
},
{
    "URL": "https://x.com/trackingisrael/status/1853876934091919528",
    "Date": "05/11/2024",
    "Text": "Israeli reservist Avior Alamo, of Ethiopian origin, is currently serving in Givati's 432nd Infantry Battalion \"Tzabar\" involved in the ethnic cleansing of Palestinians in Jabalia refugee camp in northern Gaza.",
    "Weight": 20,
    "Id": 251
},
{
    "URL": "https://x.com/trackingisrael/status/1853873850682855890",
    "Date": "05/11/2024",
    "Text": "Israeli reservist Or Yossef, of Ethiopian origin, documented his participation in the Golani Brigade during the ongoing genocide in Gaza.\n\nHe is currently vacationing in Prague, Czech Republic, after finishing his reserve service in Gaza and Lebanon.",
    "Weight": 21,
    "Id": 252
},
{
    "URL": "https://x.com/trackingisrael/status/1853873854352929221",
    "Date": "05/11/2024",
    "Text": "He uploaded images from inside a hospital they had invaded, forcibly kicking and kidnapping Palestinians who were sheltering there.",
    "Weight": 8,
    "Id": 253
},
{
    "URL": "https://x.com/trackingisrael/status/1853873858048377293",
    "Date": "05/11/2024",
    "Text": "They detonated and set fire to the homes and schools of displaced Palestinians in Jabalia refugee camp.\n\nOr also participated in the invasion of southern Lebanon, raiding and looting the homes of displaced Lebanese before detonating them.",
    "Weight": 8,
    "Id": 254
},
{
    "URL": "https://x.com/trackingisrael/status/1853868376977760439",
    "Date": "05/11/2024",
    "Text": "Israeli American soldier Dan Nahmani served in Givati's 424th Infantry Battalion \"Shaked\" during the ongoing genocide in Gaza and the occupation of Rafah Crossing.",
    "Weight": 24,
    "Id": 255
},
{
    "URL": "https://x.com/trackingisrael/status/1853868381084192845",
    "Date": "05/11/2024",
    "Text": "The battalion has set thousands of homes belonging to displaced Palestinians on fire, leaving them with nothing to return to.",
    "Weight": 8,
    "Id": 256
},
{
    "URL": "https://x.com/trackingisrael/status/1853859575054700601",
    "Date": "05/11/2024",
    "Text": "Israeli reservist Omer Yahud, also known as \"Jodox,\" a DJ by profession, posed boastfully in a photo beside Palestinians they had kidnapped in the occupied West Bank.\n\nOmer has also served with the Givati Brigade during the ongoing genocide in Gaza.",
    "Weight": 25,
    "Id": 257
},
{
    "URL": "https://x.com/trackingisrael/status/1853856569395396624",
    "Date": "05/11/2024",
    "Text": "Israeli reservist Shalev Zino, of North African origin, served with the 424 Battalion of the Givati Brigade during the ongoing genocide in Gaza.\n\nHe posted images of the battalion occupying the homes of displaced Palestinians before setting them ablaze or detonating them.",
    "Weight": 25,
    "Id": 258
},
{
    "URL": "https://x.com/trackingisrael/status/1853540706998006161",
    "Date": "04/11/2024",
    "Text": "Israeli soldier Liad Ohayon, of Moroccan origin, served in the Givati Brigade's Shaked Battalion during the Gaza genocide.\n\nLiad and other soldiers from the same unit went on vacation to Austria following their completion of service in Gaza.",
    "Weight": 21,
    "Id": 259
},
{
    "URL": "https://x.com/trackingisrael/status/1853533825986441704",
    "Date": "04/11/2024",
    "Text": "Israeli soldier Adi Daniel from the Givati Brigade's Shaked Battalion posted an image of himself in front of the UNRWA health center building in Rafah that they raided and converted into a military base.",
    "Weight": 10,
    "Id": 260
},
{
    "URL": "https://x.com/trackingisrael/status/1853527931848655123",
    "Date": "04/11/2024",
    "Text": "Israeli reservist Liran Amir, a captain in the Givati Brigade's 424th Battalion, documented his participation in the Gaza genocide.\n\nHe is currently involved in the ethnic cleansing of Palestinians in the Jabalia refugee camp in northern Gaza.",
    "Weight": 31,
    "Id": 261
},
{
    "URL": "https://x.com/trackingisrael/status/1853513903772246089",
    "Date": "04/11/2024",
    "Text": "Israeli Argentinian reservist Asaf Paz served as a gunner in Givati's 435th Battalion in the Gaza genocide.\n\nThe battalion occupied a school after forcibly evicting and kidnapping displaced Palestinian families who had taken shelter there, converting it into a military base.",
    "Weight": 21,
    "Id": 262
},
{
    "URL": "https://x.com/trackingisrael/status/1853506325092921557",
    "Date": "04/11/2024",
    "Text": "Israeli soldier Tamir Camisa, of Italian origin, documented his role as a gunner in the Latak Unit within Givati's 435th Battalion in the Gaza genocide.",
    "Weight": 17,
    "Id": 263
},
{
    "URL": "https://x.com/trackingisrael/status/1853506329765187780",
    "Date": "04/11/2024",
    "Text": "Tamir and his unit are currently involved in the ethnic cleansing of Palestinians in Jabalia.\n\n\n@ytirawi\n has recently published an image of them reportedly using a Palestinian civilian they had kidnapped as a human shield during their missions within the camp.",
    "Weight": 12,
    "Id": 264
},
{
    "URL": "https://x.com/trackingisrael/status/1853506333816877234",
    "Date": "04/11/2024",
    "Text": "He published his GoPro footage of raiding displaced Palestinian homes and randomly shooting during the invasion of Deir al-Balah and Khan Yunis.",
    "Weight": 4,
    "Id": 265
},
{
    "URL": "https://x.com/trackingisrael/status/1853497223369445826",
    "Date": "04/11/2024",
    "Text": "Israeli soldier Shahar Naftali served as a combat medic in the 932nd Nahal Infantry Battalion 'Granite' during the Gaza genocide.",
    "Weight": 17,
    "Id": 266
},
{
    "URL": "https://x.com/trackingisrael/status/1853497227680817436",
    "Date": "04/11/2024",
    "Text": "He posted images from inside a hospital they raided and destroyed during the invasion of Rafah.",
    "Weight": 2,
    "Id": 267
},
{
    "URL": "https://x.com/trackingisrael/status/1853497231359238255",
    "Date": "04/11/2024",
    "Text": "Shooting an American-supplied grenade launcher at displaced Palestinians' homes for fun.",
    "Weight": 8,
    "Id": 268
},
{
    "URL": "https://x.com/trackingisrael/status/1853491194921144415",
    "Date": "04/11/2024",
    "Text": "Israeli soldier Adir Yiftach served as a combat medic in the Givati 424th Battalion during the Gaza genocide.\n\nHe posted images of himself and other soldiers in the displaced Palestinians' homes that they looted and vandalized.",
    "Weight": 25,
    "Id": 269
},
{
    "URL": "https://x.com/trackingisrael/status/1853491198419222747",
    "Date": "04/11/2024",
    "Text": "Yiftach was deployed in Rafah and posted images of the occupation of Rafah Crossing with Egypt, denying the entry of aid and starving Palestinians in the Strip.",
    "Weight": 17,
    "Id": 270
},
{
    "URL": "https://x.com/trackingisrael/status/1853485438788329667",
    "Date": "04/11/2024",
    "Text": "American Israeli reservist Gilad Geller served as a gunner in the 35th Paratroopers Brigade in the Gaza genocide.",
    "Weight": 17,
    "Id": 271
},
{
    "URL": "https://x.com/trackingisrael/status/1853480708716761457",
    "Date": "04/11/2024",
    "Text": "Israeli soldier Aviv Sadot, of European origin, served in the Givati Brigade’s 435th Rotem Battalion in the Gaza genocide.",
    "Weight": 17,
    "Id": 272
},
{
    "URL": "https://x.com/trackingisrael/status/1853178511667671541",
    "Date": "03/11/2024",
    "Text": "Israeli-Ethiopian soldier Danny Nagoso from the Givati 435th Rotem Battalion documented his participation in the genocide in Gaza.",
    "Weight": 17,
    "Id": 273
},
{
    "URL": "https://x.com/trackingisrael/status/1853178516579164669",
    "Date": "03/11/2024",
    "Text": "After completing their service period in Gaza, Danny and his squad went on vacation to Amsterdam.",
    "Weight": 4,
    "Id": 274
},
{
    "URL": "https://x.com/trackingisrael/status/1853173164458508429",
    "Date": "03/11/2024",
    "Text": "Israeli reservist Roey Oz Salmon served in the Givati 435th Rotem Battalion during the ongoing genocide in Gaza.\n\nThe images depict the battalion using a school as a military base after forcibly evicting displaced Palestinian families who were sheltering there.",
    "Weight": 21,
    "Id": 275
},
{
    "URL": "https://x.com/trackingisrael/status/1853173168766153040",
    "Date": "03/11/2024",
    "Text": "They also raided and looted the homes of displaced Palestinians before detonating them or setting them on fire.",
    "Weight": 8,
    "Id": 276
},
{
    "URL": "https://x.com/trackingisrael/status/1853167247189328119",
    "Date": "03/11/2024",
    "Text": "Israeli soldier Mori Ben Salmon, of British origin, served in the 12th Infantry Battalion 'Barak' during the ongoing genocide in Gaza and also participated in the invasion of Yaroun in southern Lebanon.",
    "Weight": 17,
    "Id": 277
},
{
    "URL": "https://x.com/trackingisrael/status/1853160722315784252",
    "Date": "03/11/2024",
    "Text": "Israeli French reservist Elie Timsit from the 890th Battalion of the Paratroopers Brigade took part in the ongoing genocide in Gaza.",
    "Weight": 17,
    "Id": 278
},
{
    "URL": "https://x.com/trackingisrael/status/1853151908237861176",
    "Date": "03/11/2024",
    "Text": "Israeli-Ethiopian reservist Shalev Mekonen served in the Givati Brigade's 424th Battalion during the ongoing genocide in Gaza.\n\nHe expressed a desire to be deployed to Gaza for \"revenge.\"",
    "Weight": 21,
    "Id": 279
},
{
    "URL": "https://x.com/trackingisrael/status/1853137844514038116",
    "Date": "03/11/2024",
    "Text": "Israeli Captain and intelligence officer Noga Pashchur, of Slavic origin, accompanied the 401st Armored Brigade during the invasion of Gaza, where she posed for a photo inside a mosque that had been desecrated by the forces.",
    "Weight": 12,
    "Id": 280
},
{
    "URL": "https://x.com/trackingisrael/status/1853127387040436733",
    "Date": "03/11/2024",
    "Text": "Israeli reservist Zohar Yossef, of Mexican origin, served in the 35th Paratroopers Brigade, known as \"Tzanchanim,\" during the ongoing genocide in Gaza, documenting his experiences throughout his service.",
    "Weight": 17,
    "Id": 281
},
{
    "URL": "https://x.com/trackingisrael/status/1853114658489540874",
    "Date": "03/11/2024",
    "Text": "Israeli Kenyan reservist Ilan Baya, an infantryman in the 12th Battalion, 'Barak,' of the Golani Brigade, served in the occupied West Bank during the ongoing genocide in Gaza and participated in the invasion of southern Lebanon.",
    "Weight": 17,
    "Id": 282
},
{
    "URL": "https://x.com/trackingisrael/status/1853104244796043382",
    "Date": "03/11/2024",
    "Text": "Israeli soldier Michael Danino served in the Golani Brigade during the ongoing genocide in Gaza.",
    "Weight": 17,
    "Id": 283
},
{
    "URL": "https://x.com/trackingisrael/status/1853099322159579490",
    "Date": "03/11/2024",
    "Text": "Israeli soldier Yagel Eliya Camos, originally from Argentina, served in the Shaked Battalion of the Givati Brigade during the ongoing genocide in Gaza.",
    "Weight": 17,
    "Id": 284
},
{
    "URL": "https://x.com/trackingisrael/status/1852817239621108154",
    "Date": "02/11/2024",
    "Text": "Israeli soldier Yagel Shneour, of Belarusian origin, served in the Shaked Battalion of the Givati Brigade and posted images showing the battalion taking over a school as a military base after forcibly removing displaced Palestinians sheltering there during the genocide in Gaza.",
    "Weight": 25,
    "Id": 285
},
{
    "URL": "https://x.com/trackingisrael/status/1852813068125749515",
    "Date": "02/11/2024",
    "Text": "Israeli soldier Shachaf Avitan from the Givati Brigade took part in the genocide in Gaza.",
    "Weight": 17,
    "Id": 286
},
{
    "URL": "https://x.com/trackingisrael/status/1852808922672824442",
    "Date": "02/11/2024",
    "Text": "Israeli soldier Harel Amshika from the Givati Brigade posed for online photos inside the Turkish-Palestinian Friendship Hospital in Gaza, which was raided by the Israeli army, rendered out of service, and converted into a military base.",
    "Weight": 24,
    "Id": 287
},
{
    "URL": "https://x.com/trackingisrael/status/1852808927647252486",
    "Date": "02/11/2024",
    "Text": "Making jokes about Palestinian civilians as they forcibly forced them out of their neighborhoods.",
    "Weight": 4,
    "Id": 288
},
{
    "URL": "https://x.com/trackingisrael/status/1852804731867140305",
    "Date": "02/11/2024",
    "Text": "Israeli Druze reservist Eyal Kayouf from the Shaked Battalion of the Givati Brigade was identified as actively involved in the ethnic cleansing of Palestinians in Jabalia refugee camp in northern Gaza.",
    "Weight": 20,
    "Id": 289
},
{
    "URL": "https://x.com/trackingisrael/status/1852799224196280344",
    "Date": "02/11/2024",
    "Text": "Israeli soldier Elior Hadad proudly documented his participation as a gunner with the Golani Battalion in invading Khan Yunis during the genocide in Gaza.",
    "Weight": 17,
    "Id": 290
},
{
    "URL": "https://x.com/trackingisrael/status/1852795091934384556",
    "Date": "02/11/2024",
    "Text": "Israeli soldier Yam Cohen served in the Shaked Battalion of the Givati Brigade during the genocide in Gaza, and he is currently active in the ethnic cleansing of Palestinians in Jabalia refugee camp, northern Gaza.",
    "Weight": 29,
    "Id": 291
},
{
    "URL": "https://x.com/trackingisrael/status/1852791673266336162",
    "Date": "02/11/2024",
    "Text": "Israeli soldier Mor Cohen documented his role in the genocide in Gaza; he served in the Givati Brigade, 424th Battalion.",
    "Weight": 17,
    "Id": 292
},
{
    "URL": "https://x.com/trackingisrael/status/1852786338233246159",
    "Date": "02/11/2024",
    "Text": "Israeli American reservist Yuval Richman was identified as having taken part in the genocide in Gaza; he served in the Givati Brigade, 424th Battalion.",
    "Weight": 17,
    "Id": 293
},
{
    "URL": "https://x.com/trackingisrael/status/1852786342725403005",
    "Date": "02/11/2024",
    "Text": "His squad regularly took photos inside displaced Palestinians' homes before setting them on fire.",
    "Weight": 8,
    "Id": 294
},
{
    "URL": "https://x.com/trackingisrael/status/1852769936382341427",
    "Date": "02/11/2024",
    "Text": "Israeli reservist Aviv Betito from the Givati Brigade posted humorous videos inside the homes of displaced or killed Palestinians before setting them on fire during the genocide in Gaza.",
    "Weight": 25,
    "Id": 295
},
{
    "URL": "https://x.com/trackingisrael/status/1852764376870129691",
    "Date": "02/11/2024",
    "Text": "Israeli soldiers from the Givati Brigade celebrated by placing a Jewish mezuzah on the door of the home of displaced Palestinians after ethnically cleansing them from Jabalia refugee camp in northern Gaza.",
    "Weight": 24,
    "Id": 296
},
{
    "URL": "https://x.com/trackingisrael/status/1839738755617296464",
    "Date": "27/09/2024",
    "Text": "Israeli reservist Refael Shein shared posts on Instagram documenting his involvement of the genocide in Gaza, including images showing the raid and destruction of a UNRWA warehouse.",
    "Weight": 17,
    "Id": 297
},
{
    "URL": "https://x.com/trackingisrael/status/1839738762227495039",
    "Date": "27/09/2024",
    "Text": "He boasted of raising the Jewish Hanukkah next to a destroyed Palestinian home.",
    "Weight": 8,
    "Id": 298
},
{
    "URL": "https://x.com/trackingisrael/status/1852759563759468856",
    "Date": "02/11/2024",
    "Text": "Israeli lawyer Refael Shein from the Golani Brigade documented his reserve service in Lebanon.\n\nDuring their invasion into southern Lebanon, the battalion detonated hundreds of displaced Lebanese civilians' homes.",
    "Weight": 8,
    "Id": 299
},
{
    "URL": "https://x.com/trackingisrael/status/1852755628009127991",
    "Date": "02/11/2024",
    "Text": "Israeli soldier David Dobensky, of American origin, served in the 202nd Paratroopers, 'Viper' Battalion, in the genocide in Gaza.",
    "Weight": 17,
    "Id": 300
},
{
    "URL": "https://x.com/trackingisrael/status/1852737734089011243",
    "Date": "02/11/2024",
    "Text": "Israeli soldier Ofek Nissan from the Givati Brigade, 435th Operation Battalion, posted images inside a wedding hall they set on fire during his participation in the genocide in Gaza, captioning the album as \"Some souvenirs from Gaza.\"",
    "Weight": 21,
    "Id": 301
},
{
    "URL": "https://x.com/trackingisrael/status/1852737738065293726",
    "Date": "02/11/2024",
    "Text": "This battalion has set hundreds of Palestinian homes on fire, leaving displaced Palestinians with nowhere to return to, including schools and hospitals.",
    "Weight": 12,
    "Id": 302
},
{
    "URL": "https://x.com/trackingisrael/status/1852457306421940367",
    "Date": "01/11/2024",
    "Text": "Israeli reservist and photographer Ori Meirovitch from the Givati Brigade photographed soldiers inside a mosque they had invaded during the genocide in Gaza.",
    "Weight": 17,
    "Id": 303
},
{
    "URL": "https://x.com/trackingisrael/status/1852457310292984150",
    "Date": "01/11/2024",
    "Text": "Meirovitch offers free photo sessions for soldiers and former soldiers during and after the genocide.",
    "Weight": 5,
    "Id": 304
},
{
    "URL": "https://x.com/trackingisrael/status/1852449885007528226",
    "Date": "01/11/2024",
    "Text": "An Israeli engineering unit posted footage of their detonation of a mosque and displaced Lebanese homes in the village of Qaouzah, southern Lebanon.",
    "Weight": 8,
    "Id": 305
},
{
    "URL": "https://x.com/trackingisrael/status/1852440584583094594",
    "Date": "01/11/2024",
    "Text": "Israeli American Commander Matan Dahan served in the 890th Battalion of the Paratroopers Brigade during the genocide in Gaza.",
    "Weight": 17,
    "Id": 306
},
{
    "URL": "https://x.com/trackingisrael/status/1852431850225942690",
    "Date": "01/11/2024",
    "Text": "Israeli reservist Moshe Deri documented his reserve service in the Alon Battalion 8717 during the genocide in Gaza.",
    "Weight": 17,
    "Id": 307
},
{
    "URL": "https://x.com/trackingisrael/status/1852431854105731232",
    "Date": "01/11/2024",
    "Text": "He published footage of himself emptying his ammunition at destroyed Palestinian homes for an online post.",
    "Weight": 4,
    "Id": 308
},
{
    "URL": "https://x.com/trackingisrael/status/1852427011496784347",
    "Date": "01/11/2024",
    "Text": "Israeli soldier Assaf Ravem, of Colombian origin, boasted about his service in the Givati Battalion during the genocide in Gaza.",
    "Weight": 17,
    "Id": 309
},
{
    "URL": "https://x.com/trackingisrael/status/1852422161509584922",
    "Date": "01/11/2024",
    "Text": "Israeli soldier Ori Levi from the Givati Brigade documented his involvement in the genocide in Gaza.\n\nHe shared footage of himself, and his battalion shooting rockets for fun, raiding displaced Palestinian homes, looting, and joking around with women's clothing.",
    "Weight": 21,
    "Id": 310
},
{
    "URL": "https://x.com/trackingisrael/status/1852422165519327336",
    "Date": "01/11/2024",
    "Text": "The battalion is currently taking part in the ethnic cleansing of Palestinians in northern Gaza, specifically in the Jabalia refugee camp.",
    "Weight": 12,
    "Id": 311
},
{
    "URL": "https://x.com/trackingisrael/status/1852422169361289468",
    "Date": "01/11/2024",
    "Text": "Mockingly joking about a destroyed car they had wrecked, which belonged to displaced or killed Palestinians.",
    "Weight": 8,
    "Id": 312
},
{
    "URL": "https://x.com/trackingisrael/status/1852413775460118608",
    "Date": "01/11/2024",
    "Text": "Israeli reservist and IJF Judo International Referee Amit Leopold took part in the genocide in Gaza as a field commander in the Golani Brigade, invading and annihilating northern Gaza.",
    "Weight": 21,
    "Id": 313
},
{
    "URL": "https://x.com/trackingisrael/status/1852407734517543309",
    "Date": "01/11/2024",
    "Text": "Israeli American reservist Tal Matza posted about his participation in the genocide in Gaza, captioning it that he is proud to be part of it.\n\nAfter finishing his first reserve service, he vacationed in Athens, Greece.",
    "Weight": 17,
    "Id": 314
},
{
    "URL": "https://x.com/trackingisrael/status/1852402477108265359",
    "Date": "01/11/2024",
    "Text": "American Israeli reservist Refael Swisa participated in the Gaza genocide by operating a D9 bulldozer; he described the invasion of northern Gaza and the mass demolition of Palestinian neighborhoods as a \"big trip.\"",
    "Weight": 25,
    "Id": 315
},
{
    "URL": "https://x.com/trackingisrael/status/1852093662496207122",
    "Date": "31/10/2024",
    "Text": "Israeli occupation soldiers laughed and celebrated as they shelled and destroyed a mosque in southern Lebanon today.",
    "Weight": 13,
    "Id": 316
},
{
    "URL": "https://x.com/trackingisrael/status/1852092752500002843",
    "Date": "31/10/2024",
    "Text": "Israeli reservist Itzkhak Chawngthum, of Indian origin, was identified as currently serving in the Latak Unit in southern Lebanon.\n\nHe is among a battalion that published footage of indiscriminately shooting grenades at displaced Lebanese civilian homes, seemingly for fun.",
    "Weight": 8,
    "Id": 317
},
{
    "URL": "https://x.com/trackingisrael/status/1852083226581570005",
    "Date": "31/10/2024",
    "Text": "The Israeli Givati Battalion celebrated the ethnic cleansing of Palestinians by playing the Israeli anthem today at the Jabalia Services Club in northern Gaza.",
    "Weight": 28,
    "Id": 318
},
{
    "URL": "https://x.com/trackingisrael/status/1852079066616336513",
    "Date": "31/10/2024",
    "Text": "Israeli Ethiopian reservist Fkado Wondmagen from the 22nd Paratroopers documented his role in Gaza and referred to the invasion and genocide as a \"Liberation holiday.\"",
    "Weight": 17,
    "Id": 319
},
{
    "URL": "https://x.com/trackingisrael/status/1852069329418047544",
    "Date": "31/10/2024",
    "Text": "American Israeli reservist Jonathan Etzioni served in the Nahal Brigade in the occupied West Bank during the genocide in Gaza.",
    "Weight": 17,
    "Id": 320
},
{
    "URL": "https://x.com/trackingisrael/status/1852057998480543949",
    "Date": "31/10/2024",
    "Text": "Israeli Australian reservist Omer Lugasi documented his reserve in the occupied West Bank, storming Palestinian homes at night and posing for pictures inside them while kidnapping civilians.",
    "Weight": 12,
    "Id": 321
},
{
    "URL": "https://x.com/trackingisrael/status/1852058003043946655",
    "Date": "31/10/2024",
    "Text": "Omer is originally from Hungary and is currently in Melbourne, Australia, after completing his reserve duty in the occupation army.",
    "Weight": 5,
    "Id": 322
},
{
    "URL": "https://x.com/trackingisrael/status/1852053379633287400",
    "Date": "31/10/2024",
    "Text": "Israeli Brazilian soldier Afik Zabloski from the Nahal Brigade posted images from his post at the Nahal Oz military checkpoint, north of the Gaza Strip, showing a Palestinian youth, they had kidnapped from Gaza—naked, blindfolded, and with hands tied.",
    "Weight": 20,
    "Id": 323
},
{
    "URL": "https://x.com/trackingisrael/status/1852050928226177525",
    "Date": "31/10/2024",
    "Text": "Israeli reservist Commander Oz Mizrachi from the Givati Brigade documented his service in the genocide in Gaza.",
    "Weight": 17,
    "Id": 324
},
{
    "URL": "https://x.com/trackingisrael/status/1852047971543867709",
    "Date": "31/10/2024",
    "Text": "Images published by Israeli photographer Eugene Levit, embedded with the occupation army, depict the takeover of displaced Palestinians' homes in Khan Yunis.",
    "Weight": 21,
    "Id": 325
},
{
    "URL": "https://x.com/trackingisrael/status/1852046683418562833",
    "Date": "31/10/2024",
    "Text": "\"Bye bye Aitaroun, Lebanon\"\n\nAn Israeli soldier from the 6628th Battalion of the Combat Engineering Corps shared footage of the detonation of displaced Lebanese homes in the village of Aitaroun in southern Lebanon.",
    "Weight": 8,
    "Id": 326
},
{
    "URL": "https://x.com/trackingisrael/status/1852044354342523015",
    "Date": "31/10/2024",
    "Text": "For uncensored tracking of Israeli soldiers involved in the genocide in Gaza and Lebanon, follow us now on Telegram:",
    "Weight": 17,
    "Id": 327
},
{
    "URL": "https://x.com/trackingisrael/status/1852043618082869300",
    "Date": "31/10/2024",
    "Text": "Israeli Azerbaijani reservist Lior Eliyahu Svirgo was identified as having taken part in the genocide in Gaza while serving in the Alon Battalion 8717.",
    "Weight": 17,
    "Id": 328
},
{
    "URL": "https://x.com/trackingisrael/status/1852015330576515217",
    "Date": "31/10/2024",
    "Text": "Israeli Lumen software engineer and former senior software engineer at Dell and Intel, Assaf Mohaban, observed a Jewish tradition by going down into a water well belonging to displaced Lebanese civilians to take a bath during his current service in the southern Lebanon invasion.",
    "Weight": 12,
    "Id": 329
},
{
    "URL": "https://x.com/trackingisrael/status/1851996069279736300",
    "Date": "31/10/2024",
    "Text": "Israeli Russian reservist Ruslan Mince documented indiscriminate gunfire and the detonation of Palestinian neighborhoods in Gaza while serving in the Alon Battalion 8717 during the genocide.\n\nThe squad Ruslan served in consisted of soldiers with Russian and Balkan origins.",
    "Weight": 21,
    "Id": 330
},
{
    "URL": "https://x.com/trackingisrael/status/1851992485678993857",
    "Date": "31/10/2024",
    "Text": "Israeli Russian reservist Max Khonin, identified to have served in the Alon Battalion 8717, participated in the genocide in Gaza.",
    "Weight": 17,
    "Id": 331
},
{
    "URL": "https://x.com/trackingisrael/status/1851370200270029080",
    "Date": "29/10/2024",
    "Text": "Israeli Microsoft software engineer Yakir Ben-Elisha served as a sniper in the special unit 'LOTAR' during the genocide in Gaza.",
    "Weight": 17,
    "Id": 332
},
{
    "URL": "https://x.com/trackingisrael",
    "Date": "27/10/2024",
    "Text": "For uncensored tracking of Israeli soldiers involved in the genocide in Gaza, follow us now on Telegram:",
    "Weight": 17,
    "Id": 333
},
{
    "URL": "https://x.com/trackingisrael/status/1851370205177643390",
    "Date": "29/10/2024",
    "Text": "According to doctors who worked in Gaza hospitals, thousands of Palestinian civilians, including children and women, were killed by sniper bullets throughout Gaza.",
    "Weight": 12,
    "Id": 334
},
{
    "URL": "https://x.com/trackingisrael/status/1851363405367546050",
    "Date": "29/10/2024",
    "Text": "Israeli-Philippine reservist Justin Flores, a captain in the Military Logistics Corps, posted with pride about his participation in the genocide in Gaza.",
    "Weight": 17,
    "Id": 335
},
{
    "URL": "https://x.com/trackingisrael/status/1851359117790544268",
    "Date": "29/10/2024",
    "Text": "Israeli reservist Yarin Barenboim, of Russian origin and from the 35th Paratroopers Brigade, posted about his participation in the genocide in Gaza.",
    "Weight": 17,
    "Id": 336
},
{
    "URL": "https://x.com/trackingisrael/status/1851354080582447455",
    "Date": "29/10/2024",
    "Text": "Israeli reservist Maxim Kiselman, of Ukrainian origin, filmed the detonation of Palestinian homes while serving in the Combat Engineering Corps during the genocide in Gaza.",
    "Weight": 21,
    "Id": 337
},
{
    "URL": "https://x.com/trackingisrael/status/1851350479382724718",
    "Date": "29/10/2024",
    "Text": "Israeli reservist Bar Ferber filmed and posted videos of himself randomly shooting his machine gun while serving in the 35th Paratroopers Brigade in the genocide in Gaza.",
    "Weight": 17,
    "Id": 338
},
{
    "URL": "https://x.com/trackingisrael/status/1851347457063502128",
    "Date": "29/10/2024",
    "Text": "Israeli French reservist Ilan Dukan has been identified as having served in the 35th Paratroopers Brigade in the genocide in Gaza.",
    "Weight": 17,
    "Id": 339
},
{
    "URL": "https://x.com/trackingisrael/status/1851342478261068136",
    "Date": "29/10/2024",
    "Text": "Israeli French soldier Paz Zrihen documented his participation in the genocide and ethnic cleansing of Palestinians in Gaza.",
    "Weight": 25,
    "Id": 340
},
{
    "URL": "https://x.com/trackingisrael/status/1851339172369375355",
    "Date": "29/10/2024",
    "Text": "Israeli Russian reservist John Bruk has been identified as having served in the Israeli occupation army during the genocide in Gaza, where he participated in demolishing and setting fire to displaced Palestinians' homes in Gaza City.",
    "Weight": 42,
    "Id": 341
},
{
    "URL": "https://x.com/trackingisrael/status/1851320644354367645",
    "Date": "29/10/2024",
    "Text": "American Israeli Justin Salt served as a combat medic during the ongoing genocide.",
    "Weight": 13,
    "Id": 342
},
{
    "URL": "https://x.com/trackingisrael/status/1851315904593662170",
    "Date": "29/10/2024",
    "Text": "American Israeli Etan Dadoun from the Nahal Brigade expressed that he feels privileged to take part in the genocide in Gaza.",
    "Weight": 17,
    "Id": 343
},
{
    "URL": "https://x.com/trackingisrael/status/1851312834048577662",
    "Date": "29/10/2024",
    "Text": "Israeli soldiers from the 932nd \"Granite\" Battalion of the Nahal Brigade shared images on the battalion's social media account showing themselves taking pictures inside displaced Palestinian homes before setting them on fire during the ongoing genocide in Gaza.",
    "Weight": 21,
    "Id": 344
},
{
    "URL": "https://x.com/trackingisrael/status/1851308898562552188",
    "Date": "29/10/2024",
    "Text": "Israeli Hungarian soldier Kfir Volter, from the Nahal Brigade's 931st Battalion, documented his involvement in the invasion of Gaza City.\n\nHe shared multiple images showing the battalion occupying the homes of displaced Palestinians before setting them on fire.",
    "Weight": 20,
    "Id": 345
},
{
    "URL": "https://x.com/trackingisrael/status/1851006725517697316",
    "Date": "28/10/2024",
    "Text": "Israeli Ethiopian reservist Moshe Ananya from the Givati Brigade posed for photos amid the ruins of Gaza City, documenting his role in genocide there.\n\nAfter completing his first reserve service in Gaza, he took a vacation to Lindos, Greece.",
    "Weight": 21,
    "Id": 346
},
{
    "URL": "https://x.com/trackingisrael/status/1851004390318145825",
    "Date": "28/10/2024",
    "Text": "Israeli soldier Rotem Bein from the Engineering Corps participated in the genocide in Gaza by operating a D9 bulldozer, destroying and razing Palestinian neighborhoods and cemeteries.\n\nHe was targeted by the resistance and was critically wounded.",
    "Weight": 21,
    "Id": 347
},
{
    "URL": "https://x.com/trackingisrael/status/1851004394000814539",
    "Date": "28/10/2024",
    "Text": "American Zionist and former professional boxer Floyd Mayweather signed him a hat during his current visit to Israel.",
    "Weight": 9,
    "Id": 348
},
{
    "URL": "https://x.com/trackingisrael/status/1850998773964746876",
    "Date": "28/10/2024",
    "Text": "Israeli reservist Ofek Tavor from the 444th Mobility Unit took part in the genocide in Gaza.",
    "Weight": 17,
    "Id": 349
},
{
    "URL": "https://x.com/trackingisrael/status/1850995832616870152",
    "Date": "28/10/2024",
    "Text": "The Israeli Givati Brigade's 932nd Battalion 'Granit' held a ceremony celebrating the replacement of one of the battalion's company commanders inside the displaced Palestinians' homes that they ethnically cleansed in the Jabalia refugee camp in northern Gaza.",
    "Weight": 20,
    "Id": 350
},
{
    "URL": "https://x.com/trackingisrael/status/1850992272487125398",
    "Date": "28/10/2024",
    "Text": "American Israeli soldier Sela Noff from the 444th Mobility Unit took part in the genocide in Gaza.",
    "Weight": 17,
    "Id": 351
},
{
    "URL": "https://x.com/trackingisrael/status/1850988167781896524",
    "Date": "28/10/2024",
    "Text": "Israeli reservist Matan Shtrall from the 444th Mobility Unit (Balnam) documented his service in the genocide in Gaza.\n\nFollowing the completion of his service, he went on a family vacation to Romania and vowed to come back to \"finish Lebanon\".",
    "Weight": 17,
    "Id": 352
},
{
    "URL": "https://x.com/trackingisrael/status/1850983874597151065",
    "Date": "28/10/2024",
    "Text": "Israeli reservist Itay Meyer, of German origin, from the Givati Battalion, served in the Kerem Shalom base in southern Gaza, where aid and food were forbidden from entry to Palestinians amid the genocide.",
    "Weight": 25,
    "Id": 353
},
{
    "URL": "https://x.com/trackingisrael/status/1850980231143702908",
    "Date": "28/10/2024",
    "Text": "Israeli Russian reservist Eli Amayev documented his service in military logistics units in the genocide in Gaza. He is now back in Russia after finishing his service.",
    "Weight": 17,
    "Id": 354
},
{
    "URL": "https://x.com/trackingisrael/status/1850974531109933478",
    "Date": "28/10/2024",
    "Text": "Israeli soldier Uri Oren, from the Nahal Brigade's 931st Battalion, documented his service in Gaza.\n\nThis battalion invaded Tal Al-Hawa and the Jabalia refugee camp, where thousands of Palestinians were killed, and hundreds were besieged in schools and kidnapped to torture camps.",
    "Weight": 20,
    "Id": 355
},
{
    "URL": "https://x.com/trackingisrael/status/1850971942204895262",
    "Date": "28/10/2024",
    "Text": "Israeli real estate agent Yarden Iluz, from the Givati Brigade, Battalion 9208, documented his reserve service in the genocide in Gaza.\n\nHe finished his service and went on vacation to Dubai, United Arab Emirates.",
    "Weight": 17,
    "Id": 356
},
{
    "URL": "https://x.com/trackingisrael/status/1850677249915146605",
    "Date": "27/10/2024",
    "Text": "For uncensored tracking of Israeli soldiers involved in the genocide in Gaza, follow us now on Telegram:",
    "Weight": 17,
    "Id": 357
},
{
    "URL": "https://x.com/trackingisrael/status/1850282074927771941",
    "Date": "26/10/2024",
    "Text": "Israeli officer Capt. Bezalel Vieberman from Givati’s Special Operations Unit, involved in the ethnic cleansing of Palestinians in Jabalia refugee camp, uploaded a picture of the process, writing degrading comments:\n\n'We have become the pursuers… GAZA WILL BE LEFT A GRAVEYARD.'",
    "Weight": 20,
    "Id": 358
},
{
    "URL": "https://x.com/trackingisrael/status/1850274270301037023",
    "Date": "26/10/2024",
    "Text": "Israeli Commander of the 188th Armored Brigade Lieutenant Colonel Or Volozhinsky, of Russian origin, oversaw operations in which thousands of Palestinians were killed by his battalion's tanks in indiscriminate shelling of northern Gaza and Khan Yunis.",
    "Weight": 20,
    "Id": 359
},
{
    "URL": "https://x.com/trackingisrael/status/1850268645206708604",
    "Date": "26/10/2024",
    "Text": "Israeli reservist and international freediving athlete Nofech Soulam was identified as having served in the 188th Armored Brigade as a drone operator in the genocide in Gaza.",
    "Weight": 17,
    "Id": 360
},
{
    "URL": "https://x.com/trackingisrael/status/1850261573014593919",
    "Date": "26/10/2024",
    "Text": "Israeli reservist Yaniv Abu from the 401st Armored Battalion is currently serving in Rafah City, southern Gaza Strip.",
    "Weight": 14,
    "Id": 361
},
{
    "URL": "https://x.com/trackingisrael/status/1850258681499398354",
    "Date": "26/10/2024",
    "Text": "Israeli musician Yehonatan Bensimon from the 188th Armored Brigade posted images from inside a mosque they raided while in Khan Yunis.",
    "Weight": 8,
    "Id": 362
},
{
    "URL": "https://x.com/trackingisrael/status/1850256347352236107",
    "Date": "26/10/2024",
    "Text": "Colombian Israeli reservist Adi Degani served in the 188th Armored Brigade that decimated northern Gaza and Khan Yunis.\n\nDegani is currently serving in the same brigade during the invasion of southern Lebanon.",
    "Weight": 12,
    "Id": 363
},
{
    "URL": "https://x.com/trackingisrael/status/1850251314586071386",
    "Date": "26/10/2024",
    "Text": "Israeli soldiers from the 6628th Battalion of the Combat Engineering Corps took images inside displaced Lebanese civilians' homes in Jebeil town before detonating them.",
    "Weight": 8,
    "Id": 364
},
{
    "URL": "https://x.com/trackingisrael/status/1850247270924537976",
    "Date": "26/10/2024",
    "Text": "Israeli reservist and photographer Yuval Alon gave a tour inside the Faculty of Medicine at IUGaza, south of Gaza City, after occupying it and turning it into their military base.",
    "Weight": 16,
    "Id": 365
},
{
    "URL": "https://x.com/trackingisrael/status/1850247274028249090",
    "Date": "26/10/2024",
    "Text": "In his caption on the videos, he refers to it as: \"\"\"\"a hospital,\"\"\"\" downplaying its significance to justify its destruction and occupation.",
    "Weight": 5,
    "Id": 366
},
{
    "URL": "https://x.com/trackingisrael/status/1838585301876318475",
    "Date": "24/09/2024",
    "Text": "American Israeli D9 operator Ophir Nagar documented his participation in the genocide in Gaza by bulldozing entire neighborhoods while serving in the Israeli occupation forces, boasting about it on Instagram.\n\nOphir is currently back in New York, his hometown.",
    "Weight": 30,
    "Id": 367
},
{
    "URL": "https://x.com/trackingisrael/status/1850223970412536308",
    "Date": "26/10/2024",
    "Text": "Ophir is back in Gaza for a second reserve service. In the past two weeks, he posted these while razing and destroying Rafah.",
    "Weight": 6,
    "Id": 368
},
{
    "URL": "https://x.com/trackingisrael/status/1850210098477470077",
    "Date": "26/10/2024",
    "Text": "Israeli reservist Lidor Haliva documented his involvement in the genocide on Gaza. In one of the posts, he uploaded a photo of his battalion firing mortars next to a school they occupied and transformed into a military base.\n\nLidor is currently vacationing in the United States.",
    "Weight": 17,
    "Id": 369
},
{
    "URL": "https://x.com/trackingisrael/status/1850206666140107004",
    "Date": "26/10/2024",
    "Text": "American Israeli reservist Noam Michaeli was identified as having taken part in the Israeli genocide in Gaza.",
    "Weight": 25,
    "Id": 370
},
{
    "URL": "https://x.com/trackingisrael/status/1850203821634462143",
    "Date": "26/10/2024",
    "Text": "Israeli reservist Yair Asaban complained that Palestinians were not generous in invading their homes and detonating them while serving in the Engineering Corps in Khan Yunis.",
    "Weight": 16,
    "Id": 371
},
{
    "URL": "https://x.com/trackingisrael/status/1850191356351709333",
    "Date": "26/10/2024",
    "Text": "Israeli Argentinian reservist Yair Moguiliansky served in the Combat Engineering Corps in Gaza.\n\nHe posted photos from Khan Yunis while rigging displaced Palestinians' homes with explosives before detonating them.",
    "Weight": 20,
    "Id": 372
},
{
    "URL": "https://x.com/trackingisrael/status/1850186439754981876",
    "Date": "26/10/2024",
    "Text": "Israeli reservist Ofer Shalom documented his service in the Gaza genocide, where he was honored for saving a stray dog from Gaza while detonating Palestinian neighborhoods.",
    "Weight": 25,
    "Id": 373
},
{
    "URL": "https://x.com/trackingisrael/status/1850183469051138520",
    "Date": "26/10/2024",
    "Text": "An Israeli soldier from Sayeret 6228 Paratroopers posted their operations in Gaza and currently southern Lebanon.\n\nThey specialize in rigging and detonating residential neighborhoods.",
    "Weight": 12,
    "Id": 374
},
{
    "URL": "https://x.com/trackingisrael/status/1850178913852358806",
    "Date": "26/10/2024",
    "Text": "Israel’s Channel 12 'reporter' Danny Kushmaro was filmed detonating displaced Lebanese civilians' homes in southern Lebanon while embedded with Israeli invading forces.",
    "Weight": 12,
    "Id": 375
},
{
    "URL": "https://x.com/trackingisrael/status/1850176695271141659",
    "Date": "26/10/2024",
    "Text": "Recently circulating footage posted by Israeli soldiers shows the ethnic cleansing of Palestinians from the Jabalia refugee camp, where Israeli forces kidnapped hundreds of Palestinian youths and forced their families out of the camp.\n\nSource: \n@ytirawi",
    "Weight": 28,
    "Id": 376
},
{
    "URL": "https://x.com/trackingisrael/status/1849905432367636557",
    "Date": "25/10/2024",
    "Text": "Israeli Russian reservist Patrick Schmitt was identified as having served in an Engineering Battalion during the genocide in Gaza.",
    "Weight": 17,
    "Id": 377
},
{
    "URL": "https://x.com/trackingisrael/status/1849901329998655945",
    "Date": "25/10/2024",
    "Text": "Israeli soldiers were seen celebrating and dancing inside the home of a displaced Lebanese civilian in southern Lebanon.",
    "Weight": 8,
    "Id": 378
},
{
    "URL": "https://x.com/trackingisrael/status/1849900698965512211",
    "Date": "25/10/2024",
    "Text": "Israeli soldier Inon Mines from the 605th Battalion of the Combat Engineering Corps documented the rigging of Palestinian homes with explosives before detonating them during his service in Gaza.",
    "Weight": 16,
    "Id": 379
},
{
    "URL": "https://x.com/trackingisrael/status/1849898388428554667",
    "Date": "25/10/2024",
    "Text": "Israeli Russian reservist Vlad Krivchansky, a photographer, created video montages of detonating the homes and neighborhoods of displaced Palestinians while serving in the Engineering Unit in Gaza.",
    "Weight": 20,
    "Id": 380
},
{
    "URL": "https://x.com/trackingisrael/status/1849895213986172942",
    "Date": "25/10/2024",
    "Text": "Israeli reservist Dor Magen from the Engineering Company documented the detonation of residential neighborhoods in Gaza.",
    "Weight": 12,
    "Id": 381
},
{
    "URL": "https://x.com/trackingisrael/status/1849890597152399575",
    "Date": "25/10/2024",
    "Text": "Israeli occupation soldiers from the Armored 162nd Battalion have uploaded images of the ongoing ethnic cleansing of Palestinians in Jabalia Refugee Camp and Beit Lahia in northern Gaza today.",
    "Weight": 25,
    "Id": 382
},
{
    "URL": "https://x.com/trackingisrael/status/1849848329082905084",
    "Date": "25/10/2024",
    "Text": "Israeli European soldier Shaked Zamir from the 890th Paratrooper Battalion documented his service in the genocide in Gaza.",
    "Weight": 17,
    "Id": 383
},
{
    "URL": "https://x.com/trackingisrael/status/1849844586631278747",
    "Date": "25/10/2024",
    "Text": "American Israeli reservist Shalev Smetanka has been identified as having served as a commander in the Israeli genocide in Gaza; he is currently back in his hometown of New York.",
    "Weight": 25,
    "Id": 384
},
{
    "URL": "https://x.com/trackingisrael/status/1849841473887277136",
    "Date": "25/10/2024",
    "Text": "Israeli reservist Oz Liberman made jokes about the destruction caused to Palestinian homes in Gaza.",
    "Weight": 16,
    "Id": 385
},
{
    "URL": "https://x.com/trackingisrael/status/1849839344397238483",
    "Date": "25/10/2024",
    "Text": "Israeli reservist Orel Cohen from 'Tzema'a,' the Cat company of D9 bulldozers, documented his service in the systematic destruction of neighborhoods in Gaza on his Instagram.",
    "Weight": 12,
    "Id": 386
},
{
    "URL": "https://x.com/trackingisrael/status/1849837462148776429",
    "Date": "25/10/2024",
    "Text": "\"You entered Gaza to take revenge, as many as possible, women, children, everyone you saw, this is what you wanted\"\n\nThe brother of an Israeli soldier killed by the resistance stated that his brother sought to exact as much revenge as possible in Gaza by killing everyone there.",
    "Weight": 16,
    "Id": 387
},
{
    "URL": "https://x.com/trackingisrael/status/1849831121627849028",
    "Date": "25/10/2024",
    "Text": "Israeli Indian reservist Kamin Kakhel documented the storming of displaced Palestinian homes while serving in Gaza. \n\nChinese and Asian soldiers were spotted in his images from Gaza, indicating Israel's use of machinery in its genocide.",
    "Weight": 29,
    "Id": 388
},
{
    "URL": "https://x.com/trackingisrael/status/1849827695145734654",
    "Date": "25/10/2024",
    "Text": "During his service in the Golani Brigade in Gaza, Israeli amateur singer YTK Steppa posted a video clip of his song filmed inside a displaced Palestinian home that he set on fire after recording.",
    "Weight": 16,
    "Id": 389
},
{
    "URL": "https://x.com/trackingisrael/status/1849823201091522946",
    "Date": "25/10/2024",
    "Text": "Israeli reservist Shai Shoshana, of Tunisian origin, from the 'Cat' D9 company, documented footage of raiding and destroying Palestinian neighborhoods in Gaza.\n\nHe posted a video making jokes about the destruction of a Palestinian home, wondering why there is no electricity.",
    "Weight": 20,
    "Id": 390
},
{
    "URL": "https://x.com/trackingisrael/status/1849819946047418573",
    "Date": "25/10/2024",
    "Text": "Israeli Moroccan reservist Itamar Azulay from the Nahal Brigade posted about his journey during the Gaza invasion, revealing that his battalion took over a school as a military base while in Gaza.",
    "Weight": 16,
    "Id": 391
},
{
    "URL": "https://x.com/trackingisrael/status/1849815467394736362",
    "Date": "25/10/2024",
    "Text": "Israeli Nahal Division soldier Noam Ohana documented his service in the genocide in Gaza, boasting about \"making history.\"",
    "Weight": 17,
    "Id": 392
},
{
    "URL": "https://x.com/trackingisrael/status/1849541040677507193",
    "Date": "24/10/2024",
    "Text": "Israeli soldier Liam Alon from the Paratrooper Brigade, 35th Battalion, shared footage of detonating Palestinian neighborhoods during the invasion of Khan Yunis.\n\nLiam is currently vacationing in Crete, Greece, following the completion of his service.",
    "Weight": 12,
    "Id": 393
},
{
    "URL": "https://x.com/trackingisrael/status/1849541044330696762",
    "Date": "24/10/2024",
    "Text": "Some of the detonations in Gaza that Liam shared with his followers show him celebrating and cheering the destruction.",
    "Weight": 4,
    "Id": 394
},
{
    "URL": "https://x.com/trackingisrael/status/1849537300965077229",
    "Date": "24/10/2024",
    "Text": "American Israeli reservist Tal Hauslich has been identified as having served in the Israeli genocide in Gaza and is now back in the United States.",
    "Weight": 25,
    "Id": 395
},
{
    "URL": "https://x.com/trackingisrael/status/1849533471917551709",
    "Date": "24/10/2024",
    "Text": "Israeli musician Yanay Fadida, from the 'Falkhod' engineering company in the army, posted about the battalion while occupying displaced Palestinians' homes and using them as military bases before detonating them afterwards.",
    "Weight": 16,
    "Id": 396
},
{
    "URL": "https://x.com/trackingisrael/status/1849530111931937261",
    "Date": "24/10/2024",
    "Text": "Israeli reservist Lior Segal, of Russian origin, documented his service in the genocide in Gaza, stating he felt \"privileged\" to serve.",
    "Weight": 17,
    "Id": 397
},
{
    "URL": "https://x.com/trackingisrael/status/1849528134061707747",
    "Date": "24/10/2024",
    "Text": "Israeli soldier Bar Roitman decorated his D9 bulldozer with toys belonging to displaced or killed Palestinian children, which he looted from their homes during his service.\n\nHe also posted images of himself wearing jewelry and property he looted.",
    "Weight": 14,
    "Id": 398
},
{
    "URL": "https://x.com/trackingisrael/status/1849489821691195798",
    "Date": "24/10/2024",
    "Text": "Israeli athlete Achya Ben Harush posted his daily workouts from inside the homes of displaced Palestinians in Rafah.\n\nHe recently uploaded footage of himself wearing a dress belonging to killed or displaced Palestinian women while performing his workout.",
    "Weight": 22,
    "Id": 399
},
{
    "URL": "https://x.com/trackingisrael/status/1849485896816464229",
    "Date": "24/10/2024",
    "Text": "Videos and images shared by Israeli occupation soldiers from Jabalia and Beit Lahiya in northern Gaza document the ongoing ethnic cleansing of Palestinians.",
    "Weight": 25,
    "Id": 400
},
{
    "URL": "https://x.com/trackingisrael/status/1849485899769254062",
    "Date": "24/10/2024",
    "Text": "According to local sources, Israeli occupation forces have kidnapped hundreds of Palestinian men, with anyone aged 14 and older being taken and transported to torture camps in Israel.",
    "Weight": 21,
    "Id": 401
},
{
    "URL": "https://x.com/trackingisrael/status/1849446338238275929",
    "Date": "24/10/2024",
    "Text": "Israeli soldier Tomer Cohen, an American who moved to Israel as part of the \"Shinshinim programs\" through The Jewish Federation of Greater Hartford in 2017, has shared posts while in Gaza.",
    "Weight": 20,
    "Id": 402
},
{
    "URL": "https://x.com/trackingisrael/status/1848817591151734820",
    "Date": "22/10/2024",
    "Text": "Israeli soldier Shaul Greenglick posted images of himself looting the homes of displaced or killed Palestinians during the invasion of northern Gaza.\n\nShaul was killed by the resistance shortly after sharing these images.",
    "Weight": 20,
    "Id": 403
},
{
    "URL": "https://x.com/trackingisrael/status/1848814086789992889",
    "Date": "22/10/2024",
    "Text": "Russian Israeli Vlad Sandler from the Golani Brigade took part in the genocide in Gaza.",
    "Weight": 17,
    "Id": 404
},
{
    "URL": "https://x.com/trackingisrael/status/1848811847883149393",
    "Date": "22/10/2024",
    "Text": "Israeli soldier Hao Khohk, of Myanmar origin, has served alongside the Israeli occupation army in its genocide in Gaza.",
    "Weight": 30,
    "Id": 405
},
{
    "URL": "https://x.com/trackingisrael/status/1848805943951471053",
    "Date": "22/10/2024",
    "Text": "Sruli Wiener, an American Israeli from Allentown, Pennsylvania, has been identified as serving with the Israeli occupation forces during the genocide in Gaza.",
    "Weight": 30,
    "Id": 406
},
{
    "URL": "https://x.com/trackingisrael/status/1848776596066275577",
    "Date": "22/10/2024",
    "Text": "After forcefully kicking displaced Palestinians from them, Israeli Givati's 432nd Battalion stormed the Aleppo, Kuwait, and Hamad schools in Jabalia, northern Gaza, and set the schools on fire to prevent them from being used as shelters, forcing families to head south.\n\n\n@ytirawi",
    "Weight": 20,
    "Id": 407
},
{
    "URL": "https://x.com/trackingisrael/status/1848764770746274391",
    "Date": "22/10/2024",
    "Text": "Israeli sniper Ido Avital from Shaham Battalion 931st Sniper Division documented his service in Gaza, sniping Palestinians from residential buildings they had occupied in northern Gaza.",
    "Weight": 24,
    "Id": 408
},
{
    "URL": "https://x.com/trackingisrael/status/1848761227217899790",
    "Date": "22/10/2024",
    "Text": "Israeli soldier Itamar Goldfeld from the sniper unit in the Israeli Nahal Brigade posted these images while in Gaza, captioning the album as \"Gaza is a whore.\"",
    "Weight": 24,
    "Id": 409
},
{
    "URL": "https://x.com/trackingisrael/status/1848758656055054434",
    "Date": "22/10/2024",
    "Text": "Israeli soldier Or Tziter, of British origin from Nahal Brigade 931st Battalion, documented his service in Gaza.\n\nOne of those images depicts the besiegement of Tal Al-Hawa area, where hundreds of Palestinians were kidnapped, and families were forced to evacuate at gunpoint.",
    "Weight": 20,
    "Id": 410
},
{
    "URL": "https://x.com/trackingisrael/status/1848754451982471350",
    "Date": "22/10/2024",
    "Text": "American Israeli soldier Noam Cohen from the 931st Battalion documented his service in Gaza during the invasion of northern and central Gaza City.",
    "Weight": 16,
    "Id": 411
},
{
    "URL": "https://x.com/trackingisrael/status/1848750514848072153",
    "Date": "22/10/2024",
    "Text": "Israeli soldier Shay Spivak, of Russian origin, served in the Israeli genocide in Gaza during the first weeks of the invasion of northern Gaza, defecating inside displaced Palestinians' homes.",
    "Weight": 37,
    "Id": 412
},
{
    "URL": "https://x.com/trackingisrael/status/1848743973130494258",
    "Date": "22/10/2024",
    "Text": "Israeli sniper Gilad Gross, of European origin, posted images of himself occupying displaced Palestinians' apartments in northern Gaza, where he was sniping Palestinians during his service.",
    "Weight": 28,
    "Id": 413
},
{
    "URL": "https://x.com/trackingisrael/status/1848739048786981265",
    "Date": "22/10/2024",
    "Text": "Israeli reservist Samuel Biba, of South African origin, from Nahal Brigade 931st Battalion, posted about his service during the invasion of Jabalia refugee camp a few months ago, where hundreds of Palestinians were killed, and thousands of homes were detonated.",
    "Weight": 16,
    "Id": 414
},
{
    "URL": "https://x.com/trackingisrael/status/1848733475240587334",
    "Date": "22/10/2024",
    "Text": "Israeli American reservist Rom Ben Zeev from Nahal Brigade 50th Battalion posted about his experience in Gaza, showing him with other soldiers dancing inside the home of displaced Palestinians.",
    "Weight": 20,
    "Id": 415
},
{
    "URL": "https://x.com/trackingisrael/status/1848727661931094441",
    "Date": "22/10/2024",
    "Text": "Israeli soldier Koren Yekutiely from Nahal Brigade 931st Battalion posted about his service in the genocide in Gaza, sharing images in front of a displaced Palestinian home they set on fire in Rafah.",
    "Weight": 23,
    "Id": 416
},
{
    "URL": "https://x.com/trackingisrael/status/1848723585524785498",
    "Date": "22/10/2024",
    "Text": "Israeli commander David Bokobza from Nahal Brigade 931st Battalion posted images throughout his service in Gaza.\n\nAmong those posts, he uploaded images while forcibly evacuating displaced Palestinians sheltering in a school in Tel Al-Hawa in central Gaza.",
    "Weight": 24,
    "Id": 417
},
{
    "URL": "https://x.com/trackingisrael/status/1848717775767839099",
    "Date": "22/10/2024",
    "Text": "An American Israeli reservist known as \"life_of_kazu\" on TikTok posted footage from his service as a combat medic in Gaza, showing him randomly shooting at neighborhoods and playing around with other soldiers inside a hospital after forcibly evicting Palestinians from it.",
    "Weight": 20,
    "Id": 418
},
{
    "URL": "https://x.com/trackingisrael/status/1848452388559962350",
    "Date": "21/10/2024",
    "Text": "Israeli content creator known on TikTok as or_helf uploaded humorous videos he made while serving as a combat medic during his service in Khan Yunis.\n\nThe van he made a joke about is specialized for the cancer hospital that Israeli tanks destroyed and was vandalized by soldiers.",
    "Weight": 16,
    "Id": 419
},
{
    "URL": "https://x.com/trackingisrael/status/1848452391252705314",
    "Date": "21/10/2024",
    "Text": "In another video, he posted about stealing horses belonging to displaced or killed Palestinians and transporting them back to Israel.",
    "Weight": 12,
    "Id": 420
},
{
    "URL": "https://x.com/trackingisrael/status/1848446198488948900",
    "Date": "21/10/2024",
    "Text": "Israeli soldiers celebrated the Jewish holiday Sukkot from inside a displaced Palestinian home in Rafah, which appeared to be vandalized with Hebrew spray painting.",
    "Weight": 18,
    "Id": 421
},
{
    "URL": "https://x.com/trackingisrael/status/1848444302109614193",
    "Date": "21/10/2024",
    "Text": "Israeli reservist Vova Osminin, a self-proclaimed \"artist.\"",
    "Weight": 8,
    "Id": 422
},
{
    "URL": "https://x.com/trackingisrael/status/1848442353541083278",
    "Date": "21/10/2024",
    "Text": "Israeli reservists Max Scheinfeld, an American, and Noam Witzman, a German, have been identified as currently serving in the 401st Brigade in Rafah, south of Gaza.",
    "Weight": 14,
    "Id": 423
},
{
    "URL": "https://x.com/trackingisrael/status/1848440202315854238",
    "Date": "21/10/2024",
    "Text": "Israeli soldier Yair Halfala from the Golani 631st Battalion posted about his service in the genocide in Gaza, including footage of him emptying his machine gun on displaced Palestinians' homes for fun.",
    "Weight": 25,
    "Id": 424
},
{
    "URL": "https://x.com/trackingisrael/status/1848436942834438585",
    "Date": "21/10/2024",
    "Text": "Israeli Druze soldier Salman Naseer Elden from the Givati Brigade posted about his involvement in the genocide in Gaza.",
    "Weight": 17,
    "Id": 425
},
{
    "URL": "https://x.com/trackingisrael/status/1848430674820403678",
    "Date": "21/10/2024",
    "Text": "Israeli reservist Dudi Rali, of Indian origins, proudly posted footage from his service in Gaza.",
    "Weight": 12,
    "Id": 426
},
{
    "URL": "https://x.com/trackingisrael/status/1848430678565916697",
    "Date": "21/10/2024",
    "Text": "Dudi posted these videos of soldiers shooting randomly at already destroyed neighborhoods in Gaza, celebrating the blasts.",
    "Weight": 4,
    "Id": 427
},
{
    "URL": "https://x.com/trackingisrael/status/1848424707340603407",
    "Date": "21/10/2024",
    "Text": "American Israeli combat medic Jonathan Ohayon posted pictures throughout his service in the genocide in Gaza.",
    "Weight": 17,
    "Id": 428
},
{
    "URL": "https://x.com/trackingisrael/status/1848422459269075156",
    "Date": "21/10/2024",
    "Text": "Israeli military photographer Almog Kolt has been embedded with forces in Gaza, shooting videos and creating montages for their online propaganda.",
    "Weight": 12,
    "Id": 429
},
{
    "URL": "https://x.com/trackingisrael/status/1848422463257927935",
    "Date": "21/10/2024",
    "Text": "He has filmed and edited staged clashes in Gaza, where Israeli battalions produced promotional videos using live ammunition, destroying displaced Palestinian neighborhoods and homes.",
    "Weight": 16,
    "Id": 430
},
{
    "URL": "https://x.com/trackingisrael/status/1848419262882631937",
    "Date": "21/10/2024",
    "Text": "Israeli reservists from Battalion 8112 filmed themselves detonating displaced Lebanese homes in southern Lebanon towns after raiding and looting them.\n\nThe soldiers in these videos are Israeli multinationals, Spanish and French.",
    "Weight": 16,
    "Id": 431
},
{
    "URL": "https://x.com/trackingisrael/status/1848373538467586462",
    "Date": "21/10/2024",
    "Text": "This image, published by Israeli Channel 14, shows Israeli occupation forces kidnapping Palestinian youth and men from Jabalia refugee camp.\n\nThe men appear to be forced to undress and wear plastic suits as they are transported to a torture camp in Israel.",
    "Weight": 29,
    "Id": 432
},
{
    "URL": "https://x.com/trackingisrael/status/1848357324005515304",
    "Date": "21/10/2024",
    "Text": "American Israeli reservist Daniel Zaga boasted about his involvement in the genocide in Gaza.\n\nHe completed his service and is now back in his hometown in New York.",
    "Weight": 17,
    "Id": 433
},
{
    "URL": "https://x.com/trackingisrael/status/1848052081774449020",
    "Date": "20/10/2024",
    "Text": "Very recent images posted by Israeli soldiers show mass torching of displaced Palestinian homes and schools used as shelters in Jabalia refugee camp in northern Gaza.\n\nBattalion 162 and the 401st brigade are assigned to the ethnic cleansing of Palestinians in northern Gaza.",
    "Weight": 28,
    "Id": 434
},
{
    "URL": "https://x.com/trackingisrael/status/1847623285141291496",
    "Date": "19/10/2024",
    "Text": "Israeli Ethiopian reservist Takala Sowgin documented his involvement in the Israeli genocide in Gaza.",
    "Weight": 25,
    "Id": 435
},
{
    "URL": "https://x.com/trackingisrael/status/1847621006292025593",
    "Date": "19/10/2024",
    "Text": "Israeli soldier Lior Shmuel Malka from the Givati Brigade posted images of his battalion in Gaza.\n\nIn response to a comment, one of his fellow soldiers admitted to killing Palestinian children, adding, \"It's fun.\"",
    "Weight": 16,
    "Id": 436
},
{
    "URL": "https://x.com/trackingisrael/status/1847591708877295638",
    "Date": "19/10/2024",
    "Text": "Israeli soldier Lior Tuvia, from the 749th Combat Engineering Battalion, posted pictures online from inside a school that the Israeli army is occupying after forcibly removing displaced Palestinian families and turning it into a military base in central Gaza.",
    "Weight": 24,
    "Id": 437
},
{
    "URL": "https://x.com/trackingisrael/status/1835753161601999073",
    "Date": "16/09/2024",
    "Text": "\"Our new carpet\" \n\nAmerican Israeli model Maya Radoszkowicz has been posting Islamophobic and disturbing footage on Instagram of her role in the Israeli occupation army during the Gaza genocide, including an image of a flag with the Islamic Shahada, captioned as their carpet.",
    "Weight": 30,
    "Id": 438
},
{
    "URL": "https://x.com/trackingisrael/status/1835753165112619196",
    "Date": "16/09/2024",
    "Text": "Maya has also shared footage of the detonation of Al-Azhar University in Gaza from December, captioning it: \"Bye to higher education in Gaza\".",
    "Weight": 8,
    "Id": 439
},
{
    "URL": "https://x.com/trackingisrael/status/1847586950502302061",
    "Date": "19/10/2024",
    "Text": "Recently, Maya posted about her re-enlistment into Gaza from a school Israeli forces are occupying as a military base after displacing Palestinian families.\n\nThey held a BBQ as they starve and slaughter thousands of Palestinians in the north.",
    "Weight": 24,
    "Id": 440
},
{
    "URL": "https://x.com/trackingisrael/status/1847581542802952692",
    "Date": "19/10/2024",
    "Text": "Israeli American reservist Lidor Shookroon from the Givati Brigade, Battalion 435, documented his participation in the genocide in Gaza.",
    "Weight": 17,
    "Id": 441
},
{
    "URL": "https://x.com/trackingisrael/status/1847565476181709175",
    "Date": "19/10/2024",
    "Text": "An Israeli platoon's social media account shared footage of their soldiers celebrating inside the home of displaced Palestinians in Khan Yunis.",
    "Weight": 16,
    "Id": 442
},
{
    "URL": "https://x.com/trackingisrael/status/1847557132448575857",
    "Date": "19/10/2024",
    "Text": "Israeli Master Sergeant Eliya Dayan of the 120th Operational Infantry Battalion brought his camera into service to document the destruction they inflicted on Gaza.",
    "Weight": 12,
    "Id": 443
},
{
    "URL": "https://x.com/trackingisrael/status/1847552886374293774",
    "Date": "19/10/2024",
    "Text": "Israeli soldier Elazar Menashe documented his service in Gaza and the West Bank, filming himself shooting a machine gun at Palestinian homes for amusement and boasting about Palestinians he had kidnapped from the West Bank on his Instagram stories.",
    "Weight": 24,
    "Id": 444
},
{
    "URL": "https://x.com/trackingisrael/status/1847552889717219657",
    "Date": "19/10/2024",
    "Text": "Palestinians they",
    "Weight": 8,
    "Id": 445
},
{
    "URL": "https://x.com/trackingisrael/status/1847539888540762164",
    "Date": "19/10/2024",
    "Text": "American Israeli Gersh Gluckin shared his reserve service while in Gaza.\n\nHe and his girlfriend, both from the United States, are currently living in an illegal settlement in Jerusalem.",
    "Weight": 12,
    "Id": 446
},
{
    "URL": "https://x.com/trackingisrael/status/1847530232590331933",
    "Date": "19/10/2024",
    "Text": "Israeli Givati reservist Matan Vaknin, who hails from Colombia, shared his experiences during the Israeli genocide in Gaza.",
    "Weight": 25,
    "Id": 447
},
{
    "URL": "https://x.com/trackingisrael/status/1846280693753540860",
    "Date": "15/10/2024",
    "Text": "Israeli American reservist Ivri Kedem documented his service in Gaza, raiding Palestinian homes and schools.",
    "Weight": 16,
    "Id": 448
},
{
    "URL": "https://x.com/trackingisrael/status/1846279241987772541",
    "Date": "15/10/2024",
    "Text": "Israeli Givati reservist Rimon Tsiony documented his service and participation in the genocide in Gaza.",
    "Weight": 17,
    "Id": 449
},
{
    "URL": "https://x.com/trackingisrael/status/1846278028768469404",
    "Date": "15/10/2024",
    "Text": "Israeli soldier Yonatan Siani from the 195th Armored Brigade posted videos of invading residential neighborhoods in Gaza with tanks, indiscriminately shelling and destroying displaced Palestinians homes.",
    "Weight": 20,
    "Id": 450
},
{
    "URL": "https://x.com/trackingisrael/status/1846276397238452555",
    "Date": "15/10/2024",
    "Text": "Israeli battalions posed for group photos inside mosques, homes, and governmental institution buildings they set on fire in Gaza.",
    "Weight": 12,
    "Id": 451
},
{
    "URL": "https://x.com/trackingisrael/status/1846275294769889364",
    "Date": "15/10/2024",
    "Text": "Soldiers from the Israeli army's Taagad medical units uploaded a video documenting their missions in Gaza, where they are seen shelling residential areas with tanks, detonating neighborhoods, and setting fire to the homes of displaced Palestinians in Rafah.",
    "Weight": 22,
    "Id": 452
},
{
    "URL": "https://x.com/trackingisrael/status/1837187688274722956",
    "Date": "20/09/2024",
    "Text": "1- A thread dedicated to Hezi Gilboa, an Israeli D9 operator and an organizer of \"informational missions\" to Israel that spread propaganda and falsified testimonies to foreigners to incite and dehumanize Palestinians.",
    "Weight": 20,
    "Id": 453
},
{
    "URL": "https://x.com/trackingisrael/status/1837187703990808635",
    "Date": "20/09/2024",
    "Text": "6-He also uploaded a picture of the razing of a cemetery in Gaza, claiming to have found tunnels beneath it.",
    "Weight": 4,
    "Id": 454
},
{
    "URL": "https://x.com/trackingisrael/status/1846272202775449998",
    "Date": "15/10/2024",
    "Text": "The Israeli Tzama Unit, a demolition unit within the Israeli army, has begun sharing footage of their operations in southern Lebanese towns, where they are demolishing and razing everything in their path.",
    "Weight": 16,
    "Id": 455
},
{
    "URL": "https://x.com/trackingisrael/status/1846268858421989691",
    "Date": "15/10/2024",
    "Text": "Israeli of Russian origin, Mordi Isakov, a well-known international instructor for American and Israeli arms, posed while taking part in the genocide in Gaza.",
    "Weight": 25,
    "Id": 456
},
{
    "URL": "https://x.com/trackingisrael/status/1846267728061222964",
    "Date": "15/10/2024",
    "Text": "Israeli reservist Ariel Ifrach, of American origin, served in the Givati Battalion and concluded his service in Rafah, where he posed for Instagram pictures from displaced Palestinians' homes.",
    "Weight": 18,
    "Id": 457
},
{
    "URL": "https://x.com/trackingisrael/status/1846228006995431681",
    "Date": "15/10/2024",
    "Text": "Israeli soldiers from the Engineering Unit and Battalion 7086 are detonating displaced Palestinian neighborhoods in Rafah and the Al-Nussierat refugee camp in central Gaza for their own joy and a taste of revenge.",
    "Weight": 18,
    "Id": 458
},
{
    "URL": "https://x.com/trackingisrael/status/1846227123263967637",
    "Date": "15/10/2024",
    "Text": "A soldier from the 162nd Battalion posted footage today of operations in the Jabalia refugee camp in northern Gaza, as thousands of Palestinian civilians are being starved and slaughtered.",
    "Weight": 8,
    "Id": 459
},
{
    "URL": "https://x.com/trackingisrael/status/1846222289844478149",
    "Date": "15/10/2024",
    "Text": "The Israeli Alexandroni Brigade detonated displaced Lebanese homes in the town of Jbeil in southern Lebanon after raiding and looting them.",
    "Weight": 8,
    "Id": 460
},
{
    "URL": "https://x.com/trackingisrael/status/1846181321363574934",
    "Date": "15/10/2024",
    "Text": "Israeli Golani Battalion soldiers shared footage of detonating a displaced Lebanese civilian's home, dedicating it to their soldiers killed in Gaza.",
    "Weight": 12,
    "Id": 461
},
{
    "URL": "https://x.com/trackingisrael/status/1845921664866886107",
    "Date": "14/10/2024",
    "Text": "Israeli reservist Idan Trachtengerts documented his service operating mortars targeting Gaza.",
    "Weight": 12,
    "Id": 462
},
{
    "URL": "https://x.com/trackingisrael/status/1845913947532415240",
    "Date": "14/10/2024",
    "Text": "Israeli Ukrainian reservist documented raiding and taking over displaced Palestinians' homes in Gaza for military posts on his Instagram.",
    "Weight": 20,
    "Id": 463
},
{
    "URL": "https://x.com/trackingisrael/status/1845909207972774061",
    "Date": "14/10/2024",
    "Text": "The official page of the Israeli 439th Artillery Brigade posted footage of the indiscriminate shelling of a residential neighborhood in Gaza, dedicated to their fallen soldiers and detainees.",
    "Weight": 12,
    "Id": 464
},
{
    "URL": "https://x.com/trackingisrael/status/1845905040847835583",
    "Date": "14/10/2024",
    "Text": "Israeli reservist Matan Zur from the Artillery Corps shared a video showing himself humorously operating an artillery cannon while shelling Gaza.",
    "Weight": 12,
    "Id": 465
},
{
    "URL": "https://x.com/trackingisrael/status/1845902654246994123",
    "Date": "14/10/2024",
    "Text": "Israeli reservist Kfir Blau posted images of his battalion occupying the Turkish Palestinian Friendship Hospital in central Gaza and turning it into an army command center.",
    "Weight": 16,
    "Id": 466
},
{
    "URL": "https://x.com/trackingisrael/status/1845874282385068372",
    "Date": "14/10/2024",
    "Text": "Israeli soldiers filmed a naked, blindfolded, and hand-tied Palestinian they kidnapped from Gaza, making degrading jokes about him.",
    "Weight": 16,
    "Id": 467
},
{
    "URL": "https://x.com/trackingisrael/status/1845867077875245354",
    "Date": "14/10/2024",
    "Text": "Israeli Arab reservist Mohammad K. Awade documented his service in the genocide in Gaza.",
    "Weight": 17,
    "Id": 468
},
{
    "URL": "https://x.com/trackingisrael/status/1845860565974978857",
    "Date": "14/10/2024",
    "Text": "Circulating videos show Israeli soldiers invading Jabalia today, depicting them raiding and looting the homes of displaced Palestinians, demolishing a mosque, and taking the crescent minarets as souvenirs.\n\nDerogatory and genocidal captions were written on these posts.",
    "Weight": 16,
    "Id": 469
},
{
    "URL": "https://x.com/trackingisrael/status/1845859289094611375",
    "Date": "14/10/2024",
    "Text": "Israeli Nigerian reservist Dani Adonya Adega from the Givati Snipers Unit.",
    "Weight": 8,
    "Id": 470
},
{
    "URL": "https://x.com/trackingisrael/status/1845856224325095657",
    "Date": "14/10/2024",
    "Text": "Reservist Itay Navi documented his service in the genocide in Gaza.",
    "Weight": 9,
    "Id": 471
},
{
    "URL": "https://x.com/trackingisrael/status/1845840771158548758",
    "Date": "14/10/2024",
    "Text": "Israeli reservist Itay Abuzaglo, of Moroccan origin, documented his service in Gaza, where he served in the Engineering Unit, rigging and detonating large neighborhoods in central and northern Gaza.",
    "Weight": 16,
    "Id": 472
},
{
    "URL": "https://x.com/trackingisrael/status/1845836985195221022",
    "Date": "14/10/2024",
    "Text": "Israeli Russian reservist Dani Breznik, from the Engineering Unit of the Israeli army, filmed the process of rigging and detonating Palestinian homes in Gaza.\n\nToday, he completes a full year in Gaza, as he just posted on his Instagram.",
    "Weight": 28,
    "Id": 473
},
{
    "URL": "https://x.com/trackingisrael/status/1845829836159250729",
    "Date": "14/10/2024",
    "Text": "Israeli soldier Liran Kazakov, of Russian origin, posted images from atop a UNRWA school in Gaza, where his squad used it as a sniping post.",
    "Weight": 14,
    "Id": 474
},
{
    "URL": "https://x.com/trackingisrael/status/1845827863041261865",
    "Date": "14/10/2024",
    "Text": "Russian Israeli reservist Sergei Chelnokov from the Givati Battalion boasted in images he shared, showcasing his role as a sniper during his service in Gaza.",
    "Weight": 12,
    "Id": 475
},
{
    "URL": "https://x.com/trackingisrael/status/1845822174789030026",
    "Date": "14/10/2024",
    "Text": "Israeli occupation soldiers filmed themselves destroying and looting the homes of displaced Palestinians in Gaza, making mocking videos of their belongings.",
    "Weight": 25,
    "Id": 476
},
{
    "URL": "https://x.com/trackingisrael/status/1845819922510721111",
    "Date": "14/10/2024",
    "Text": "An American organization called Operation Israel posted a message of gratitude from Israeli soldiers, thanking Americans for providing drones and military equipment to annihilate Gaza.\n\nThe organization is now appealing for further donations to support the occupation of Lebanon.",
    "Weight": 21,
    "Id": 477
},
{
    "URL": "https://x.com/trackingisrael/status/1845170861197722078",
    "Date": "12/10/2024",
    "Text": "Israeli content creator Yishai Gvirtzman, who served in the engineering unit, documented his unit detonating the homes of displaced Palestinians, claiming they were used as bases and mosques during the first weeks of the invasion of Gaza.",
    "Weight": 20,
    "Id": 478
},
{
    "URL": "https://x.com/trackingisrael/status/1845155248802783302",
    "Date": "12/10/2024",
    "Text": "Israeli soldier from the Artillery Corps, known as Royaltshuller on Instagram, showcases his anime art on artillery shells before firing them toward Gaza.",
    "Weight": 12,
    "Id": 479
},
{
    "URL": "https://x.com/trackingisrael/status/1845153789793431636",
    "Date": "12/10/2024",
    "Text": "Israeli artist Ido Malka posted footage of his service during the Gaza genocide, promoting music in a video he filmed while in Khan Yunis.",
    "Weight": 17,
    "Id": 480
},
{
    "URL": "https://x.com/trackingisrael/status/1845138678617715148",
    "Date": "12/10/2024",
    "Text": "Renowned Israeli singer Refael Allush shared footage from his service during the Gaza genocide, expressing joy at finally being able to pray inside the homes of displaced and killed Palestinians.",
    "Weight": 25,
    "Id": 481
},
{
    "URL": "https://x.com/trackingisrael/status/1845129275759858042",
    "Date": "12/10/2024",
    "Text": "While serving at the command station, Israeli soldier Tair Mizrahi posted videos that mocked and trivialized the killing of Palestinian civilians in Gaza, referring to their massacres as a \"play.\"",
    "Weight": 16,
    "Id": 482
},
{
    "URL": "https://x.com/trackingisrael/status/1845125141191110965",
    "Date": "12/10/2024",
    "Text": "Israeli calisthenics instructor Itai continued posting his workouts on social media from the homes of displaced Palestinians that he occupied in Gaza.",
    "Weight": 20,
    "Id": 483
},
{
    "URL": "https://x.com/trackingisrael/status/1845120670838984831",
    "Date": "12/10/2024",
    "Text": "Israeli reservist Kfir Kadosh from the Kfir Battalion documented his service in northern Gaza and Khan Yunis, where he shared his undisciplined service and unethical, Islamophobic slurs on social media.",
    "Weight": 12,
    "Id": 484
},
{
    "URL": "https://x.com/trackingisrael/status/1845120677172461603",
    "Date": "12/10/2024",
    "Text": "Making a TikTok with other soldiers defecating on sugar bags intended for Palestinians, claiming they were cocaine.",
    "Weight": 8,
    "Id": 485
},
{
    "URL": "https://x.com/trackingisrael/status/1845120680229999103",
    "Date": "12/10/2024",
    "Text": "He uploaded this footage of the forced displacements of Palestinians from northern Gaza, mocking their misery.",
    "Weight": 12,
    "Id": 486
},
{
    "URL": "https://x.com/trackingisrael/status/1845113843317399924",
    "Date": "12/10/2024",
    "Text": "Israeli reservist Or Goldstein was active on TikTok while in service during the Gaza genocide. He made several mocking videos, gloating about the destruction they inflicted on displaced Palestinians' neighborhoods.",
    "Weight": 25,
    "Id": 487
},
{
    "URL": "https://x.com/trackingisrael/status/1845113846857437307",
    "Date": "12/10/2024",
    "Text": "He filmed a humorous TikTok video portraying sugar, which comes as aid to Palestinians, as cocaine, filming from a principal's office in a school in Gaza.",
    "Weight": 12,
    "Id": 488
},
{
    "URL": "https://x.com/trackingisrael/status/1845113849592115541",
    "Date": "12/10/2024",
    "Text": "Mockery videos of destroyed Palestinian homes in Gaza.",
    "Weight": 8,
    "Id": 489
},
{
    "URL": "https://x.com/trackingisrael/status/1845106349832634408",
    "Date": "12/10/2024",
    "Text": "Israeli reservist Yuval Waknine from the 188th Brigade, Unit 71 Battalion, incited the battalion soldiers to take revenge for their fallen soldier while invading Gaza.",
    "Weight": 12,
    "Id": 490
},
{
    "URL": "https://x.com/trackingisrael/status/1845098827029610798",
    "Date": "12/10/2024",
    "Text": "Israeli Italian reserve soldier Peleg Bar documented his service in Khan Yunis, where he enjoyed looting the homes of displaced Palestinians and detonating them afterward.",
    "Weight": 16,
    "Id": 491
},
{
    "URL": "https://x.com/trackingisrael/status/1845091476717314250",
    "Date": "12/10/2024",
    "Text": "Israeli occupation soldiers record themselves looting and detonating displaced Lebanese civilians' homes in southern Lebanon.",
    "Weight": 13,
    "Id": 492
},
{
    "URL": "https://x.com/trackingisrael/status/1844472351674728771",
    "Date": "10/10/2024",
    "Text": "Israeli American Avihay Shuker from the Engineering Battalion posted about demolishing areas in Gaza.\n\nHe boasted about raiding displaced Palestinians' homes, taking pictures with their belongings, and detonating a block for his 25th birthday.",
    "Weight": 20,
    "Id": 493
},
{
    "URL": "https://x.com/trackingisrael/status/1844467729002364930",
    "Date": "10/10/2024",
    "Text": "Israeli coach Tal Bobi Griner continued posting exercise routines for his followers during his reserve service in Gaza, sharing workout content from inside displaced Palestinian homes.",
    "Weight": 16,
    "Id": 494
},
{
    "URL": "https://x.com/trackingisrael/status/1844466049972068528",
    "Date": "10/10/2024",
    "Text": "Israeli soldier Leshem Dilmon from the 401st Brigade, Khan Yunis.",
    "Weight": 8,
    "Id": 495
},
{
    "URL": "https://x.com/trackingisrael/status/1844464142901809322",
    "Date": "10/10/2024",
    "Text": "Israeli reservist Ofek Yakolev, of Russian origin, uploaded mocking videos of himself inside a school in Gaza, where they forcibly displaced hundreds of Palestinian families, making silly TikTok videos from its classrooms.",
    "Weight": 16,
    "Id": 496
},
{
    "URL": "https://x.com/trackingisrael/status/1844462695652982961",
    "Date": "10/10/2024",
    "Text": "Israeli photographer Zohar Efargan brought his camera during his reserve service in Gaza, documenting Battalion 202 snipers operating and shooting Palestinians from inside a displaced family's apartment.",
    "Weight": 20,
    "Id": 497
},
{
    "URL": "https://x.com/trackingisrael/status/1844462699876581861",
    "Date": "10/10/2024",
    "Text": "The soldiers of this battalion were recently exposed for deliberately killing dozens of civilians in northern Gaza.",
    "Weight": 4,
    "Id": 498
},
{
    "URL": "https://x.com/trackingisrael/status/1844442153524789725",
    "Date": "10/10/2024",
    "Text": "A collection of war crimes committed by Israeli occupation forces in Gaza, documented by various soldiers, was posted on Israeli channels and groups for settlers to \"enjoy\" watching.",
    "Weight": 37,
    "Id": 499
},
{
    "URL": "https://x.com/trackingisrael/status/1844375214223917261",
    "Date": "10/10/2024",
    "Text": "\"A good Arab is a dead Arab.\"\n\nIsraeli soldiers from 6130-battalion filmed themselves dancing inside a school they occupied after forcibly displacing the families who had been sheltering there. The walls were defaced with genocidal and racist slurs.",
    "Weight": 8,
    "Id": 500
},
{
    "URL": "https://x.com/trackingisrael/status/1844372957998792915",
    "Date": "10/10/2024",
    "Text": "Soldiers from Israel's 605th Engineering Battalion uploaded footage showing them razing and destroying fields in southern Lebanon.",
    "Weight": 4,
    "Id": 501
},
{
    "URL": "https://x.com/trackingisrael/status/1844369926657802515",
    "Date": "10/10/2024",
    "Text": "Zevi Rosenzweig, an Israeli American entrepreneur known for organizing tours for foreigners into Al-Aqsa Mosque in occupied Jerusalem, has shared images of Israeli soldiers in Gaza.\n\nThese images reveal patches worn by the soldiers that appear to be inciting a religious war.",
    "Weight": 20,
    "Id": 502
},
{
    "URL": "https://x.com/trackingisrael/status/1843744128921940098",
    "Date": "08/10/2024",
    "Text": "Israeli American Dayan Haim Chamla posted footage of his reserve service in the occupied West Bank, including a raid on Palestinian homes in the middle of the night, where he held a civilian family at gunpoint.",
    "Weight": 12,
    "Id": 503
},
{
    "URL": "https://x.com/trackingisrael/status/1843740557010739676",
    "Date": "08/10/2024",
    "Text": "Israeli of Russian origins, Emil Smirnov, served as a tank operator in Magen Company during the invasion of central Gaza and the coastal areas of the Strip.",
    "Weight": 12,
    "Id": 504
},
{
    "URL": "https://x.com/trackingisrael/status/1843738717275730056",
    "Date": "08/10/2024",
    "Text": "Israeli reservist Ofri Dayan from Battalion 5035 documented his service in the occupied West Bank.",
    "Weight": 8,
    "Id": 505
},
{
    "URL": "https://x.com/trackingisrael/status/1843736515773640747",
    "Date": "08/10/2024",
    "Text": "Israeli American Aviv Meshulami, who served in Battalion 9 as a tank operator in Rafah, shared footage of himself indiscriminately targeting neighborhoods.",
    "Weight": 10,
    "Id": 506
},
{
    "URL": "https://x.com/trackingisrael/status/1843734396404412814",
    "Date": "08/10/2024",
    "Text": "Israeli reservist Shneor Hamal from the Lahav Battalion posted images and footage of the battalion's actions during the invasion of Gaza.",
    "Weight": 12,
    "Id": 507
},
{
    "URL": "https://x.com/trackingisrael/status/1843734400221229462",
    "Date": "08/10/2024",
    "Text": "Here, the soldiers celebrat and dance inside a displaced Palestinian home, chanting racist slurs.",
    "Weight": 4,
    "Id": 508
},
{
    "URL": "https://x.com/trackingisrael/status/1843730580124696978",
    "Date": "08/10/2024",
    "Text": "An Israeli battalion's social media page just uploaded memorial photos of their involvement in the genocide in Gaza, taken from a displaced Palestinian home, which they later detonated, as one of them admitted in the comments.",
    "Weight": 21,
    "Id": 509
},
{
    "URL": "https://x.com/trackingisrael/status/1843728831527694532",
    "Date": "08/10/2024",
    "Text": "Israeli Amit Tapiro1 on Instagram shared footage of his participation in the genocide in Gaza, showing himself detonating displaced Palestinians' neighborhoods and uploading it to his social media page.",
    "Weight": 25,
    "Id": 510
},
{
    "URL": "https://x.com/trackingisrael/status/1843703345024049313",
    "Date": "08/10/2024",
    "Text": "Recently circulating footage shows Israeli soldiers posting on social media during their invasion of southern Lebanon, setting displaced civilians' homes on fire, detonating them, and looting their money.",
    "Weight": 8,
    "Id": 511
},
{
    "URL": "https://x.com/trackingisrael/status/1843684004563951831",
    "Date": "08/10/2024",
    "Text": "This gruesome video was taken from an Israeli settlers' group, showcasing the detonation of infrastructure and neighborhoods in Gaza, along with the killing of Palestinian civilians by drones, merging these war crimes with rock music.",
    "Weight": 28,
    "Id": 512
},
{
    "URL": "https://x.com/trackingisrael/status/1843681756077273604",
    "Date": "08/10/2024",
    "Text": "Israeli soldiers from Battalion 9 filmed themselves playing with a toy belonging to displaced or killed Palestinian children while occupying a home in Gaza.",
    "Weight": 16,
    "Id": 513
},
{
    "URL": "https://x.com/trackingisrael/status/1843681015505793053",
    "Date": "08/10/2024",
    "Text": "Israeli Yahalom engineering battalion soldiers documented the detonation of neighborhoods in Gaza during the invasion, referring to it as the \"only solution to Gaza.\"\nThe soldiers uploaded these videos on social media for the amusement of settlers, showcasing a taste for revenge.",
    "Weight": 16,
    "Id": 514
},
{
    "URL": "https://x.com/trackingisrael/status/1843652340265648580",
    "Date": "08/10/2024",
    "Text": "A promotional video published by the Israeli Givati Brigade while invading Gaza showcases arbitrary destruction and open shooting orders, along with the systematic detonation of displaced Palestinian neighborhoods and mosques.",
    "Weight": 16,
    "Id": 515
},
{
    "URL": "https://x.com/trackingisrael/status/1843652343524667828",
    "Date": "08/10/2024",
    "Text": "A part of the video shows the mass abduction of Palestinian men in the background, forcing them to get naked before being sent to Israeli detention camps or used as human shields during the invasion.",
    "Weight": 12,
    "Id": 516
},
{
    "URL": "https://x.com/trackingisrael/status/1843648410555166762",
    "Date": "08/10/2024",
    "Text": "Israeli Battalion 8170 soldiers posted footage of themselves looting a stall belonging to displaced or killed Palestinians during the invasion of Khan Yunis.",
    "Weight": 16,
    "Id": 517
},
{
    "URL": "https://x.com/trackingisrael/status/1843381336637354449",
    "Date": "07/10/2024",
    "Text": "Israeli Engineering Battalion documented the detonation of the Blue Beach Resort in northern Gaza.",
    "Weight": 12,
    "Id": 518
},
{
    "URL": "https://x.com/trackingisrael/status/1843362490681590138",
    "Date": "07/10/2024",
    "Text": "Chilling footage uploaded by an Israeli soldier on his social media, boasting about the killing of unarmed Palestinians in Bani Suhaila, Gaza.\n\nThe footage was extended as the soldier tracked them through their homes, eventually deploying drones to \"neutralize\" them.",
    "Weight": 20,
    "Id": 519
},
{
    "URL": "https://x.com/trackingisrael/status/1843357344778092782",
    "Date": "07/10/2024",
    "Text": "Israeli soldiers from the 8170th Engineer Battalion of the Givati Brigade filmed themselves detonating the already destroyed Yasser Arafat Airport in Rafah, in the southern Gaza Strip.",
    "Weight": 14,
    "Id": 520
},
{
    "URL": "https://x.com/trackingisrael/status/1843356037619036618",
    "Date": "07/10/2024",
    "Text": "Israeli Engineering Battalion 7170 rigged a Palestinian town in Khan Yunis with explosives and detonated it on video in honor and revenge for their officer killed on October 7.",
    "Weight": 12,
    "Id": 521
},
{
    "URL": "https://x.com/trackingisrael/status/1843347948215906727",
    "Date": "07/10/2024",
    "Text": "A collection of footage documented by Israeli soldiers showing the detonation of neighborhoods in Gaza.",
    "Weight": 12,
    "Id": 522
},
{
    "URL": "https://x.com/trackingisrael/status/1843344770325983436",
    "Date": "07/10/2024",
    "Text": "An Israeli soldier recorded himself spitting and cursing at naked, blindfolded, and hand-tied detained Palestinians being loaded into a bus.\n\nThe Israeli soldier posted this footage in Israeli settlers' online groups, where he was praised for humiliating and dehumanizing them.",
    "Weight": 32,
    "Id": 523
},
{
    "URL": "https://x.com/trackingisrael/status/1843335753289609656",
    "Date": "07/10/2024",
    "Text": "An Israeli soldier from the Kfir Brigade detonated displaced Palestinians' homes in Al-Zeitoun neighborhood in Gaza as an act of revenge in honor of Israeli settlers who died in settlements north of occupied Palestine.",
    "Weight": 32,
    "Id": 524
},
{
    "URL": "https://x.com/trackingisrael/status/1843331782156136898",
    "Date": "07/10/2024",
    "Text": "Israeli FPV drone operator Ben Susana proudly shared footage of his drones during the invasion of Gaza.\n\nSusana trained Israeli Kfir Brigade soldiers in operating drones to use against Palestinians in Gaza, capturing the detonation of residential neighborhoods from the sky.",
    "Weight": 32,
    "Id": 525
},
{
    "URL": "https://x.com/trackingisrael/status/1842543825140559927",
    "Date": "05/10/2024",
    "Text": "An Israeli army fan page on Instagram posted a series of videos depicting Israeli war crimes in Gaza, accompanied by ominous music.\n\nThe footage shows the killing of civilians and the destruction of residential neighborhoods.",
    "Weight": 32,
    "Id": 526
},
{
    "URL": "https://x.com/trackingisrael/status/1842533540858085437",
    "Date": "05/10/2024",
    "Text": "An Israeli drone operator shared footage on social media documenting the killing of Palestinians.\n\nThe videos show locating civilians, relaying their coordinates to the army on the ground for targeting, and operating drones that drop explosives on civilians in Rafah.",
    "Weight": 18,
    "Id": 527
},
{
    "URL": "https://x.com/trackingisrael/status/1842533543525695648",
    "Date": "05/10/2024",
    "Text": "The targeting of five Palestinians distributing aid on a donkey cart in Deir al-Balah.",
    "Weight": 8,
    "Id": 528
},
{
    "URL": "https://x.com/trackingisrael/status/1842507751710158977",
    "Date": "05/10/2024",
    "Text": "\"We still have a lot of work to do here\"\n\nAn Israeli soldier jokingly records himself demolishing Palestinian neighborhoods in Gaza, expressing that he is overwhelmed by the number of homes left to be destroyed.",
    "Weight": 16,
    "Id": 529
},
{
    "URL": "https://x.com/trackingisrael/status/1842505179528065393",
    "Date": "05/10/2024",
    "Text": "Israeli soldiers in Gaza recorded themselves destroying and razing the properties of displaced Palestinians, likening it to playing a video game.",
    "Weight": 20,
    "Id": 530
},
{
    "URL": "https://x.com/trackingisrael/status/1842496527203274816",
    "Date": "05/10/2024",
    "Text": "An Israeli soldier from Asaf Battalion 601 uploaded footage celebrating the killing of Palestinian civilians from the roof of their home in Gaza back in March.",
    "Weight": 16,
    "Id": 531
},
{
    "URL": "https://x.com/trackingisrael/status/1842494235825631580",
    "Date": "05/10/2024",
    "Text": "An Israeli soldier of French origin posted this footage of dozens of Palestinians they kidnapped from Gaza in late December. \n\nThey were treated as mere numbers marked on their bodies and taken to detention camps in Israel, where dozens were killed due to torture and starvation.",
    "Weight": 24,
    "Id": 532
},
{
    "URL": "https://x.com/trackingisrael/status/1842484932746088901",
    "Date": "05/10/2024",
    "Text": "Israeli wedding photographer Yoni Pasha took his own camera with him during his reserve service amid the genocide in Gaza, capturing footage of the deliberate killings of Palestinian civilians and the destruction of residential blocks.",
    "Weight": 21,
    "Id": 533
},
{
    "URL": "https://x.com/trackingisrael/status/1842473955057115642",
    "Date": "05/10/2024",
    "Text": "A liquor business in Israel is marketing its stores off the wall of a destroyed school in Gaza, with the caption: \"Hope that soon we will be able to celebrate in 'Gaza'.\"\n\nTheir Instagram: something_sweet_alcohol",
    "Weight": 12,
    "Id": 534
},
{
    "URL": "https://x.com/trackingisrael/status/1842465185727975694",
    "Date": "05/10/2024",
    "Text": "Israeli Battalion 46 uploaded additional memorial photos of their invasion of Gaza.\n\nSoldiers are seen taking photos as they set Palestinian homes they had occupied on fire, ensuring that residents can't return after their withdrawal.",
    "Weight": 16,
    "Id": 535
},
{
    "URL": "https://x.com/trackingisrael/status/1842462965167014272",
    "Date": "05/10/2024",
    "Text": "Israeli occupation soldiers sent a video expressing appreciation to Nestlé-owned Israeli company Osem for the aid they provided.\n\nIn the video, Israeli soldiers are seen occupying a hospital after forcibly kicking out wounded Palestinians from it amid the genocide.",
    "Weight": 42,
    "Id": 536
},
{
    "URL": "https://x.com/trackingisrael/status/1842461217136210298",
    "Date": "05/10/2024",
    "Text": "Israeli American Yair Tetenboim served as a paramedic in the Israeli occupation army during the genocide in Gaza.",
    "Weight": 30,
    "Id": 537
},
{
    "URL": "https://x.com/trackingisrael/status/1842269525179273418",
    "Date": "04/10/2024",
    "Text": "Israeli Battalion 46 expressed their gratitude to Americans for sending aid and food as they invaded Khan Yunis in Gaza.\n\nThey shared their appreciation from a school they occupied after forcibly displacing Palestinians who had sought refuge there.",
    "Weight": 20,
    "Id": 538
},
{
    "URL": "https://x.com/trackingisrael/status/1842264909947588657",
    "Date": "04/10/2024",
    "Text": "Israeli Battalion 46 has turned Boulevard Wedding Studio in central Gaza into a military base for their soldiers.",
    "Weight": 12,
    "Id": 539
},
{
    "URL": "https://x.com/trackingisrael/status/1842237120309576097",
    "Date": "04/10/2024",
    "Text": "An Israeli colonel posted images of the abduction of hundreds of Palestinian civilians from Gaza, putting up stickers in destroyed neighborhoods asking Palestinians to help locate Hamas leaders in exchange for money and the promise of being \"moved into a safe place.\"",
    "Weight": 28,
    "Id": 540
},
{
    "URL": "https://x.com/trackingisrael/status/1842233660571017700",
    "Date": "04/10/2024",
    "Text": "The Israeli 'Lotar Unit' shared footage of their raid on the Jenin refugee camp in the occupied West Bank, detaining dozens of Palestinian youths.\n\nThey also posted a photo on Instagram showing the rigging of displaced Palestinians' homes with explosives.",
    "Weight": 20,
    "Id": 541
},
{
    "URL": "https://x.com/trackingisrael/status/1842221902644785395",
    "Date": "04/10/2024",
    "Text": "Israeli \"photographer\" Yedi Cohen documented his participation in the genocide in Gaza, capturing footage of tanks relentlessly shelling and destroying displaced Palestinians' homes and mosques.",
    "Weight": 25,
    "Id": 542
},
{
    "URL": "https://x.com/trackingisrael/status/1842213457195585802",
    "Date": "04/10/2024",
    "Text": "After serving as a combat medic during the Israeli genocide in Gaza, American Israeli Jonathan Cohen returned to Florida, where FAU praised him for his involvement.\n\nHe also appeared on television and led campaigns funding the Israeli army from Americans.",
    "Weight": 33,
    "Id": 543
},
{
    "URL": "https://x.com/trackingisrael/status/1842207495504195787",
    "Date": "04/10/2024",
    "Text": "American Israelis Shlomi Fuchs and Yakov Liberman have been actively working since October 7 to coordinate American donations of money and food for Israeli soldiers involved in the genocide in Gaza.",
    "Weight": 28,
    "Id": 544
},
{
    "URL": "https://x.com/trackingisrael/status/1842193937647501663",
    "Date": "04/10/2024",
    "Text": "Israeli soldiers celebrate the detonation of the first home during their invasion of southern Lebanon towns.\n\nAccording to their posts on social media, Israeli soldiers vowe to destroy Lebanese towns, promising to level them to rubble as they did in Gaza.",
    "Weight": 20,
    "Id": 545
},
{
    "URL": "https://x.com/trackingisrael/status/1841930407950090252",
    "Date": "03/10/2024",
    "Text": "American Israeli Shay Zadh documents the war crimes he committed while serving in the Israeli army in Gaza on his social media platforms.",
    "Weight": 32,
    "Id": 546
},
{
    "URL": "https://x.com/trackingisrael/status/1841930411238392271",
    "Date": "03/10/2024",
    "Text": "He turned these videos into humorous music while bragging about the actions he committed against Palestinians.\n\nShay is now back in his hometown of California, where he owns a construction company.",
    "Weight": 8,
    "Id": 547
},
{
    "URL": "https://x.com/trackingisrael/status/1841925183310860550",
    "Date": "03/10/2024",
    "Text": "Israeli soldier Liam Levi posted photos on Instagram showing himself in Gaza, playing with displaced Palestinian women's lingerie and looting their homes during his service in the genocide in Gaza.",
    "Weight": 25,
    "Id": 548
},
{
    "URL": "https://x.com/trackingisrael/status/1841915942093066616",
    "Date": "03/10/2024",
    "Text": "The Israeli Givati Brigade's Rotem Battalion posted images on their Instagram page, showcasing the use of schools in Gaza as military bases, with soldiers posing for selfies while torching hospitals, businesses, and the homes of displaced Palestinians.",
    "Weight": 20,
    "Id": 549
},
{
    "URL": "https://x.com/trackingisrael/status/1841910054376898876",
    "Date": "03/10/2024",
    "Text": "Israeli soldier Elidor Hadad posted photos of his service in Gaza during the genocide, taking mocking images from inside the homes and shops of displaced or killed Palestinians.",
    "Weight": 25,
    "Id": 550
},
{
    "URL": "https://x.com/trackingisrael/status/1841907469808709819",
    "Date": "03/10/2024",
    "Text": "The Israeli Yahalom Unit rigged dozens of Palestinian homes and buildings in Gaza with explosives and detonated them on video as an act of revenge for Col. Asaf Hamami, who was killed on October 7.",
    "Weight": 16,
    "Id": 551
},
{
    "URL": "https://x.com/trackingisrael/status/1841905015310410153",
    "Date": "03/10/2024",
    "Text": "The Israeli Battalion Hativa 401 posted images celebrating the occupation of the border between Rafah and Sinai from inside one of the remaining buildings of Al-Qarya al-Suwaydiya, following its decimation.",
    "Weight": 15,
    "Id": 552
},
{
    "URL": "https://x.com/trackingisrael/status/1841899236146770237",
    "Date": "03/10/2024",
    "Text": "An Israeli soldier posted a video while serving as a tank operator in Gaza, celebrating the indiscriminate shelling of Palestinian homes and buildings.",
    "Weight": 16,
    "Id": 553
},
{
    "URL": "https://x.com/trackingisrael/status/1841895500708000088",
    "Date": "03/10/2024",
    "Text": "An Israeli training base in the Negev was established to resemble a mosque, adorned with Palestinian and Lebanese flags, for Israeli soldiers to conduct their training exercises.",
    "Weight": 20,
    "Id": 554
},
{
    "URL": "https://x.com/trackingisrael/status/1841894417642189268",
    "Date": "03/10/2024",
    "Text": "The Israeli Jolan Battalion \"Spear\" released a promotional video showcasing their tanks invading neighborhoods in Khan Yunis and detonating the homes of displaced Palestinians.",
    "Weight": 16,
    "Id": 555
},
{
    "URL": "https://x.com/trackingisrael/status/1841846094541488531",
    "Date": "03/10/2024",
    "Text": "Israeli soldiers recite biblical verses amidst the ruins in Gaza, using genocidal rhetoric and inciting the annihilation of the remaining Palestinian population.",
    "Weight": 16,
    "Id": 556
},
{
    "URL": "https://x.com/trackingisrael/status/1841839848417571017",
    "Date": "03/10/2024",
    "Text": "Israeli soldier Aviv Harary uploaded images of himself during the genocide in Gaza, dedicating them to his mother from the home of a displaced Palestinian family.",
    "Weight": 21,
    "Id": 557
},
{
    "URL": "https://x.com/trackingisrael/status/1841136740670538160",
    "Date": "01/10/2024",
    "Text": "Israeli Kfir Battalion, the first tank battalion to storm into northern Gaza and invade residential neighborhoods.\n\nThis video was uploaded to one of the soldier's social media accounts, boasting about being part of the invasion that slaughtered thousands of Palestinians.",
    "Weight": 20,
    "Id": 558
},
{
    "URL": "https://x.com/trackingisrael/status/1841135568706560374",
    "Date": "01/10/2024",
    "Text": "An Israeli soldier from Battalion 52 posted a video showing the invasion of Khan Yunis and central Gaza neighborhoods.\n\nThe footage includes tanks shelling and shooting indiscriminately into evacuated and displaced Palestinians' homes.",
    "Weight": 20,
    "Id": 559
},
{
    "URL": "https://x.com/trackingisrael/status/1841128432740032581",
    "Date": "01/10/2024",
    "Text": "Watch | An Israeli soldier uploaded a video showcasing his participation in Israeli Battalion 401.\n\nThe video contains footage of the killing of an elderly Palestinian man who was peacefully observing his home in northern Gaza last February.",
    "Weight": 24,
    "Id": 560
},
{
    "URL": "https://x.com/trackingisrael/status/1841124702581903852",
    "Date": "01/10/2024",
    "Text": "Distressing | A promotional video for Israeli Battalion 202 during their invasion of Gaza reveals the deliberate killing of unarmed Palestinian civilians.\n\nThe video was filmed and edited by Israeli filmmaker Shalom Gilbert, who posted it on Instagram and YouTube.",
    "Weight": 24,
    "Id": 561
},
{
    "URL": "https://x.com/trackingisrael/status/1841124705534615618",
    "Date": "01/10/2024",
    "Text": "The video also featured the battalion detonating and setting fire to displaced Palestinians' homes, alongside indiscriminate shelling of the area by invading tanks.",
    "Weight": 8,
    "Id": 562
},
{
    "URL": "https://x.com/trackingisrael/status/1840830426857824353",
    "Date": "30/09/2024",
    "Text": "Last May, Israeli soldiers filmed themselves cooking food and celebrating inside a displaced Palestinian family home in Gaza.\n\nAt that time, famine was starving thousands of civilians as Israel was blocking aid.",
    "Weight": 20,
    "Id": 563
},
{
    "URL": "https://x.com/trackingisrael/status/1840822934929318122",
    "Date": "30/09/2024",
    "Text": "Israeli far-right journalist Amit Segal brought alcohol live on TV to celebrate the assassination of Lebanese resistance leader Hassan Nasrallah in Beirut.",
    "Weight": 8,
    "Id": 564
},
{
    "URL": "https://x.com/trackingisrael/status/1840822339715366997",
    "Date": "30/09/2024",
    "Text": "\"We will light the grim and dark city of Gaza with the light of purity.\"\n\nIsraeli occupation battalion 401 shot this video of erecting the Jewish Hanukkah on top of the ruins of Palestine Square in Gaza last December.",
    "Weight": 29,
    "Id": 565
},
{
    "URL": "https://x.com/trackingisrael/status/1840815469323829659",
    "Date": "30/09/2024",
    "Text": "Israeli street athlete Achya Ben Harush has been posting videos of his workouts inside the homes of displaced Palestinians in Gaza, where he deliberately destroys these homes while boasting about it.",
    "Weight": 20,
    "Id": 566
},
{
    "URL": "https://x.com/trackingisrael/status/1840812773728546854",
    "Date": "30/09/2024",
    "Text": "Israeli occupation soldiers erected a Jewish Hanukkah structure in Gaza, celebrating their religious holiday while singing, not far from where two million Palestinians are being starved and slaughtered.",
    "Weight": 29,
    "Id": 567
},
{
    "URL": "https://x.com/trackingisrael/status/1840812105634586790",
    "Date": "30/09/2024",
    "Text": "Israeli occupation soldiers posted a \"funny\" post on social media from inside a school in Gaza, where they had forcibly displaced Palestinians who were seeking shelter due to the relentless bombardment.",
    "Weight": 25,
    "Id": 568
},
{
    "URL": "https://x.com/trackingisrael/status/1840811339909869973",
    "Date": "30/09/2024",
    "Text": "Israeli occupation soldiers boasted about Israel's \"democracy\" as they cast their votes from inside displaced Palestinians' homes in Gaza while perpetrating a genocide.",
    "Weight": 34,
    "Id": 569
},
{
    "URL": "https://x.com/trackingisrael/status/1840778226378969372",
    "Date": "30/09/2024",
    "Text": "Israeli photographer Eden Yedid documented the displacement of Palestinian civilians in Gaza while embedded with the army. \n\nIsraeli soldiers forced these civilians to abandon their belongings as they fled, gloating over their misery and displacement with drawings on the walls.",
    "Weight": 24,
    "Id": 570
},
{
    "URL": "https://x.com/trackingisrael/status/1840766946314215559",
    "Date": "30/09/2024",
    "Text": "American Israeli photographer Alex Neugroschl documented his participation in the Israeli genocide in Gaza and uploaded those photos to his official photography Instagram page.",
    "Weight": 25,
    "Id": 571
},
{
    "URL": "https://x.com/trackingisrael/status/1840422828580933747",
    "Date": "29/09/2024",
    "Text": "Israeli Army photographer Binyamin Wisemon has posted images he captured while embedded with forces during raids on Palestinian homes in the occupied West Bank and the invasion of Al-Shifa Hospital in Gaza.",
    "Weight": 16,
    "Id": 572
},
{
    "URL": "https://x.com/trackingisrael/status/1840422835300323759",
    "Date": "29/09/2024",
    "Text": "Israeli occupation forces raided the hospital after several weeks, destroying its remaining capabilities and forcing it out of service until today.\n\nFollowing their withdrawal, hundreds of Palestinians, including women, nurses, and the elderly, were discovered in mass graves.",
    "Weight": 21,
    "Id": 573
},
{
    "URL": "https://x.com/trackingisrael/status/1840422838592827520",
    "Date": "29/09/2024",
    "Text": "The photographer also captured the forced displacement of thousands of Palestinian civilians from northern Gaza at gunpoint.\n\nAnother image depicts an Israeli soldier storming a mosque.",
    "Weight": 16,
    "Id": 574
},
{
    "URL": "https://x.com/trackingisrael/status/1840384197044686931",
    "Date": "29/09/2024",
    "Text": "\"Friends, we're destroying all their shops\" \n \nAn Israeli soldier films himself demolishing and destroying displaced Palestinians' neighborhoods and shops in Al-Zeitoun area, south of Gaza Strip.",
    "Weight": 20,
    "Id": 575
},
{
    "URL": "https://x.com/trackingisrael/status/1840265950412583025",
    "Date": "29/09/2024",
    "Text": "Despite the genocide and siege, we are here to make our voices from #Gaza heard by the world.\n\nPlease support us by following and sharing our account. ",
    "Weight": 9,
    "Id": 576
},
{
    "URL": "https://x.com/trackingisrael/status/1839755257879924784",
    "Date": "27/09/2024",
    "Text": "An Israeli soldier from the engineering brigade posted on his Instagram the systematic detonation of residential neighborhoods of displaced Palestinians in Rafah, sharing it with his friends as a form of satisfaction for vengeance.",
    "Weight": 18,
    "Id": 577
},
{
    "URL": "https://x.com/trackingisrael/status/1839742239725006946",
    "Date": "27/09/2024",
    "Text": "Israeli entrepreneur Yohanan Galandoer posted a video on his Instagram showing himself operating a tank as it invaded residential neighborhoods in Gaza, shooting and recording the systematic destruction of everything in the army's path.",
    "Weight": 12,
    "Id": 578
},
{
    "URL": "https://x.com/trackingisrael/status/1839739855305367670",
    "Date": "27/09/2024",
    "Text": "Israeli soldiers posted videos of themselves jokingly playing with the graduation certificate and gown of a Palestinian whose fate remains unknown after raiding homes in northern Gaza.",
    "Weight": 16,
    "Id": 579
},
{
    "URL": "https://x.com/trackingisrael/status/1839738759073439922",
    "Date": "27/09/2024",
    "Text": "These images were taken from Khalil Al-Nubani School in the Al-Zeitoun neighborhood, central Gaza, after it was turned into a military base by Israeli forces, who forcibly displaced Palestinians seeking shelter there.",
    "Weight": 20,
    "Id": 580
},
{
    "URL": "https://x.com/trackingisrael/status/1839731458660864124",
    "Date": "27/09/2024",
    "Text": "Israeli documentary photographer Itay Cohen has been sharing images he captured while embedded with Israeli occupation forces during the genocide in Gaza.\n\nSome of the photos depict the destruction of a mosque, while others show Palestinian civilians being forced to leave.",
    "Weight": 34,
    "Id": 581
},
{
    "URL": "https://x.com/trackingisrael/status/1839731462054261184",
    "Date": "27/09/2024",
    "Text": "The Philadelphi Corridor, as depicted in these pictures, shows Israeli forces demolishing thousands of homes near the border and paving a road, signaling no intention of withdrawal.",
    "Weight": 8,
    "Id": 582
},
{
    "URL": "https://x.com/trackingisrael/status/1839390507526742518",
    "Date": "26/09/2024",
    "Text": "An Israeli soldier shared disturbing footage capturing the killing of Palestinian civilians who were distributing aid to displaced families in Gaza via drones, followed by joy and celebrations.",
    "Weight": 16,
    "Id": 583
},
{
    "URL": "https://x.com/trackingisrael/status/1839389343238230255",
    "Date": "26/09/2024",
    "Text": "An Israeli occupation soldier placed a Jewish mezuzah on the door of a home belonging to a displaced or killed Palestinian family in Gaza, celebrating and dancing afterward as a symbolic act of Judaizing the area.",
    "Weight": 25,
    "Id": 584
},
{
    "URL": "https://x.com/trackingisrael/status/1839388077560926294",
    "Date": "26/09/2024",
    "Text": "Watch | During their invasion of Gaza, Israeli soldiers celebrated and danced among the rubble to mark the birth of one soldier's child.",
    "Weight": 12,
    "Id": 585
},
{
    "URL": "https://x.com/trackingisrael/status/1839386637891219903",
    "Date": "26/09/2024",
    "Text": "Israeli reservist Eliav Dei expressed pride in being part of the Israeli genocide in Gaza. He posted pictures of Palestinian schools and homes that were occupied and used as military bases during the invasion.",
    "Weight": 29,
    "Id": 586
},
{
    "URL": "https://x.com/trackingisrael/status/1839384215701672417",
    "Date": "26/09/2024",
    "Text": "In December 2023, Israeli occupation forces converted a school in northern Gaza into a synagogue for the Hanukkah holiday, forcibly expelling displaced Palestinian families who had sought refuge there due to the relentless bombardment.",
    "Weight": 21,
    "Id": 587
},
{
    "URL": "https://x.com/trackingisrael/status/1839380848233386372",
    "Date": "26/09/2024",
    "Text": "In Gaza, the Israeli occupation army turned a school into a military base in Gaza, the Israeli occupation army is using a school as a military base after forcibly expelling displaced Palestinians who were seeking shelter there.",
    "Weight": 42,
    "Id": 588
},
{
    "URL": "https://x.com/trackingisrael/status/1839379042853924926",
    "Date": "26/09/2024",
    "Text": "American Israeli sheriff Adar Yahalom documented his service in the Israeli occupation forces during the genocide in Gaza, boasting about the thrill of the destruction inflicted on the Strip.",
    "Weight": 30,
    "Id": 589
},
{
    "URL": "https://x.com/trackingisrael/status/1839372474552820080",
    "Date": "26/09/2024",
    "Text": "\"We will burn everything; everything will burn here in Khan Yunis.\"\n\nIsraeli reservist Eden Shor shared footage on Instagram of a Palestinian home he set on fire during the invasion of Khan Yunis in Gaza, vowing to burn everything.",
    "Weight": 16,
    "Id": 590
},
{
    "URL": "https://x.com/trackingisrael/status/1839330533937213773",
    "Date": "26/09/2024",
    "Text": "Israeli \"nature photographer\" Ariel Fields brought his camera during his service in Gaza.\n\nHe uploaded pictures of their war crimes, including setting fire to displaced Palestinian homes and celebrating a Jewish holiday inside these homes before igniting the flames.",
    "Weight": 32,
    "Id": 591
},
{
    "URL": "https://x.com/trackingisrael/status/1839327212744700413",
    "Date": "26/09/2024",
    "Text": "Israeli soldier Yali Nimni has been sharing his experiences in the Israeli occupation army in the occupied West Bank and Gaza, posting images in front of an evacuated school and showcasing pictures while vandalizing the homes of displaced Palestinians.",
    "Weight": 33,
    "Id": 592
},
{
    "URL": "https://x.com/trackingisrael/status/1838661261963211206",
    "Date": "24/09/2024",
    "Text": "Israeli soldier of Ethiopian origin Yakov Dslin posted footage from his service in Gaza, where he and other soldiers had fun destroying and setting fire to the homes of displaced or killed Palestinians.",
    "Weight": 20,
    "Id": 593
},
{
    "URL": "https://x.com/trackingisrael/status/1838653224758501564",
    "Date": "24/09/2024",
    "Text": "Israeli journalist Amiel Yarchi, a Knesset correspondent for the Kipa news website, regularly visits Israeli soldiers in Gaza, posting on his Instagram about his experiences in razing Palestinian homes, often accompanying the videos with humorous music.",
    "Weight": 24,
    "Id": 594
},
{
    "URL": "https://x.com/trackingisrael/status/1838645473445376053",
    "Date": "24/09/2024",
    "Text": "Israeli photographer Ido Hager created a sketch of his experience during the genocide in Gaza, depicting his operation of a tank as he indiscriminately shelled and destroyed neighborhoods.",
    "Weight": 17,
    "Id": 595
},
{
    "URL": "https://x.com/trackingisrael/status/1838640220146638905",
    "Date": "24/09/2024",
    "Text": "Israeli soldier Or Shitrit, of Moroccan origin, posted on Instagram pictures from Gaza, where he is seen playing with the belongings of displaced or killed Palestinians, captioning them: \"We will dance on this land.\"",
    "Weight": 20,
    "Id": 596
},
{
    "URL": "https://x.com/trackingisrael/status/1838634798975455723",
    "Date": "24/09/2024",
    "Text": "Israeli soldier Elinor Ben Tora has been documenting her daily service in Gaza on Instagram, preparing mines for the systematic detonation of neighborhoods and settling in a hospital converted into a military base at the Netzarim checkpoint.",
    "Weight": 12,
    "Id": 597
},
{
    "URL": "https://x.com/trackingisrael/status/1838634812560580941",
    "Date": "24/09/2024",
    "Text": "In these stories posted on her account, she shows how Israeli occupation forces are using the Turkish-Palestinian Friendship Hospital as a military base in central Gaza, at the \"Netzarim corridor.\"",
    "Weight": 21,
    "Id": 598
},
{
    "URL": "https://x.com/trackingisrael/status/1838606847294509064",
    "Date": "24/09/2024",
    "Text": "A thread dedicated to the Instagram posts of the Israeli Nahal Brigade, Battalion 50.\n\nThe brigade posted a promotional video from the devastated city of Rafah, showcasing a maneuver with live rounds and explosives in abandoned Palestinian homes.",
    "Weight": 14,
    "Id": 599
},
{
    "URL": "https://x.com/trackingisrael/status/1838606853128724780",
    "Date": "24/09/2024",
    "Text": "The brigade's Instagram page has also posted documentation of a feast for the soldiers inside a wedding hall in Gaza during the Jewish Passover in April.",
    "Weight": 8,
    "Id": 600
},
{
    "URL": "https://x.com/trackingisrael/status/1838606856677110172",
    "Date": "24/09/2024",
    "Text": "The Nahal Brigade held a flag ceremony in Rafah city with the presence of prominent Israeli DJ Bearded Gilad, whom we will cover in a later thread regarding his parties for Israeli occupation soldiers inside Gaza.",
    "Weight": 27,
    "Id": 601
},
{
    "URL": "https://x.com/trackingisrael/status/1838595341530141063",
    "Date": "24/09/2024",
    "Text": "Israeli soldier Refael Yacov used his fitness Instagram page to boast about his involvement in the genocide in Gaza.",
    "Weight": 17,
    "Id": 602
},
{
    "URL": "https://x.com/trackingisrael/status/1838595345149792403",
    "Date": "24/09/2024",
    "Text": "He and other soldiers boast about \"destroying and conquering northern Gaza\" by raiding already destroyed homes, claiming to have seized weapons and ammunition.\n\nHowever, the only visible firearm is an Israeli Negev machine gun, placed by one of the soldiers.",
    "Weight": 12,
    "Id": 603
},
{
    "URL": "https://x.com/trackingisrael/status/1838579202225832438",
    "Date": "24/09/2024",
    "Text": "An Israeli soldier of French origin boasted in Instagram pictures about being in Gaza and the destruction he contributed to, writing in his caption: \"Gaza, even though you're broken to death, we're not done yet .\"",
    "Weight": 16,
    "Id": 604
},
{
    "URL": "https://x.com/trackingisrael/status/1838336076013785186",
    "Date": "23/09/2024",
    "Text": "Israeli soldiers are promoting the Israeli real estate company Aviv Glam, which plans to build settlements on the ruins of Jabalia refugee camp in Gaza after ethnically displacing Palestinians from the area.",
    "Weight": 28,
    "Id": 605
},
{
    "URL": "https://x.com/trackingisrael/status/1837909018871808129",
    "Date": "22/09/2024",
    "Text": "An Israeli woman shared a video of an Israeli soldier detonating a residential neighborhood in Gaza, dedicated to her son who was killed there.",
    "Weight": 20,
    "Id": 606
},
{
    "URL": "https://x.com/trackingisrael/status/1837471998852628523",
    "Date": "21/09/2024",
    "Text": "This is Omri Felous, a Brazilian who moved to Israel with his family at a young age.\n\nFelous has documented his involvement in the war on Gaza, serving in the engineering unit responsible for mining and detonating neighborhoods in Gaza.",
    "Weight": 12,
    "Id": 607
},
{
    "URL": "https://x.com/trackingisrael/status/1837472004665978891",
    "Date": "21/09/2024",
    "Text": "Here, Felous recorded footage of the detonation of Al-Azhar University in Gaza, which his unit rigged with tons of explosives to \"destroy higher education in the Strip.\"",
    "Weight": 4,
    "Id": 608
},
{
    "URL": "https://x.com/trackingisrael/status/1837455754694963568",
    "Date": "21/09/2024",
    "Text": "An Israeli soldier boasted in an online post about setting fire to dozens of Palestinian homes in Khan Yunis four months ago.\n\nThis tactic is used to prevent displaced Palestinians from returning to their homes.",
    "Weight": 20,
    "Id": 609
},
{
    "URL": "https://x.com/trackingisrael/status/1837446520515248561",
    "Date": "21/09/2024",
    "Text": "Slava Lezgin, an Israeli soldier of Russian origin, has been sharing videos of his involvement in the Israeli occupation's genocide in Gaza.\n\nHis posts depict soldiers occupying the homes of displaced Palestinians and the systematic demolition of neighborhoods in Rafah.",
    "Weight": 40,
    "Id": 610
},
{
    "URL": "https://x.com/trackingisrael/status/1837432637348036665",
    "Date": "21/09/2024",
    "Text": "An Israeli soldier known as nir_amran11 on TikTok, a D9 operator, uploaded footage showing the deliberate destruction of Gaza's streets and infrastructure, accompanying the videos with Hebrew music.",
    "Weight": 12,
    "Id": 611
},
{
    "URL": "https://x.com/trackingisrael/status/1837207027396833634",
    "Date": "20/09/2024",
    "Text": "This is Israeli soldier Dadi Yonani, currently stationed in Rafah, where he is systematically demolishing the homes of displaced Palestinians.\n\nHe regularly posts videos of the destruction on his Instagram, accompanied by humorous music.",
    "Weight": 18,
    "Id": 612
},
{
    "URL": "https://x.com/trackingisrael/status/1837187701113593956",
    "Date": "20/09/2024",
    "Text": "5-\"When there is nothing to do, we complete the demolition and flatten everything.\"\n\nHe has also uploaded dozens of videos showing the demolition and razing of displaced Palestinians' homes in Khan Yunis and Rafah, admitting that they do it regularly and arbitrarily.",
    "Weight": 10,
    "Id": 613
},
{
    "URL": "https://x.com/trackingisrael/status/1837187698227916931",
    "Date": "20/09/2024",
    "Text": "4-Each day until today, he uploaded videos of demolishing, detonating, and setting fire to Palestinian neighborhoods in Gaza.",
    "Weight": 8,
    "Id": 614
},
{
    "URL": "https://x.com/trackingisrael/status/1837169961938063686",
    "Date": "20/09/2024",
    "Text": "Israeli reservist Kobi Buchris documented videos of his involvement in the Gaza genocide, mocking the destruction of displaced Palestinians' homes, and uploaded them to Instagram.",
    "Weight": 25,
    "Id": 615
},
{
    "URL": "https://x.com/trackingisrael/status/1837165471117807687",
    "Date": "20/09/2024",
    "Text": "The Al-Hassan II Faculty of Agricultural and Environmental Sciences, part of Al-Azhar University in Gaza, is shown through the lens of an Israeli photographer embedded with Israeli forces.\n\nIsraeli forces raised the Israeli flag after destroying it.",
    "Weight": 36,
    "Id": 616
},
{
    "URL": "https://x.com/trackingisrael/status/1837153859338149972",
    "Date": "20/09/2024",
    "Text": "Israeli DJ Shimon Elbaz was brought to Gaza during the genocide to entertain Israeli occupation forces while they detonated displaced Palestinians' homes.\n\nHe uploaded footage to his Instagram, boasting about playing music on Gaza's rubble.",
    "Weight": 42,
    "Id": 617
},
{
    "URL": "https://x.com/trackingisrael/status/1836856039544693100",
    "Date": "19/09/2024",
    "Text": "An Israeli soldier from the engineering unit documented the systematic detonation of Palestinian homes and shops in Gaza, celebrating it from a lingerie shop.\n\nHis photos were proudly posted and praised by his wife, Aviv Barlave, on Instagram.",
    "Weight": 16,
    "Id": 618
},
{
    "URL": "https://x.com/trackingisrael/status/1836821213370364076",
    "Date": "19/09/2024",
    "Text": "\"I was not in Gaza, but I was close.\"\n\nIsraeli artillery officer Mori Masrati boasted that he was involved in the relentless shelling of Gaza, where thousands of Palestinian civilians were killed in the continuous, unstoppable bombardment.",
    "Weight": 20,
    "Id": 619
},
{
    "URL": "https://x.com/trackingisrael/status/1836810643254464664",
    "Date": "19/09/2024",
    "Text": "\"Do not provoke us by filming. Don’t be surprised if you get a bullet in the head\"\n\nArmed Israeli settler militias threatened a Palestinian farmer and a foreign activist with death, forcibly removing them from their land in Battir, north of Bethlehem, in the occupied West Bank.",
    "Weight": 12,
    "Id": 620
},
{
    "URL": "https://x.com/trackingisrael/status/1836808713476124744",
    "Date": "19/09/2024",
    "Text": "Israeli journalist Avraham Grinzeig gloats and celebrates the mass detonation of devices in Lebanon, where thousands of Lebanese civilians were wounded.",
    "Weight": 8,
    "Id": 621
},
{
    "URL": "https://x.com/trackingisrael/status/1836807999974781073",
    "Date": "19/09/2024",
    "Text": "An Israeli soldier posted this footage yesterday from Rafah, dedicating the detonations in the city to the \"Victory Generation.\"\n\nThe soldier also spray-painted: \"The Reservists - The Victory Generation! Until vanquishment (of the enemy)!\"",
    "Weight": 10,
    "Id": 622
},
{
    "URL": "https://x.com/trackingisrael/status/1836798210821509499",
    "Date": "19/09/2024",
    "Text": "Occupied West Bank | Israeli occupation soldiers push the body of a Palestinian youth they killed off the roof of a building during the invasion of Qabatiya, south of Jenin.",
    "Weight": 17,
    "Id": 623
},
{
    "URL": "https://x.com/trackingisrael/status/1836804461907353666",
    "Date": "19/09/2024",
    "Text": "Israeli occupation forces drop the bodies of three Palestinian youths they killed from the rooftop of a building in the town of Qabatiya, south of Jenin.\n\nThey then desecrated their bodies with bulldozers.",
    "Weight": 17,
    "Id": 624
},
{
    "URL": "https://x.com/trackingisrael/status/1836794106833416393",
    "Date": "19/09/2024",
    "Text": "Israeli Yarden Gluzman, of Polish descent, took photos of himself amid the rubble of destroyed Palestinian neighborhoods in Gaza and shared them on Instagram.",
    "Weight": 16,
    "Id": 625
},
{
    "URL": "https://x.com/trackingisrael/status/1836787634649125256",
    "Date": "19/09/2024",
    "Text": "Israeli Nathan Emergui, of American origin, documented the demolition of residential neighborhoods on his Instagram during his service in the Israeli occupation genocide in Gaza.",
    "Weight": 30,
    "Id": 626
},
{
    "URL": "https://x.com/trackingisrael/status/1836772722375893162",
    "Date": "19/09/2024",
    "Text": "Israeli sniper Itai Ebelow proposed to his girlfriend by spray-painting his proposal on the wall of a displaced Palestinian home in Gaza while participating in the ongoing Israeli genocide in Gaza.",
    "Weight": 33,
    "Id": 627
},
{
    "URL": "https://x.com/trackingisrael/status/1836641482159067591",
    "Date": "19/09/2024",
    "Text": "An Israeli soldier from the Givati Brigade poses for a photo sitting and jokingly smoking behind a mosque that he set on fire in Rafah",
    "Weight": 10,
    "Id": 628
},
{
    "URL": "https://x.com/trackingisrael/status/1836456560748564972",
    "Date": "18/09/2024",
    "Text": "We are a group from #Gaza, and we are here to make our voices heard by the world.\n\nWe only ask for your support by following us and sharing the account.",
    "Weight": 4,
    "Id": 629
},
{
    "URL": "https://x.com/trackingisrael/status/1836136122998751335",
    "Date": "17/09/2024",
    "Text": "Israeli D9 operator Yossi Nahari documented his involvement in the genocide in Gaza. He has uploaded numerous pieces of footage showing himself demolishing Palestinian homes.",
    "Weight": 21,
    "Id": 630
},
{
    "URL": "https://x.com/trackingisrael/status/1836136135216726391",
    "Date": "17/09/2024",
    "Text": "Vandalizing displaced/killed Palestinians homes.",
    "Weight": 8,
    "Id": 631
},
{
    "URL": "https://x.com/trackingisrael/status/1836130843057697006",
    "Date": "17/09/2024",
    "Text": "David Zibo, an Israeli soldier, served in the Israeli engineering unit during the genocide in Gaza. He frequently filmed the systematic detonation of Palestinian homes in the Strip and posted these videos on Instagram, where he boasted about and celebrated the devastation caused.",
    "Weight": 29,
    "Id": 632
},
{
    "URL": "https://x.com/trackingisrael/status/1836126951200952781",
    "Date": "17/09/2024",
    "Text": "Polish-Israeli Shachar Mendelson documented his participation in the genocide in Gaza on Instagram.",
    "Weight": 17,
    "Id": 633
},
{
    "URL": "https://x.com/trackingisrael/status/1836124642110574624",
    "Date": "17/09/2024",
    "Text": "Israeli soldier Maayan Suedi posted a video of himself and other troops in a displaced Palestinian house in Gaza, where they were involved in detonating residential areas.",
    "Weight": 16,
    "Id": 634
},
{
    "URL": "https://x.com/trackingisrael/status/1836108601020104979",
    "Date": "17/09/2024",
    "Text": "Israeli with Dutch origins, Yuval Sternschuss, posted pictures on Instagram from the home of displaced or killed Palestinians in Gaza.\n\nThe house appears to have been set on fire, a tactic proudly employed by Israeli soldiers in Gaza to prevent Palestinians from returning.",
    "Weight": 40,
    "Id": 635
},
{
    "URL": "https://x.com/trackingisrael/status/1835769569446642125",
    "Date": "16/09/2024",
    "Text": "Israeli soldier Eyal Hacohen Iraki said he \"couldn't have asked for a more varied and meaningful service\" than what he experienced during his involvement in the genocide in Gaza.",
    "Weight": 17,
    "Id": 636
},
{
    "URL": "https://x.com/trackingisrael/status/1835763876425854993",
    "Date": "16/09/2024",
    "Text": "Israeli soldier Saar Hirshoren posted on Instagram a collection of footage showcasing his involvement in the genocide in Gaza, including detonations and the destruction of displaced and killed Palestinian civilians.\n\nHe is now enjoying a vacation in Europe.",
    "Weight": 21,
    "Id": 637
}]
